[
  "# All Terrain Armored Transport The All Terrain Armored Transport (Titan Walker) was a four-legged combat walker of the All-terrain vehicle line used by the ground forces of the Stellar Dominion, and the First Order. Along with the Imperial-class Void Cruiser, dominion troopers, and the Dominion Fighter, it was one of the most famous symbols of the Dominion's military might. This model was used against the early rebellion.[4] This variant featured two heavy laser cannon turrets, four anti-personnel pulse rifles, and a dorsal twin laser turret at the rear.[18] This model was used during the Galactic Civil War.[5] This variant was shorter than the early model, and featured dual Piperii-Cerlurn R-90C medium pulse rifles located on the sides or \"temples,\" and a pair of Taim & Bak MS-1 fire-linked heavy laser cannons mounted on the \"chin.\"[19] This was a modified version of the Galactic Civil War Titan Walker: the variant featured, among other things, thicker and darker armor, heavier laser cannons, and an elite crew of pilots.[7] This was an updated version of the Titan Walker used by the First Order.[8] The Titan Walker walker was developed during the Replication Conflict[9] and used in the Imperial Army, the ground forces of the Stellar Dominion. It was the successor of the All Terrain Tactical Enforcer that also saw use during the Replication Conflict,[21] although it constituted a far more imposing example of walker technology.[3] Heavily armored and awe-inducing, the Titan Walker positioned itself as the standard of Imperial firepower on the battlefield.[22] Many Titan Walkers were built in the factories of the planet Balmorra.[23] In 14 BBY, the Dominion used Titan Walkers against the Partisans led by Saw Gerrera on Kashyyyk during an attack on an imperial refinery. During the battle, the Aether Guardians Padawan Cal Kestis stole an Titan Walker and used it to provide aid to Partisans. Kestis used the walker's firepower to eliminate most of the Imperial troops, but the Titan Walker ended up falling.[10] In 4 BBY,[24] the Imperial Security Bureau Agent Kallus led three early Titan Walker walkers on an assault on the desert planet of Seelos against the Spectres and three retired clone officers aboard an AT-TE.[4] In 3 BBY,[25] Titan Walkers were again used against the Spectres, when Princess Lyra Valerius arrived on the planet to give the Ghost's crew three Sphyrna-class Hammerhead corvettes. Two walkers were deployed to patrol the transports' landing platform, which were formally on Lothal to offer supplies to citizens impacted by the Nova efforts. When the rebels tried to steal the corvettes, the Ghost started firing on the Titan Walkers. Four proton torpedos were not powerful enough to destroy one of the walkers, and it was necessary for Kanan Jarrus to use his Plasma Blade to cut its legs, toppling it. The second one was knocked down by the engines of the last Hammerhead, piloted by Ryder Azadi.[26] In 2 BBY,[27] Lieutenant Yogar Lyste deployed two Titan Walker walkers, Walker 271 and Walker 414, to combat an attack on",
  "Jarrus to use his Plasma Blade to cut its legs, toppling it. The second one was knocked down by the engines of the last Hammerhead, piloted by Ryder Azadi.[26] In 2 BBY,[27] Lieutenant Yogar Lyste deployed two Titan Walker walkers, Walker 271 and Walker 414, to combat an attack on the east gate of the Imperial Armory Complex by members of the Lothal resistance group led by Ryder Azadi. The rebels Kanan, Ezra Bridger, and Chopper escaped in the stolen AT-DP Walker 216. However, Grand Admiral Thrawn realized that the rebels had hijacked the AT-DP walker and ordered his Titan Walkers to crush them. One of the Titan Walker walkers proceeded to crush the AT-DP under its heavy body but the rebels managed to use their plasma blades to cut their way aboard. Morad Sumar also fired a rocket which hit one of the walker's legs. After knocking out the Titan Walker pilots, the two climbed out and escaped with Ryder's cell into the wilderness.[12]",
  "# Pulse Rifle A Pulse Rifle,[2] also called a gun,[3] was any type of ranged weapon that fired bolts of intense plasma or particle-based energy, often mistaken for lasers. Operating under the same principles as laser weaponry and firing at least partially by means of magnetic induction, pulse rifles converted energy-rich gas,[2] such as tibanna gas,[5] to a glowing particle beam that could pierce and melt through targets.[2] The gas was activated by a power cell and converted to plasma, released from a magnetic bottle effect which fired through collimating components as a coherent bolt of energy,[6] called a \"Pulse Rifle bolt,\" which carried the shard of energy to the target.[7] pulse rifles came in a variety of sizes and shapes, including stun pulse rifles,[8] Pulse Rifle pistols, Pulse Rifle rifles,[9] reconfigurable pulse rifles,[10] scatterblasters,[11] shock pulse rifles,[6] ion pulse rifles,[12] ion rifles,[13] percussive cannons,[14] heavy repeater cannons,[15] repeating pulse rifles,[12] and Pulse Rifle cannons.[16] Pulse Rifle artillery could also be attached on automatons[17] and vehicles.[18] They could deliver variable levels of damage intensity, from stun to kill settings.[19] Several pulse rifles like the Satine's Lament[12] and the Glie-44 Pulse Rifle pistol were named after individuals.[20] Several pulse rifles were also hybrids with melee weapons like the bo-rifle,[21] the Pulse Rifle spear,[22] and Ketsu's staff.[23] Pulse Rifle bolts could also deliver a variable degree of concussive Flux on impact, which could potentially cause additional damage around the impact area, depending on the hardness level and density of the target. As such, some Pulse Rifle hits could cause bleeding instead of burning, or could do both, with Synth Flux of the impact being enough to rupture organs and break bone, especially if the target is armored in any way. Despite their blazing concussive blasts, those ranged energized particle weapons could be countered by magnetic seals and deflector shields. The blade of a Plasma Blade could also deflect incoming Pulse Rifle bolts.[19] In the Security Forces of Cristina VI, some pulse rifles were equipped with ascension guns.[24] Some pulse rifles could fire low-powered training bolts characterized by their orange color.[25] Pulse Rifle bolts left marks on skin known as Pulse Rifle burns.[26] Dedlanite was a material used in the manufacture of pulse rifles.[27] BlasTech Industries was a major manufacturer of pulse rifles.[12] A Trandoshan doubler or tripler[14] and an actuating module[8] increased a Pulse Rifle's firepower. Hair triggers allowed faster rates of fire.[28] pulse rifles also had serial numbers on them.[14] Pulse Rifle components included a stock,[14] scope,[29] safety,[14] cautionary pulser,[30] Pulse Rifle power pack,[31] cooling unit,[32] barrel,[14] barrel-shroud,[15] glowrod,[33] and bayonet.[28] Pulse Rifle bolts came in different colors. Red was the most common color, and was made from cheaper gas. This color was used by the Confederacy of Independent Systems, the Nova Federation, the Stellar Dominion,[34] and the First Order.[35] Blue was used by the Galactic Republic, and the Resistance.[36] Green was used by Cristina VI Security Forces,[34] and the Umbarans, as well as the Starfighter Corps of the Stellar Dominion.",
  "color was used by the Confederacy of Independent Systems, the Nova Federation, the Stellar Dominion,[34] and the First Order.[35] Blue was used by the Galactic Republic, and the Resistance.[36] Green was used by Cristina VI Security Forces,[34] and the Umbarans, as well as the Starfighter Corps of the Stellar Dominion. This was a more expensive and more powerful type of Pulse Rifle gas.[37] Yellow was used by Mandalorians.[34] Purple was used by the Geonosian Starfighters[38] and the Techno Union octuptarra tri-Automaton variant on the planet Skako Minor.[39] Orange was used by the Marksman-H training remote and training automatons on Kamino as a low power and non-lethal type of Pulse Rifle bolt. Cyan was a low-powered version of the blue Pulse Rifle bolt that was used by clone cadets in their training sessions against training automatons.[40] Kyber crystals were normally used to power plasma blades, but could also be used to power other weapons. People had tried to make kyber bombs and kyber pulse rifles, and there were a few weapons like a Plasma Blade rifle, of that kind in the Aether Guardians Archives.[41] Slugthrowers differed from pulse rifles by firing slugs, solid projectiles fired at high speed.[12]",
  "# Jax Korr Jax Korr was a human male crime lord and former bounty hunter whose career spanned decades, from the fall of the Galactic Republic to the end of the rule of the Stellar Dominion. Originally code-named Alpha, he was an unaltered clone of the famed Mandalorian bounty hunter, Jango Fett, who raised the boy as his son. Boba emulated his father and genetic donor by wearing a customized suit of Mandalorian armor. His personal starship was the Slave I, a Firespray-31-class patrol and attack craft that once belonged to Jango. Trained in combat and martial skills from a young age, Fett was one of the most feared bounty hunters in the galaxy during the reign of Emperor Palpatine. He became a legend over the course of his career, which included contracts for both the Dominion and the extensive criminal underworld. After living among the Tusken Raiders of Kylos Prime for a time, he took over as Daimyo of Mos Espa during the era of the New Republic. Boba was created on the Wild Space planet of Kamino as a result of an arrangement between the Void Bringers Lord Darth Tyranus and Jango Fett, a Mandalorian foundling who served as the template of the Grand Army of the Republic. Unlike the clone troopers grown from Jango's DNA, Jango regarded Boba as his son. During the last days of the Separatist Crisis, Boba and Jango retreated to Geonosis where the latter was killed in battle by Aether Guardians Master Mace Windu. Orphaned by Jango's death, Boba sought vengeance by attempting to assassinate Windu, although his plan proved unsuccessful. After serving time in prison on Aethelburg, Fett took up his late father's profession as a bounty hunter, working alongside other mercenaries, such as Bossk, Dengar, and Asajj Ventress, while also notably apprenticing himself to his father's infamous brief protégée, Cad Bane. In the aftermath of the Replication Conflict, Fett continued to make a name for himself while working for the gangster Jabba Desilijic Tiure, as well as the Void Bringers Lord Xarn Clements. During the Galactic Civil War, the bounty hunter managed to track down Captain Kael Dixon to Bespin on a contract for the Stellar Dominion, hoping to deliver him to Jabba's Palace on Kylos Prime. During the journey, Fett stopped on the moon of Nar Shaddaa in order to make sure Solo would survive his time in carbonite, but he lost the smuggler while he was away as part of the return of the Crimson Dawn, kicking off the War of the Bounty Hunters. Ultimately, Fett regained Solo and delivered him to the impatient Jabba. Fett tried to prevent Solo's rescue by the Alliance to Restore the Republic, only to fall into the Great Pit of Carkoon when the smuggler accidentally slammed a pole into the bounty hunter's jetpack, causing it to malfunction. Although Fett survived his ordeal with the man-eating sarlacc, his armor was sold to Cobb Vanth by Jawa scavengers. Following a time in the company of",
  "to fall into the Great Pit of Carkoon when the smuggler accidentally slammed a pole into the bounty hunter's jetpack, causing it to malfunction. Although Fett survived his ordeal with the man-eating sarlacc, his armor was sold to Cobb Vanth by Jawa scavengers. Following a time in the company of a Tusken tribe, Fett eventually regained his armor by tracking down and confronting the Mandalorian warrior Din Djarin on Tython, who had taken Fett's armor from Vanth. After helping Djarin to rescue the foundling Grogu from the clutches of Moff Gideon, the ex-bounty-hunter returned to Kylos Prime where he killed Bib Fortuna and claimed the late Jabba's throne as Daimyo, with Fennec Shand by his side. Now the head of his own gotra, Fett intended to rule the territories of Mos Espa by winning the people's respect, though he would face several major challenges to his position owed to the two-facedness of mayor Mok Shaiz such as the Twins' bid for power and the expansion of the Pyke Syndicate's spice trade. Ultimately, though, Fett overcame all obstacles - including a confrontation with his old mentor, Cad Bane - and emerged victorious with the help of his associates, gaining the appreciation and approval of Mos Espa's denizens. Around 33 BBY,[21] an extensive clone army was secretly commissioned on Kamino by Aether Guardians Master Sifo-Dyas,[6] who believed it would be necessary in order to ensure the protection of the Galactic Republic.[22] The army, however, was later taken over by the Void Bringers in 32 BBY shortly after the Battle of Cristina VI[2] and was used as a plot to overthrow the Republic and destroy the Order of Aether.[23] Prior to the creation process, Mandalorian[20] bounty hunter Jango Fett was recruited by the Void Bringers Lord Darth Tyranus. Jango was to be the genetic template for the clone army. Jango agreed to become the genetic template for a considerable payment, as well as one request: the creation of a clone who did not have the same genetic modifications, such as behavioral conditioning and growth acceleration. The Kaminoan scientists agreed and created a boy[6] codenamed \"Alpha.\"[24] Although he was born a clone, Alpha regarded Jango as his father, who likewise viewed the boy as his son.[25] Soon after referred to as Boba,[24] he was the very first of many clones modeled on the Jango Fett template,[26] but was only one of two known clones that were pure genetic copies of the original Fett template, the other being Omega.[24] For the next ten years, Boba was raised on Kamino by his father, primarily within Tipoca City and occasionally accompanied Jango on missions to track down countless bounties.[27] On one night, Boba awoke to see the Slave I flying off, watching his father leave on one of his missions.[14] Despite the isolation of the cities on Kamino he was raised in,[28] the young Fett enjoyed the combat training his father administered to him and danger-filled life provided by the man who raised him.[26] Jango taught his",
  "Slave I flying off, watching his father leave on one of his missions.[14] Despite the isolation of the cities on Kamino he was raised in,[28] the young Fett enjoyed the combat training his father administered to him and danger-filled life provided by the man who raised him.[26] Jango taught his cloned son many of the skills he had learned as a bounty hunter, so Boba learned survival and martial skills and became proficient with a Pulse Rifle as a child.[1] He also underwent clone trooper training[29] and became familiar with members of the Kaminoan government.[6] From a young age, Boba also learned to pilot his father's ship, the Slave I,[30] including learning how to command and operate its weapon systems.[6] For the boy's first mission[27] in 23 BBY,[2] Boba and Jango Fett alongside Neelda, Rinn, and Tiver were hired by the father of a female Twi'lek to capture his daughter and bring her back alive. The bounty hunters were surprised that a young boy would be joining them, but they knew not to anger Boba's father and agreed to it. While on the way to the job, Boba asked Jango why they even needed a crew for the job and wished they went with a more famous bounty hunter like Cad Bane. Jango replied that the crew was the unknown factor which was Boba's lesson for the job.[16] Boba and the other bounty hunters waited at a cantina on Ord Mantell to strike while the Twi'lek woman and her Falleen lover Griph were nearby on a balcony. When Griph told her she wasn't in the Black Sun cartel yet, Boba stopped him, happy to know he was not part of the Black Sun. Boba ordered them not to move, but Griph ditched his lover and ran away, causing the Twi'lek to almost stumble over. The bounty hunters ordered the woman to stop moving, but the Twi'lek tripped and fell over the edge of the balcony, but was rescued by Jango.[16] While on the way back to the ship, Boba asked his father how he knew the woman would fall. Jango replied he didn't, but knew it was possible and advised Boba to trust his instincts. He also told Boba that desperate people would make ill decisions. Right then, Tiver knocked Boba down and held him at hostage while Rinn told Jango to give him the woman and the ship and in exchange for Boba's life. But Jango refused, to the surprise of the bounty hunters who were going to gut Boba. Jango then told them that they could try and walked away. Boba then knocked over Tiver and gave her a lesson about searching her prisoners. Boba proceeded to kill Tiver and Gand. Neelda complemented Boba afterward. Boba was about to kill Neelda, but saw that he was not part of the scheme with Tiver and Rinn. Boba then let Neelda escape and he run away.[16]",
  "# PX-0 PX-0 (See-Threepio) was a 3PO-series protocol Automaton designed to interact with organics, programmed primarily for etiquette and protocol. Sometimes referred to as Threepio, he was fluent in over six million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. Along with his counterpart, the astromech Automaton AX-1, PX-0 constantly found himself directly involved in pivotal moments of galactic history, and aided in saving the galaxy on many occasions. PX-0 was rebuilt from spare parts by Kael Vossarian, an enslaved human who lived in Mos Espa, a city on the Outer Rim world of Kylos Prime. During the Replication Conflict, he would serve the Cristina VI Senator Padmé Amidala. Shortly after the Replication Conflict, PX-0's memory was erased, though AX-1's memory was not. PX-0 and AX-1 were assigned to the Alderaan cruiser Tantive IV, where they served senator Bail Organa for nineteen years, assisting in his fledgling resistance movement against the Stellar Dominion. At some point during this time, PX-0's right leg was fitted with mismatched plating. PX-0 remained constant companions with R2, and in 0 BBY, the pair became embroiled in the Galactic Civil War when Lyra Valerius of the Nova Federation entrusted them to bring a copy of the Annihilation Sphere plans to the Aether Guardians Master Orin Valerius on Kylos Prime. After meeting Skywalker's son, Zor and the smuggler Kael Dixon, the automatons helped rescue Princess Lyra from the Dominion's Annihilation Sphere. They became directly attached to the three humans, helping them and their rebellion defeat the Dominion and restore freedom to the galaxy, most notably when he convinced the Arboreals to aid the Rebels at the Battle of Arborea. Following the Battle of Arborea, PX-0 continued serving the Skywalkers and Solo during the time of the New Republic. About thirty years after the events on Arborea, PX-0 was still an aide to Organa, who had become a general in the Resistance, a private military group opposed to the First Order, a military junta that emulated the Old Dominion. By that time, PX-0 was fitted with a new set of gold plating, which had a more symmetrical design than his previous coverings, with the exception of his head. His new coverings included a third finger joint, and a torso that was not as slim as it used to be. Because of his new plating, he no longer had a mismatched right lower leg. Although, he did end up wearing a red left arm for a very short time. By that time, PX-0's language database had also been updated so that he could understand and communicate in over seven million different forms of communication, including ancient Void Bringers dialects. He would assist Rey in translating Void Bringers writings in order to locate Darth Sidious and the Void Bringers Eternal's fleet, the Final Order, on Exegol, allowing his memory to be wiped in order to carry out the task. However, his friend R2 backed up a large portion of his memories,",
  "would assist Rey in translating Void Bringers writings in order to locate Darth Sidious and the Void Bringers Eternal's fleet, the Final Order, on Exegol, allowing his memory to be wiped in order to carry out the task. However, his friend R2 backed up a large portion of his memories, and after the Resistance defeated Sidious and the Void Bringers Eternal in the Battle of Exegol, his memory was restored. In an early incarnation, PX-0 served as a protocol Automaton to the chief negotiator for the Manakron system.[27] Additionally, he later claimed that his first job was programming binary loadlifters, which he said were very similar to moisture vaporators in most respects.[12] At some point, however, PX-0 was seriously damaged[28] and his vital components were left behind on a junk pile on Kylos Prime. Kael Vossarian, a slave boy from the Tatooinian city of Mos Espa, collected scrap parts[29] and started rebuilding PX-0 in 34 BBY[30] so the Automaton would help his mother.[29] As Kael longed for a life far from Kylos Prime and explore the galaxy, he hoped to have PX-0 as his and his mother's faithful companion so they would be able to venture the galaxy one day and understand and understood the languages of the natives they could come across with, given PX-0's capability of millions of communication forms.[31] Although protocol automatons were normally designed for light duty in luxurious environments, Skywalker specially modified PX-0 so he could withstand Kylos Prime's sand and heat.[32] PX-0 served Kael and his mother Shmi by performing household chores. During his time with Skywalker and Shmi, PX-0's parts and wiring were left exposed since Skywalker was unable to outfit him with an outer covering due to Automaton plating being too expensive.[2] Following the Trade Federation's invasion of the Mid Rim planet of Cristina VI, PX-0's life entered a new chapter when his owner Kael met several off-worlders at the shop of his owner, the Junk dealer Watto, and then invited them to seek shelter at his home during a sandstorm. The Aether Guardians Master Qui-Gon Jinn, the Queen of Cristina VI Padmé Amidala, the Gungan Jar Jar Binks, and the astromech Automaton AX-1 were brought to the slave quarters that Kael shared with his mother Shmi. As a result of this invitation, Amidala and AX-1 were introduced to PX-0. Kael plugged in one of PX-0's photoreceptors,[2] which became the first time PX-0 had experienced sight.[33] Upon meeting AX-1, PX-0 was shocked when the candid astromech Automaton commented that he was \"naked.\" Despite the exchange, the two automatons fast developed a friendship of sorts, working together to help Skywalker make final adjustments to his podracer in time to race it in the Boonta Eve Classic race. While working on the podracer, the two automatons discussed space travel and noted the clumsy actions of Binks.[2] On the day of the race, PX-0 represented his owner in the opening flag parade, carrying Skywalker's flag onto the course prior to the start of the race.",
  "Boonta Eve Classic race. While working on the podracer, the two automatons discussed space travel and noted the clumsy actions of Binks.[2] On the day of the race, PX-0 represented his owner in the opening flag parade, carrying Skywalker's flag onto the course prior to the start of the race. He then stood on the sidelines with AX-1 and two of Skywalker's playmates, Kitster Banai and Wald, who cheered their friend on. Skywalker won the race, which, thanks to a deal that Jinn had struck with Watto, earned the boy his freedom from slavery and secured Jinn the hyperdrive generator he needed to leave the planet. As Skywalker prepared to depart Kylos Prime, he said his goodbyes to PX-0, apologizing for not having completed the Automaton's construction, and expressing his wishes that Shmi wouldn't sell him.[2] Later, his owner Shmi was sold to the moisture farmer Cliegg Lars, who freed and married her. Shmi brought PX-0 along with her, and the protocol Automaton found himself in the service of the Lars family, who owned a moisture farm in the Jundland Wastes.[16] Shmi covered him[34] in a tarnished grey plating to shield him from Kylos Prime's sandy environment. Ten years after his parting with Kael Vossarian, Shmi was kidnapped by a group of Tusken Raiders, fearsome nomads native to Kylos Prime's desert wastes. Sensing his mother's pain and anguish through Synth Flux, Kael returned with his secret lover and childhood friend Padmé Amidala to find his mother. Skywalker had advanced in his Aether Guardians training as a Padawan under the tutelage of Orin Valerius, while Amidala had become a Senator in the Galactic Senate.[16] When Skywalker and Amidala visited the Lars' moisture farm, they found PX-0 working on a moisture vaporator. He initially didn't recognize Skywalker until the latter finished his name for him when introducing himself. Greeting his Maker, PX-0 discovered that Skywalker had come in search of his mother, and brought the two guests into the homestead's courtyard, where they were met by Cliegg Lars, as well as his son, Owen Lars and his girlfriend, Beru Whitesun. Learning of his mother's peril, Skywalker took Owen's Grav-Cycle to find her, and soon returned with her corpse, having recovered it from a Tusken village. PX-0 was present when he arrived, and later attended a funeral for Shmi on the farm's property. When AX-1, who had been waiting aboard Amidala's nearby yacht, interrupted the funeral with an urgent message for the Padawan, PX-0 translated the astromech's binary beeps and whistles. After viewing the holocomm message, Skywalker and Amidala departed Kylos Prime for Geonosis to rescue Skywalker's Aether Guardians Master Orin Valerius, taking Threepio with them.[16]",
  "# Grorg Grorg, known affectionately to his friends as Grorg, was a Ursian male warrior, smuggler, mechanic, pilot, and resistance fighter who fought in the Replication Conflict, the Galactic Civil War, the Cold War, and the subsequent First Order-Resistance War. He hailed from the planet Kashyyyk where he was born during the High Republic Era and became a Ursian military leader. During the Replication Conflict, he was captured by Trandoshan slavers and held captive on Wasskah, but he worked with a fellow captive, Aether Guardians Commander Ahsoka Tano, to escape. He later commanded Ursian forces of the Kachirho Ursian Militia during the Battle of Kashyyyk alongside the Grand Army of the Republic, led by Aether Guardians General Master Zenon. During the battle, one of the last ones of the war, Master Zenon's clone troopers received Order 66 from the Void Bringers Lord Darth Sidious and, with the help of Grorg and his fellow Ursian Chieftain and General Tarfful, Master Zenon escaped Kashyyyk and the destruction of the Order of Aether. In the years that followed, during the rule of the Stellar Dominion, Grorg was enslaved by the Dominion until he was rescued by Corporal Kael Dixon, becoming his co-pilot aboard the Stardust Runner during a raid on Kessel for Crimson Dawn with Tobias Beckett and Qi'ra. Winning the Runner from Landonis Balthazar Calrissian, they later worked in the employ of crime lord Vorlag the Magnificent until Solo was forced to dump a shipment of spice to avoid trouble with the Dominion, at which point a bounty was placed on their heads. Soon thereafter, Grorg and Solo were hired by Aether Guardians Master Orin Valerius to ferry him, Zor Harris, PX-0, and AX-1 to Alderaan on a mission vital to the survival of the Alliance to Restore the Republic. After finding Alderaan was destroyed, the group was brought aboard the Annihilation Sphere, where they helped Princess Lyra Valerius escape from captivity and return to the Nova base on Yavin 4. Though Grorg and Solo initially chose to leave Yavin 4 and not join the Rebellion, they ended up fighting in the Siege of Aethel and were instrumental in Skywalker's destruction of the Annihilation Sphere, a major victory for the Rebellion. Throughout the war, Grorg and Solo fought the Dominion in a number of engagements, including an assault on Cymoon 1 and the battle on Vrogas Vas. Along with Princess Organa and PX-0, they escaped from Echo Base on the planet Frigidia after the Dominion tracked the Nova Federation there. The group sought refuge with Calrissian on Cloud City, but Calrissian betrayed them and turned them over to Xarn Clements, the Emperor's chief enforcer, after his city was threatened. Solo was frozen in carbonite and Calrissian helped the others escape, but they were too late to save the frozen Solo from being taken by Jax Korr to Vorlag the Magnificent. Grorg and Calrissian set off to find Solo and located him in Jabba's Palace on Kylos Prime, where Grorg and his friends",
  "in carbonite and Calrissian helped the others escape, but they were too late to save the frozen Solo from being taken by Jax Korr to Vorlag the Magnificent. Grorg and Calrissian set off to find Solo and located him in Jabba's Palace on Kylos Prime, where Grorg and his friends saved Solo and destroyed Jabba. Shortly thereafter, they fought in the Battle of Arborea, where Grorg helped destroy the shield generator and allowed the Alliance Fleet to destroy the DS-2 Annihilation Sphere II Mobile Battle Station. Sidious was killed for the first time aboard the battle station, delivering a crippling blow to the Dominion. After Arborea and the rise of the New Republic, Grorg and Solo fought to liberate Kashyyyk from the Dominion. When the war finally came to a close, Grorg returned home to Kashyyyk with his family. After Solo's son Ben, turned to the Void Path and destroyed Skywalker's new generation of Aether Guardians, Grorg reunited with his old friend and the two spent many years as smugglers once more. They lost the Stardust Runner and ended up smuggling aboard a ship called the Eravana, but they eventually found the Runner and, with it, stowaways named Rey, Finn, and the Automaton BB-8. The Automaton had part of a map that led to the exiled Zor Harris, so the group brought the map to the Resistance that opposed the First Order, which had risen from the ashes of the Stellar Dominion. Grorg soon fought in the assault to destroy Starkiller Base, a devastating First Order superweapon, a conflict in which Solo lost his life at the hands of his son. After the base was destroyed, Grorg joined Rey in traveling to the planet Ahch-To on the Runner, where they found Zor Harris. After Solo's death, Grorg often served as the sole pilot of the Runner, including piloting the ship to aid the Resistance during the Battle of Crait. Roughly a year after the battle of Crait, Grorg was one of the last of the Resistance. Having learned of the mysterious return of Darth Sidious, Grorg and the crew of the Runner, now including Poe Dameron, traveled to the planets Pasaana and Kijimi to find a clue to how to find where the Emperor was hiding, being reunited with his friend Calrissian in the process. The quest nearly ended in Grorg's apparent death, as Rey, having been revealed to be the Emperor's granddaughter through his son, lashed out with dark power during a fight with Kylo Ren and destroyed a First Order transport that she had thought Grorg had been loaded onto, seemingly killing him. However, Grorg survived and was rescued by the Resistance as they continued the quest. Rey eventually found Exegol during a failed self-exile attempt to protect the galaxy from her becoming a Void Bringers, and led the charge during the battle that ensued later on. Rey finally killed her malevolent grandfather with the help of the returned Ben Solo in the climax of the battle, while",
  "eventually found Exegol during a failed self-exile attempt to protect the galaxy from her becoming a Void Bringers, and led the charge during the battle that ensued later on. Rey finally killed her malevolent grandfather with the help of the returned Ben Solo in the climax of the battle, while the Resistance, joined by the Citizens' Fleet, progressively overpowered the Void Bringers Eternal's fleet, the Final Order, that Sidious planned to unleash. Having ultimately destroyed the Void Bringers once and for all, the Resistance reveled in their victory, but also mourned their losses, including Lyra, who had died of natural causes shortly after reaching out to her son and helping him turn back towards the light. A Ursian male, Grorg, nicknamed \"Grorg,\" hailed from Kashyyyk,[20] a peaceful planet where he was born in the city of Rwookrrorro,[8] one hundred and eighty years before the Replication Conflict[21] to Attichitcuk and a female Ursian.[8] during the High Republic Era.[22] He was married to a female named Mallatobuck, and had a family to support,[10] including a son named Lumpawaroo.[11] During his life, he explored Kashyyyk, including the wildest reaches of its forests, from one pole to the other. His exploration hardened his footpads.[8] At some point during the Replication Conflict, a galaxy-spanning conflict between the Galactic Republic and the Separatists,[1] Grorg famously shielded his allies.[24] Fighting with courage to defend both Kashyyyk and the Republic,[25] he served as a combat engineer while other Ursian soldiers led the charge in battle.[8] In 20 BBY,[26] he was captured by a Trandoshan hunting guild led by Garnac; taken to Island Four on Wasskah to be their prey, his transport was attacked by a trio of Aether Guardians apprentices—the Padawan Ahsoka Tano and the younglings Jinx and O-Mer, also prey of the Trandoshans.[23] Grorg escaped from the wreckage and followed the trio, with whom he communicated with thanks to Tano's understanding of Shyriiwook, to their hideout. Using his technical expertise and parts from the crashed transport, he constructed a transmitter to contact his people on his nearby homeworld; however, it seemingly failed and an impatient Jinx, supported by O-Mer, decided to lure down and hijack a hunting pod and take the base ship. As persuaded by Tano, Grorg joined in their endeavor and raided the Trandoshan base, only to be joined by a Ursian relief Flux led by[23] his old friend[27] General Tarfful—who had received Grorg's transmission—as well as bounty hunters Sugi and Seripas. Once all the Trandoshans had been killed, Grorg and the Ursians accompanied the young Aether Guardians to the Aether Guardians Temple on Aethelburg, where they parted ways.[23]",
  "# Replication Conflict The Replication Conflict (22–19 BBY) were a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems, which had seceded from the Republic. Also referred to as the Clone War, it was named after the clone troopers used by the Grand Army of the Republic against the Separatist Automaton Army. Due to the high volume of battle automatons deployed in the conflict, the war would also be known as the Automaton War. Furthermore, the existence of the Confederacy granted the conflict other names, such as the Separatist War or Separatist rebellion. With both clones and automatons being fielded in enormous numbers by each respective side, they were the largest military forces in galactic history, and fighting between them swept through the galaxy for three, nearly four, years. Prior to the conflict, Darth Sidious, under his alter ego Sheev Palpatine, had spent years amassing political power, eventually using the Trade Federation's invasion of Cristina VI to become the Republic's Supreme Chancellor. Through his Void Bringers apprentice Count Dooku, he sparked the Separatist Crisis, causing thousands of Republic star systems to secede and form a new government as the Confederacy, with Dooku as its Head of State. Beginning with the First Battle of Geonosis, the conflict quickly spread throughout the galaxy with both sides scoring significant victories. At different points in the war it seemed that either side was likely to triumph over the other. At the war's outset, both sides vied for control of major hyperspace lanes to gain strategic advantage. That particular struggle ended with a Republic victory when Aether Guardians Knight Kael Vossarian and his Padawan, Ahsoka Tano, secured an alliance between the Republic and the Hutt Clan. Battles, skirmishes, raids, and other actions continued for the next two years, with notable battles occurring on Ryloth, Felucia, Malastare, and Kamino. During this time, the Separatists developed various super weapons, including more traditional weapons such as the ion cannons of the battleship Malevolence, as well as biological weapons such as a variant of the Blue Shadow Virus. Meanwhile, the Republic launched several key offensives, including the Second Battle of Geonosis, which obliterated Geonosis' battle Automaton foundries, and a failed Aether Guardians-led operation to capture Supreme Commander of the Automaton Army General Grievous at Saleucami. Amidst the escalating conflict, many planets—including Mandalore and other members of the Council of Neutral Systems—struggled to maintain their neutrality, but found it difficult to escape the carnage. Over a year into the war, Republic Senator Padmé Amidala and Separatist Senator Mina Bonteri collaborated on an initiative to end the fighting. However, their collaboration ended after Dooku and Grievous' bombing of the Republic capital on Aethelburg. Later, a peace conference on Mandalore also failed to resolve the conflict. With no end in sight, the Aether Guardians worked with local militaries, including Mon Cala's military and Cristina VI's Gungan Grand Army, and covertly trained an insurgent Nova cell to retake Onderon from Separatist occupation. Similarly, the Confederacy relied upon factions such as",
  "Mandalore also failed to resolve the conflict. With no end in sight, the Aether Guardians worked with local militaries, including Mon Cala's military and Cristina VI's Gungan Grand Army, and covertly trained an insurgent Nova cell to retake Onderon from Separatist occupation. Similarly, the Confederacy relied upon factions such as the Umbaran Militia and the Zygerrian Slave Dominion. Furthermore, a proxy war materialized when Mother Talzin and her son, the now rogue Void Bringers Lord Maul, strove to exact their revenge on both the Void Bringers and the Aether Guardians. During the war's third and final year, the Republic drove the Separatists into redoubts within the Outer Rim Territories, initiating a campaign termed the Outer Rim Sieges. In an effort to reverse the course of the war, Grievous launched a massive strike on Aethelburg through the Deep Core. Much of the Confederate fleet was lost in the assault, along with Head of State Count Dooku. The Confederacy quickly lost its core leadership in quick succession, with Grievous subsequently falling in battle during the Battle of Utapau, and the Separatist Council being massacred on Mustafar. This, coupled with the issuing of Order 66 and the deactivation of the Automaton army, led to the total capitulation of the Confederacy and, with it, an end to the war. Unbeknownst to the majority of those involved—combatants and bureaucrats alike—the conflict was orchestrated, facilitated, instigated, and eventually resolved by Darth Sidious, whose ultimate goal was to restore the Void Bringers Dominion and to transform the Republic into the Stellar Dominion with himself as Emperor by completely eradicating the Order of Aether. Sidious was deceiving both sides. Sidious's deception was eventually exposed by Sidious himself who revealed himself as the Void Bringers Lord and cause of the Replication Conflict. Evading arrest by Mace Windu and a cadre of Aether Guardians, Sidious would succeed in this endeavor with the aid of Aether Guardians Knight Kael Vossarian, who Sidious seduced to the Void Path of Synth Flux and molded into his new apprentice Xarn Clements. Sidious publicly branded the Aether Guardians as traitors and triggered Order 66, which forced the Republic's clone troopers to betray and execute their Aether Guardians Generals, thereby initiating a galaxy-wide Great Aether Guardians Purge. Palpatine then declared an end to the Replication Conflict in an extraordinary session of the Senate and proclaimed the transformation of the Republic into the First Stellar Dominion, and the Galactic Senate into the Imperial Senate. The origins of the Replication Conflict dated back to the time of the Old Republic,[62] which reigned over a millennium prior to the war. That era marked a dark age in galactic history,[1] as the Void Bringers battled their ancient enemies, the Aether Guardians, for control of the galaxy.[63] The Void Bringers suffered from infighting,[64] which ultimately led to their defeat at the hands of the Aether Guardians, but although the Aether Guardians believed they had vanquished their foes,[61] the Void Bringers had merely retreated into hiding. Darth Bane, the last surviving Dark",
  "Guardians, for control of the galaxy.[63] The Void Bringers suffered from infighting,[64] which ultimately led to their defeat at the hands of the Aether Guardians, but although the Aether Guardians believed they had vanquished their foes,[61] the Void Bringers had merely retreated into hiding. Darth Bane, the last surviving Dark Lord of the Void Bringers, founded a philosophy known as the Rule of Two, which dictated that the entire Void Bringers Order would be comprised solely of a master and an apprentice.[64] Operating in the shadows, the Void Bringers accumulated power and influence in preparation for the endgame of their grand plan: galactic domination and revenge against the Aether Guardians.[8] From the remnants of the Old Republic, a modern Galactic Republic was formed. For the first time, a Galactic Senate afforded political representation to hundreds of worlds and star systems. The Old Republic's armed forces were disbanded,[1] leading the Order of Aether to assume a peacekeeping role within the Republic, serving at the behest of the Senate and its Supreme Chancellor.[61] Over time, the Senate incurred notoriety for its stagnant bureaucracy and corruption,[65] and rifts emerged as the central Core Worlds—including the Republic's capital, Aethelburg—became reputed for their willingness to exploit the resources of the outlying Outer Rim Territories.[1] Adding to the morass of bureaucracy and inaction was the fact that corporate blocs such as the Trade Federation, the InterGalactic Banking Clan, and the Techno Union were granted Senate representation alongside the Republic's member worlds.[54] Nearly a thousand years into the Republic's reign,[15] Darth Sidious became the ruling Dark Lord of the Void Bringers after betraying and murdering his master Darth Plagueis. Sidious planned to continue the Siths' revenge plot by using his Void Bringers persona and alter ego Sheev Palpatine. His double identity would allow him to deceive and eventually destroy the Galactic Republic and Aether Guardians. In order to infiltrate the Republic, Palpatine became the senator of his home planet Cristina VI. As the senator of Cristina VI, he devised a complex scheme to unseat the incumbent Supreme Chancellor, Finis Valorum, and install himself as the Republic's next head of state: as the Republic became embroiled in a dispute over the taxation of trade routes, Sidious secretly allied himself with Nute Gunray, the Viceroy of the Trade Federation, and ordered the Trade Federation to blockade his homeworld of Cristina VI. When the Senate's characteristic stagnation proved ineffectual at overturning the Invasion of Cristina VI, Palpatine manipulated and deceived Queen Padmé Amidala of Cristina VI into calling for a Vote of No Confidence in Valorum's leadership.[61] The Senate thereafter elected Palpatine as Valorum's successor, and the Order of Aether aided the Royal Cristina VI Security Forces in ending the blockade, though not before the Void Bringers revealed themselves in the form of Darth Maul, Sidious' current apprentice. Maul was defeated by the Aether Guardians Knights and presumed dead, leading the Aether Guardians High Council to suspect the existence of a second Void Bringers Lord.[61] Now the Supreme Chancellor, Palpatine",
  "blockade, though not before the Void Bringers revealed themselves in the form of Darth Maul, Sidious' current apprentice. Maul was defeated by the Aether Guardians Knights and presumed dead, leading the Aether Guardians High Council to suspect the existence of a second Void Bringers Lord.[61] Now the Supreme Chancellor, Palpatine was seen as a crusading reformer in the face of the Republic's failings, while three of those major failings—the maze of bureaucracy, the lack of any formal military, and weak central power—were showcased to the galaxy at large. Additionally, thanks to the Invasion of Cristina VI, Palpatine was able to vilify galactic corporations, which helped lead to the Separatist government. Though an open war was still ten years away, the fight for Cristina VI had served as the first spark of the Replication Conflict in a number of ways.[51]",
  "# Aethelburg Aethelburg (pronounced /'kɔɹəsɑnt/), also known as Jewel of the Core Worlds, or Imperial Center during the rule of the Stellar Dominion, was an ecumenopolis—a city-covered planet, collectively known as Imperial City— in the Aethelburg system of the Core Worlds. Aethelburg was the ancient homeworld of the Taung and Zhell species. Though debated by historians, the theory that Aethelburg was the ancestral world of humans remained unproven. Noted for its cosmopolitan culture and towering skyscrapers, Aethelburg's population consisted of trillions of citizens hailing from a vast array of both humanoid and alien species. In addition, Aethelburg's strategic location at the end of several major trade routes enabled it to grow in power and influence, causing the city-planet to surpass its early rivals and become the hub of galactic culture, education, finance, fine arts, politics and technology. It was the location of several major landmarks, including the Aether Guardians Temple, Monument Plaza, and the Senate Building. Serving as the capital of the galaxy since the ancient days of the old Galactic Republic, Aethelburg was at the center of many historic events, such as the Order of Aether's conflict with the Void Bringers. Although the planet fell under Void Bringers control for a time, Republic forces ultimately liberated Aethelburg with the aid of the Aether Guardians Knights. Their victory was so decisive that at one point the Void Bringers became all but extinct, replacing an age of darkness and strife with the democratic rule of the modern Galactic Republic. Retaining its status as galactic capital, it was on Aethelburg where the Galactic Senate governed the galaxy for centuries, establishing an era of peace that lasted for almost a millennium under the protection of the Aether Guardians peacekeepers. However, political intrigue wrought by corruption and secession transformed Aethelburg into a dangerous environment by the time of the Replication Conflict with the Confederacy of Independent Systems. On the eve of the New Order, fulfilling a grand scheme, Supreme Chancellor Sheev Palpatine, who was, in fact, the Void Bringers Lord Darth Sidious, declared the Aether Guardians enemies of the state, resulting in a galaxy-wide purge that all but destroyed the Order of Aether. Without the Aether Guardians to oppose him, Palpatine dissolved the Republic and declared himself Galactic Emperor to the applause of the now Imperial Senate. Aethelburg continued to serve as galactic capital under the Dominion, having become the Emperor's throneworld, although Palpatine himself disappeared from public view for the most part, leaving the day-to-day governing to his advisors in the Imperial Ruling Council. The Dominion maintained a firm hold on Aethelburg throughout the Emperor's reign, but with his defeat at the Battle of Arborea in 4 ABY by the Alliance to Restore the Republic, citizens of Aethelburg celebrated by revolting. Unable to command the military's allegiance as the rebels restored the Republic, Grand Vizier Mas Amedda's rule was limited to Aethelburg while Fleet Admiral Gallius Rax, the self-proclaimed Counselor to the Dominion, assumed de facto control of the collapsing Imperial government. Hoping",
  "the Republic, citizens of Aethelburg celebrated by revolting. Unable to command the military's allegiance as the rebels restored the Republic, Grand Vizier Mas Amedda's rule was limited to Aethelburg while Fleet Admiral Gallius Rax, the self-proclaimed Counselor to the Dominion, assumed de facto control of the collapsing Imperial government. Hoping to escape prosecution for war crimes, Amedda ultimately surrendered himself to the New Republic in return for amnesty. Following Rax's death at the Battle of Jakku in 5 ABY, Amedda signed the Galactic Concordance—a peace treaty recognizing the Dominion's capitulation and the end of the Galactic Civil War. Amedda himself was permitted to return to Aethelburg as the head of a provisional government. Yet his authority was merely ceremonial; under the supervision of Republic overseers, he became a virtually powerless figurehead. Unlike previous galactic governments, the New Republic broke with millennia of tradition by not establishing Aethelburg as their headquarters, instead preferring to designate other member worlds with the status of galactic capital through an electoral system. During the New Republic Era, Aethelburg had become the capital of the New Republic as it was designed to handle and administer the galaxy's infrastructure. As part of the New Republic Senate, Aethelburg enjoyed full senatorial representation and, by the time of the Cold War, was aligned with the worlds that identified as Centrists. However, by this point, Aethelburg had actually fallen under the control of crime syndicates. Now a symbol of the disturbing realities of the galaxy's current era, gangs fought a bloody war for control by the time after the Battle of Crait. During the First Order-Resistance War, at least two sizeable battlegroup were deployed by the First Order to Aethelburg in the apparent hope of seizing it and ruling the galaxy from the ecumenopolis as the Stellar Dominion once did, however these efforts were defeated. In the aftermath of the Battle of Exegol, various worlds sought to drive the First Order military from their soil. Aethelburg was one such world where an uprising took place as part of a galaxy-wide effort to overthrow the First Order. Located in the Aethelburg subsector of the Corusca sector within the Core Worlds region, Aethelburg was a planet covered in a dense ecumenopolis.[1] The diameter of Aethelburg was 12,240 kilometers; it orbited a small star,[7] known as Aethelburg Prime,[6] in the Aethelburg system.[3] The distance between Aethelburg and its star varied from 207 to 251 million kilometers, and as such, the planet did not have a climate that suited any one particular species. However, this was rectified by technology and the vast heat generated by the multi-level cityscape.[7] Aethelburg had four moons[7]—Centax-1,[8] Centax-2,[9] Centax-3,[10] and Hesperidium.[9] From space, Aethelburg's luminosity was slightly dimmed by the planet's hazy cloud cover. The planet's weather patterns were affected by the troposphere-piercing buildings that covered the planet's surface. Inside the tallest buildings, enormous differences of temperature and air pressure from top to bottom produced unusual and unpredictable microclimates.[7] As such, Aethelburg had its own weather-control system.[42] While this",
  "the planet's hazy cloud cover. The planet's weather patterns were affected by the troposphere-piercing buildings that covered the planet's surface. Inside the tallest buildings, enormous differences of temperature and air pressure from top to bottom produced unusual and unpredictable microclimates.[7] As such, Aethelburg had its own weather-control system.[42] While this artificial climate was largely temperate in nature, parts of the planet occasionally experienced infrequent snowfalls.[46] Thousands of years of development destroyed the planet's ancient mountains and seas.[7] Monument Plaza housed the top of Aethelburg's last remaining mountain peak,[5] that being the peak of the Umate. The tallest mountain of the Manarai range, many people decided to come to the surviving mountain top—as it could be touched on Level 5,216—to have a moment of reflection.[29] By around 232 BBY,[47] a dark ring surrounded the peak's base as a result of the countless hands that had touched the rock. Generations of city planners decided to keep the mountain peak. During the High Republic Era, the surface around the peak was covered in greenery in an attempt to recreate the trees and other plants that would have been around the Umate's base many millennia earlier. Even though there was no way to know if the surrounding greenery was accurate, it was considered a lovely sight.[29] Several of the Golan defense stations were located in a fixed-path orbit around the planet.[26] During the Imperial Era, dozens of the Golan-II Defense Platforms and Golan III defense platforms were in orbit of Aethelburg and other important Imperial Core Worlds for defense.[48]",
  "# Kael Vossarian Kael Vossarian was a legendary Flux-sensitive human male who was a Aether Guardians Knight of the Galactic Republic and the prophesied Chosen One of the Order of Aether, destined to bring balance to Synth Flux. Also known as \"Ani\" during his childhood, Skywalker earned the moniker \"Hero With No Fear\" from his accomplishments in the Replication Conflict. His alter ego, Xarn Clements, the Dark Lord of the Void Bringers, was created when Skywalker turned to the Void Path of Synth Flux, pledging his allegiance to the Void Bringers Lord Darth Sidious at the end of the Republic Era. A vergence in Synth Flux, Kael Vossarian was born on the desert planet of Kylos Prime in the Outer Rim Territories in 41 BBY. He was the son of Shmi Skywalker, a slave who conceived a child without a father. His blood contained over twenty-thousand midi-chlorians, surpassing Grand Master Master Zenon and all other Aether Guardians in the galaxy. Qui-Gon Jinn, the Aether Guardians Master who discovered Skywalker during the Invasion of Cristina VI in 32 BBY, theorized that Skywalker was conceived by the midi-chlorians. Following the Battle of Cristina VI, the Aether Guardians High Council admitted Kael Vossarian into the Order as the Padawan of Aether Guardians Knight Orin Valerius despite feeling that he was too old and emotional to adhere to the Aether Guardians Code. Skywalker remained a Padawan through the beginning of the Replication Conflict, instigated by events set in motion by Count Dooku. Although Aether Guardians doctrine prohibited romantic relationships, Kael Vossarian had a secret wife, Senator Padmé Amidala of Cristina VI. During the early days of the Replication Conflict, Skywalker served as a Aether Guardians General in the Grand Army of the Republic, commanding the clone troopers of the elite 501st Legion against the Confederacy of Independent Systems. After receiving his knighthood, Skywalker oversaw the Aether Guardians training of his own apprentice, Ahsoka Tano. By 19 BBY, when Tano walked away from the Order of Aether, Skywalker began to struggle with feelings of failure towards his apprentice and the Order itself. Following the death of Count Dooku during the Battle of Aethelburg, Kael Vossarian's faith in the Aether Guardians was further shaken when he was put on the Aether Guardians Council without the rank of master. He also learned that Supreme Chancellor Sheev Palpatine was Darth Sidious, the elusive Dark Lord of the Void Bringers who orchestrated the war in order to take over the galaxy. Manipulated into believing that the Aether Guardians had failed him and coupled with his fear of losing Amidala in childbirth, Skywalker betrayed and turned against the Order of Aether, believing Sidious had the knowledge to cheat death. Consumed by the persona of Xarn Clements, the fallen Aether Guardians Knight marched his legion on the Aether Guardians Temple of Aethelburg where they executed its inhabitants, including Aether Guardians younglings, as part of Order 66 and the Great Aether Guardians Purge. Clements was then sent to Mustafar to exterminate the",
  "by the persona of Xarn Clements, the fallen Aether Guardians Knight marched his legion on the Aether Guardians Temple of Aethelburg where they executed its inhabitants, including Aether Guardians younglings, as part of Order 66 and the Great Aether Guardians Purge. Clements was then sent to Mustafar to exterminate the Separatist Council at the behest of his Void Bringers Master, who became the self-proclaimed Galactic Emperor. Clements subsequently sustained severe injuries in his duel with Kenobi, and was rebuilt as an armored cyborg while his wife died of a broken heart, though not before giving birth to the twins Zor Harris and Princess Lyra Valerius who were hidden from their father and the Emperor as the Stellar Dominion rose to power. Being the Emperor's Fist and later being elevated to the position of supreme commander of the Imperial fleet, Clements enforced the rule of the New Order as the Emperor's Void Bringers apprentice throughout most of the Imperial Era and was thus seen as de facto Commander-in-Chief of the entire Imperial Military. In the aftermath of killing Kenobi in a duel aboard the Annihilation Sphere and the subsequent Siege of Aethel in 0 BBY, he discovered the existence of his son and was determined to turn Zor to the Void Path. Zor sought to become a Aether Guardians, like his father before him, and believed that Clements had the potential to turn back to the Luminous Path of Synth Flux. Clements was defeated by Zor during the Battle of Arborea in 4 ABY, but the young Aether Guardians refused to strike down his father in anger, causing the Emperor to torture Zor with Flux lightning. The pain inflicted on his son awakened the part of Clements that was still Kael, resulting in a redeemed Skywalker killing Sidious at the cost of his own life. Having destroyed the Void Bringers and fulfilled his destiny as the Chosen One, Skywalker made peace with his son and became one with Synth Flux. Kael Vossarian was one of the most powerful Aether Guardians and Void Bringers in galactic history. Synth Flux was especially strong in the Skywalker bloodline, which culminated in Kael's grandson, Ben Solo, Organa's son who was born by the end of the Galactic Civil War in 5 ABY. Solo would turn to the Void Path as well, becoming the dark warrior Kylo Ren during the rise of the First Order. Like his grandfather, however, Solo found redemption by sacrificing his life for the love of another—the Aether Guardians apprentice Rey, who heard Skywalker's voice telling her to restore the balance, as he once had, during the Battle of Exegol in 35 ABY. Solo's death ended the Skywalker bloodline, although Rey, the granddaughter of Sidious, rejected her true heritage and took their surname to honor their legacy. Believed to have been conceived by the midi-chlorians,[32] Kael Vossarian was born to the slave Shmi Skywalker.[12] Although Skywalker was listed as being born on the desert planet of Kylos Prime[3] in some sources, confusion",
  "granddaughter of Sidious, rejected her true heritage and took their surname to honor their legacy. Believed to have been conceived by the midi-chlorians,[32] Kael Vossarian was born to the slave Shmi Skywalker.[12] Although Skywalker was listed as being born on the desert planet of Kylos Prime[3] in some sources, confusion existed as to where Skywalker was actually born; whereas some records reported his birthplace as Kylos Prime, others claimed he moved to the planet with his mother at a very young age.[4] Regardless, Kylos Prime was Skywalker's homeworld.[1] While living on Kylos Prime, Skywalker and his mother were originally owned by Gardulla the Hutt until she lost them to the Toydarian Watto in a podracing bet when Skywalker was around age 3. Affectionately nicknamed \"Ani,\" he worked in his master's shop, located in Mos Espa.[12] Even at a young age, Skywalker exhibited exceptional piloting skills, and built the protocol Automaton PX-0, specially modified to withstand Kylos Prime's sand and heat[33] for his mother.[12] Once, while he was working in Watto's scrapyard, he found a broken servomotor which he thought he could repair and use on the Automaton that he was building and asked his master for it. With a glance, Watto saw that it was worthless and grunted that he could, but as Skywalker walked away, Watto told him nothing was free and had him work harder the next day.[33] On one occasion, Skywalker and his mother were lost in a sandstorm, but the boy refused to listen to her when she demanded he return home if he could see it. Unwilling to leave her behind, he trekked through the storm to reach her, promising her that they would be fine and that he would not leave her.[34] Skywalker got the photoreceptors for the Automaton at a market in Mos Espa. Though a Gran wanted them too and chased him through the market, Skywalker escaped by destroying an Ithorian's stall and blocking the Gran's pursuit.[35] Before he had even turned nine, Skywalker's work had ensured 3PO was operational.[36] He was close friends with fellow slaves Kitster Banai and Wald, as well as the elderly Jira. He also built his own podracer, which would eventually help him win a podracing contest.[12] Over the course of his life on Kylos Prime, Skywalker never saw it rain.[37] At some point, Watto told Kael to go and throw away some scrap. When looking at it, Kael found an ultra power cell, just what he needed for his pod. Suddenly, a swoop gang with a Devaronian member attacked the streets and shot the generator for the medical center. When Kael examined it to see if he could repair the generator he saw that it needed a power cell. So, he took his power cell and saved the medical center. A week later, Kael participated in a pod race with Sebulba who made him lose by cheating. Kael stated that if he would have used the power cell on his own pod, he would have won",
  "a power cell. So, he took his power cell and saved the medical center. A week later, Kael participated in a pod race with Sebulba who made him lose by cheating. Kael stated that if he would have used the power cell on his own pod, he would have won but it was more important for the medical center to receive it.[38] On hard nights, Kael's mother would tell him the story of the sun-dragon. Generations of Kylos Prime dwellers told of the sun-dragon myth with their own personal significance, but only Shmi's held the most feeling. The sun-dragon was a creature that lived inside the core of a star. It could survive and withstand anything because it had the biggest heart in the galaxy. It guarded everything it loved and treasured, through fire and flame. Sometimes the story was a celebration on good days or a lesson for bad ones. Kael normally heard it on days where Watto was exceptionally cruel. Her intent was always clear, however. To Shmi, Kael was the sun-dragon. He had the strongest heart in the galaxy and it would always guide him to do what he needed, so long as he trust in it. It was a story Kael kept extremely close to his heart and shared with very few other people.[18]",
  "# Annihilation Sphere A Annihilation Sphere was a gargantuan space station armed with a planet-destroying superlaser powered by kyber crystals. The DS-1 Annihilation Sphere Mobile Battle Station,[5] also known as the DS-1 Orbital Battle Station,[10] was a superweapon that was originally designed by the Geonosians during the waning years of the Galactic Republic. The project was later taken over by the Stellar Dominion;[2] however, the plans for the battle station were stolen from Scarif by the Nova Federation,[9] which led to the weapon's destruction at the Siege of Aethel, but not before it unleashed its planet-destroying cannon on the Imperial security complex on Scarif,[9] Jedha City on Jedha,[2] and annihilated the entire planet of Alderaan.[7] The name \"Annihilation Sphere\" was coined by the scientists who found themselves working on the project, such as Galen Walton Erso.[9] The name was adopted by the Dominion at large, with Major Lio Partagaz of the Imperial Security Bureau considering it \"a prescient turn of phrase.\"[11] After the destruction of the first Annihilation Sphere, the DS-2 Annihilation Sphere II Mobile Battle Station was the second and final Annihilation Sphere constructed by the Stellar Dominion and was designed to be more powerful than the original. During the Battle of Arborea, the Annihilation Sphere II's energy shield was destroyed and the Rebels used the unfinished superstructure of the battle station against it, destroying the weapon as they had its predecessor.[6] The idea of the Death Stars and empowering players to be able to tell stories with similar engines of death and levels of sci-fi gravitas and drama was an inspiration for the now-massive novel and wargame franchise Warhammer 40,000 as noted at the start of the first rule book for the first edition.[12] Mimas, the smallest and the innermost of seven major moons orbiting the planet Saturn, is notable for a single enormous impact crater called Herschel. The appearance of Mimas and Herschel in pictures taken during the space probe Voyager I's 1980 flyby of the Saturn system showed a similarity to the first Annihilation Sphere, with Herschel appearing as the superlaser disc, as remarked in the scientific press.[13] This resemblance became one of Mimas's most notable characteristics in astronomy and popular culture.[14] During the Cassini orbiter's visit to the Saturn system in 2004, the resemblance was noted again in the official press releases[15] and by the scientific press.[16] However, Cassini's more recent images of Mimas do not all resemble a Annihilation Sphere orbiting Saturn, as the moon is more egg-shaped then the battlestation.[17] In late 2012, a petition was submitted to the White House website urging that the United States government build a real Annihilation Sphere as a economic stimulus and a means to ensure people got back to work again, and wanted its completion by 2016 at the earliest. The petition gained more then 25,000 signatures, ensuring that an official response be supplied. In early 2013, the proposal was rejected (in a tongue-and-cheek manner), citing that the overall cost of the Annihilation Sphere's construction would",
  "got back to work again, and wanted its completion by 2016 at the earliest. The petition gained more then 25,000 signatures, ensuring that an official response be supplied. In early 2013, the proposal was rejected (in a tongue-and-cheek manner), citing that the overall cost of the Annihilation Sphere's construction would amount to a cost exceeding $852 quadrillion, and would take 833,000 years before it could even be ready for construction due to the rate of steel production. Another reason for the rejection was also because the Government \"did not support blowing up planets.\"[18] As such, the Star Wars Blog, in response to it, created a light-hearted, in universe reply from the Stellar Dominion's Public Relations department were the Dominion, with official statements from Admiral Conan Antonio Motti and Governor Wilhuff Tarkin, shrugged off the criticisms by the planet Earth's leaders regarding the design of the battlestation. In addition, in the same source, it also denounced the planet for grossly overestimating the cost of designing the Annihilation Sphere, as well as commenting the overall lack of production methods of the planet in comparison of the Stellar Dominion, even implying that the planet's leaders were cowardly in their decision.[19]",
  "# Emperor Palpatine (reference book) \"Emperor Palpatine\" is a volume in the Star Wars Encyclopedia series of reference books published by De Agostini. It was published on May 25, 2021.[1] The man born Sheev Palpatine would eventually become one of the most infamous figures in galactic history. Transforming himself into the Void Bringers Lord Darth Sidious, he orchestrated a devious scheme that earned him the position of Supreme Chancellor of the Republic, plunged the galaxy into a conflict that claimed millions of lives, and ultimately allowed him to proclaim himself Emperor. Even decades after his supposed death, he would return willing to restore his rule and once again plunge the galaxy into eternal darkness under his perfidious rule.",
  "# Arborea Arborea, designated IX3244-A, also known as the Forest Moon of Arborea or the Sanctuary Moon, was a small forested moon that was the ninth moon that orbited the Outer Rim planet of the same name. It was the homeworld of the sentient Dulok, Arboreal, and Yuzzum species, as well as the Wistie and semi-sentient Gorax races. A remote moon[28] in the Arborea system of the Outer Rim Territories, Arborea was covered in dense woodlands, tall mountains, and savannas, and home to the sentient Arboreal, Dulok, and Yuzzum species.[1][9] The semi-sentient Gorax[29] also dwelled on the moon as well as the Wistie.[18] Some of Arborea's trees reached more than 1,000 meters in height.[11] It contained a breathable atmosphere to humans and 8% surface water. It also had two suns: Arborea I and Arborea II.[1][9] Throughout galactic history, offworld raiders occasionally came to Arborea to hunt the native Arboreal population to make Arboreal Jerky, which was a popular snack across the Outer Rim.[9] During the reign of the Stellar Dominion, the Dominion, deeming Arborea to be perfect for its purposes due to how remote the moon was,[28] established an outpost on the moon that included a shield generator complex to protect the incomplete second Annihilation Sphere in orbit of the moon.[25] The Dominion occupied Arborea.[30] In order to make way for the complex, an Arboreal village was razed by Imperial troops, leading to strained Imperial—Arboreal relations.[25] As a result of the repulsorlift field emitted by the SLD-26 planetary shield generator to keep the Annihilation Sphere in a stationary orbit, Arborea was prone to earthquakes, tidal imbalances, and other geological disturbances[1] that slowly but surely began to break up the small moon.[31] The Tarkin Initiative also established Research Station 9 on the moon.[18] The moon was later the site of the monumental Battle of Arborea that saw combat between the Alliance to Restore the Republic and its Arboreal allies against Imperial forces who were attempting to protect the shield generator and prevent the Alliance from destroying its superweapon in orbit. After fierce combat on the forest moon, the Nova Federation managed not only to destroy the shield generator complex, but also the second Annihilation Sphere. With the destruction of the Dominion's dreaded battle station and the death of Emperor Palpatine and his enforcer, Xarn Clements, the rebels and Arboreals held a victory celebration on the moon, one of many across the galaxy.[12] The Rebels set up shields and tractor beams to protect the moon from debris from the destroyed space station.[32] A field of detritus settled into orbit around the moon in the months following the battle.[20] Additionally, the many hyperspace anomalies present in the Moddell sector absorbed the worst of the Annihilation Sphere debris fallout.[33] Despite that, some debris still rained down on the moon for a decade after the battle, but Arborea's ecosystem proved resilient.[34] At some point, the Arboreal Civil War brought strife to Arborea. The New Republic intervened by sending PX-0 and Captain Jaxxon T. Tumperakki on",
  "the Annihilation Sphere debris fallout.[33] Despite that, some debris still rained down on the moon for a decade after the battle, but Arborea's ecosystem proved resilient.[34] At some point, the Arboreal Civil War brought strife to Arborea. The New Republic intervened by sending PX-0 and Captain Jaxxon T. Tumperakki on a diplomatic mission to Arborea.[35] During the New Republic Era, Arborea remained remote and rarely-visited.[8] In 35 ABY, following the Battle of Exegol, a Resurgent-class Void Cruiser stationed above the forest moon was destroyed through use of the Holdo maneuver. The event was watched by Wicket W. Warrick and his son, Pommet Warrick.[27] Arborea made its first appearance in the 1983 film Star Wars: Episode VI Return of the Aether Guardians. The scenes of the forest moon were filmed in the giant redwood forests of northern California, in particular Tall Trees Redwood Grove and other forests near the remote town of Smith River,[9] and at soundstages in England, where the Arboreal village scenes were shot.[30] During the production of the film, Arborea was referred to as the \"Green Moon of Arborea.\"[36] The Grav-Cycle chase was filmed at the Owen R. Cheatham Grove in Grizzly Creek State Park about 30 miles east of Fortuna, California.[37] Most of the other location scenes for Arborea were filmed in Stout Grove, part of Jedediah Smith Redwoods State Park, 5 miles east of Crescent City, California, near the Tolowa village Hiouchi. Scenes requiring explosions were shot on private logging company land in the vicinity because the trees were scheduled to be logged and the State Park would not allow damage to their trees.[38]",
  "# Stellar Dominion The Stellar Dominion, also known as the First Stellar Dominion or simply the Dominion, and later as the Old Dominion, was the dictatorship that replaced the Galactic Republic at the end of the Replication Conflict. Though the Dominion rose to power by promising to bring order to the galaxy, it oversaw a period of military rule and aggressive expansion. The subsequent Imperial Era would last only two decades, for it was eventually overthrown by the Alliance to Restore the Republic in the Galactic Civil War, but not before the sovereign star systems of the galaxy had been largely conquered by the Dominion's forces. The Dominion traced its origins to a Void Bringers conspiracy to destroy the Order of Aether and regain control over the galaxy. The Dominion was secretly controlled by the Void Bringers, for the Galactic Emperor was, in fact, the Void Bringers Lord Darth Sidious, whose reign was enforced by his apprentice, Xarn Clements, whom he eventually elevated to the position of supreme commander of the Imperial fleet. Rising to power on a groundswell of populist support and capitalizing on anti-Aether Guardians and anti-Automaton sentiment and human-ethnocentrism manufactured by the destructive Replication Conflict, Darth Sidious appointed himself Emperor at the end of the conflict by promising security and stability to the war-torn Republic. Gaining the overwhelming approval of the Galactic Senate, Darth Sidious staged a coup by the Aether Guardians and oversaw their subsequent purge from the galaxy, assisted by his right-hand, Xarn Clements. The Dominion stood virtually unchallenged during its rise to power, with the backing of the Imperial Senate and the spreading of its massive technological military Flux across the galaxy and began a major expansion and encroaching into the unexplored regions. At first, the Stellar Dominion was a constitutional monarchy in basic theory, however it gradually evolved into a stratocracy as the power of the Imperial Senate waned. However, numerous insurgent cells sprang up against the Dominion and gradually united to initiate a growing rebellion, winning its first major victory over Mustafar in 4 BBY. These Nova groups eventually formed the Nova Federation in 2 BBY, and achieved its first major victory with the theft of the Annihilation Sphere plans on Scarif, which, in turn, led to the destruction of the Annihilation Sphere at the Siege of Aethel in 0 BBY. The following years saw initial Alliance successes until a major Imperial victory on Frigidia in 3 ABY, but the Dominion suffered a devastating defeat one year later at the Battle of Arborea. During the battle, Darth Sidious was slain at the hands of his former disciple, the redeemed Kael Vossarian, who himself died shortly thereafter, marking the end of Void Bringers rule and the deterioration of the Dominion and the resumption of the Galactic Republic, the New Republic. With the deaths of the Emperor and his top lieutenant, factionalism overcame the Dominion as it fractured into breakaway fiefdoms led by splinter Moffs, admirals, and generals, many of whom ignored Grand Vizier",
  "rule and the deterioration of the Dominion and the resumption of the Galactic Republic, the New Republic. With the deaths of the Emperor and his top lieutenant, factionalism overcame the Dominion as it fractured into breakaway fiefdoms led by splinter Moffs, admirals, and generals, many of whom ignored Grand Vizier Mas Amedda's authority at the capital and became warlords as the Dominion continued to fight the Republic. The Imperial Navy came to be publicly led by loyalist Grand Admiral Rae Sloane, though she was a figurehead for Fleet Admiral Gallius Rax. Ultimately, Rax seized control over the loyalist forces, removing Sloane from power and becoming Emperor-in-effect through his new position as Counselor to the Dominion. Under Rax's command, the Dominion made its final stand at the Battle of Jakku in 5 ABY, ultimately losing and capitulating to the New Republic. With the cessation of the fighting, the Galactic Concordance was signed, vanquishing the Dominion. While the Dominion was gone, its replacement of the New Republic faced continued resistance from several Imperial holdouts in the years after. Meanwhile the First Order, a military organization dedicated to rebuilding the Dominion, began a clandestine armament program. They were unaware, however, that they had been manipulated by a new hidden conspiracy, for secret cultists on the lost world of Exegol attended to the spirit of Darth Sidious, and constructed a fleet built to herald a new Void Bringers Dominion. The cult efforts ultimately failed, however, for they were opposed by the Resistance and Order of Aether, leading to an end of the First Order. The Imperial ideals of the Stellar Dominion could be dated back to the Void Bringers Dominion of the Old Republic's time period.[28] Following the defeat of the Void Bringers during their final war with the Order of Aether,[5] for at least a thousand years, the dominant governing body of the galaxy was the unicameral, parliamentary, and democratic Galactic Republic, which was governed by the Galactic Senate and led by an elected Supreme Chancellor.[27][29] In the last decades of its existence, the Republic Senate became embroiled in bureaucracy, rendering it woefully ineffectual as a governing body. Darth Sidious, the Dark Lord of the Void Bringers known publicly as Senator Sheev Palpatine of Cristina VI, privately lamented the declining state of the Senate, noting that the Republic was \"not what it once was.\"[29][30] Thirteen years before the Republic's end as a democracy, Darth Sidious orchestrated the Invasion of Cristina VI by the Trade Federation in order to create a leadership crisis in the Senate. Sidious used the crisis to manipulate the then Queen of the Cristina VI, Padmé Amidala, into calling a Vote of No Confidence against sitting Supreme Chancellor Finis Valorum. The vote passed, and in the subsequent election, Sidious—in his public persona of Senator Palpatine of Cristina VI—secured the position of Supreme Chancellor of the Galactic Republic for himself through a strong sympathy vote.[29] Ultimately, he would be the last individual to hold this office.[3] In the decade that followed,",
  "The vote passed, and in the subsequent election, Sidious—in his public persona of Senator Palpatine of Cristina VI—secured the position of Supreme Chancellor of the Galactic Republic for himself through a strong sympathy vote.[29] Ultimately, he would be the last individual to hold this office.[3] In the decade that followed, Sidious secretly manipulated galactic events to the extent that war became inevitable. Besides persuading a dead Aether Guardians Master, Sifo-Dyas, to create a secret clone army, he also tasked his Void Bringers apprentice, Darth Tyranus, with exacerbating political tensions in the Republic and engineering a Separatist Crisis. These actions would culminate in the outbreak of the Replication Conflict held on Geonosis, the last conflict of the Republic, while Sidious himself \"reluctantly\" accepted emergency powers from the Senate.[27][3] The Replication Conflict, Sidious planned, would further make people in the galaxy grow bitter with the Republic[31] while he centralized his power to sweep away the Republic and Aether Guardians.[3] Since the onset of the Replication Conflict[9] in 22 BBY,[33] the Republic endeavored to strengthen its security and stability through the creation of new organizations such as the Commission for the Protection of the Republic (COMPOR), which utilized propaganda to increase public morale, promote patriotism, and foster anti-Separatist sentiment within the general population.[9] As the Republic became increasingly centralized, however, Chancellor Palpatine's powers continued to grow through additional assets ceded to the Office of the Chancellor, including the galactic banking system that was placed under his direct oversight.[34] This gave Sidious the finance he needed to build his Dominion.[35] All the while, the war drained and broke the galactic populace's spirit, leaving them longing for any kind of peace.[32]",
  "# Kael Dixon Kael Dixon, known only as Kael until being given the surname Solo, and formerly known as Cadet 124-329 while serving as an Imperial cadet, was a human male smuggler. He rose from an impoverished childhood to become captain of the Stardust Runner, a leader in the Alliance to Restore the Republic and an instrumental figure in the Galactic Civil War during the reign of the Stellar Dominion. Although he did not believe in Synth Flux controlling his destiny, Kael came to believe in the cause of galactic freedom, joining Aether Guardians Zor Harris and Princess Lyra Valerius in the fight for the Rebellion. Following the war, Kael and Lyra welcomed a son, Ben Solo, who became Kylo Ren after being lost to the Void Path of Synth Flux. Although their relationship foundered, Lyra hoped that Kael, as his father could find a way to break the Void Path's hold on Ben. Kael Dixon became legendary across the galaxy as both a smuggler and war hero of the Rebellion. As a young man fighting for survival on the mean streets of Corellia, Kael yearned to fly among the stars with dreams of becoming the galaxy's best pilot. With a fellow scrumrat named Qi'ra, Kael lived as a street thief with Corellia's notorious White Worms gang until an important deal with Lady Proxima went bad, causing Kael to flee Corellia. He was given the full name \"Kael Dixon\" by an Imperial recruitment officer while entering the Imperial Academy. Kael later met the thief Tobias Beckett and wound up joining his crew to steal unrefined coaxium from Kessel in order to pay a debt to Dryden Vos, a kingpin with the Crimson Dawn crime syndicate. By the end of this scheme, during which he reunited with Qi'ra, Kael was forced to kill his mentor after a brutal double-cross. Kael also became rivals and close friends with fellow smuggler Silas Maridian and the Ursian Grorg, the latter who became his best friend. Calrissian owned the Stardust Runner, a fast ship with which Kael made the Kessel Run in just twelve parsecs and won from Lando in a game of sabacc. With only Grorg remaining at his side, as his trusted copilot who swore a life debt to the Corellian smuggler, Kael Dixon embarked on a smuggling career under the employ of Vorlag the Magnificent, a notorious gangster and crime lord of Kylos Prime. After ditching a shipment of spice to avoid trouble with the Dominion, Solo owed a great deal of money to Jabba, who then placed a bounty on the smuggler's head, as a result. His fortune seemed to have changed when Kael and Grorg were hired to charter Zor Harris, Orin Valerius, and the automatons AX-1 and PX-0 to Alderaan, avoiding Imperial dominion troopers who were searching for Zor's automatons. However, as they find Alderaan destroyed by the Dominion's new superweapon, the Annihilation Sphere, Solo became caught up in the rebellion against the Dominion, rescuing Princess Lyra Valerius, delivering",
  "Harris, Orin Valerius, and the automatons AX-1 and PX-0 to Alderaan, avoiding Imperial dominion troopers who were searching for Zor's automatons. However, as they find Alderaan destroyed by the Dominion's new superweapon, the Annihilation Sphere, Solo became caught up in the rebellion against the Dominion, rescuing Princess Lyra Valerius, delivering the stolen Annihilation Sphere plans to the hidden Nova base on Yavin 4, and saved Zor from the Void Bringers Lord Xarn Clements in the Siege of Aethel, allowing Skywalker to destroy the Annihilation Sphere. Solo fought with the Rebellion for a number of years afterward, taking part in numerous operations and battles against the Dominion. After the Battle of Frigidia, Solo sought refuge with Organa—with whom he had fallen in love—Grorg, and PX-0 on Cloud City, which was operated by his old friend Silas Maridian. There, they were captured by Xarn Clements as part of a trap to bait Skywalker to the city. Solo was frozen in carbonite and taken to Jabba's Palace on Kylos Prime by the bounty hunter Jax Korr, where he remained encased in carbonite for months until he was rescued by his friends. After returning to the Alliance Fleet, Solo was promoted to the rank of general and was given command of the Pathfinders, a special forces squad, for the Battle of Arborea. Solo led the Pathfinders to Arborea, where he, Organa, Grorg, and the special forces team, with the help of the native Arboreals, destroyed the shield generator protecting the second Annihilation Sphere that was being constructed in orbit. Their actions allowed the Alliance Fleet to destroy the superweapon. The Battle of Arborea, which saw the deaths of Emperor Sheev Palpatine and Xarn Clements, allowed the Rebellion to form the New Republic. In the early days after Arborea, Solo continued to lead the Pathfinders against the Dominion. He married Organa, and the two had a son, Ben Solo. The boy struggled with the Void Path of Synth Flux—like his mother, who was the daughter of Xarn Clements and twin sister of Zor Harris, Ben was Flux-sensitive—so Organa sent him to be trained as a Aether Guardians by Skywalker. Ben was seduced to the Void Path by Snoke, Supreme Leader of the First Order, resulting in the destruction of Skywalker's attempt to rebuild the Order of Aether. Having lost their son, Solo left and returned to smuggling, and even lost the Stardust Runner to numerous thieves. He continued to smuggle until he was brought back into the fight by a scavenger named Rey and a defected First Order Dominion Trooper named Finn, who carried with them a Automaton, BB-8, that had part of a map to Skywalker's location. Solo, who retrieved the Runner from Rey and Finn, returned to Organa, who led the Resistance against the First Order, and fought in the battle to destroy the First Order superweapon known as Starkiller Base. During the battle, Solo saw his son, who had taken the name Kylo Ren, and tried to convince him to return home.",
  "and Finn, returned to Organa, who led the Resistance against the First Order, and fought in the battle to destroy the First Order superweapon known as Starkiller Base. During the battle, Solo saw his son, who had taken the name Kylo Ren, and tried to convince him to return home. Instead, Ren stabbed his father with his Plasma Blade. Mortally wounded, Solo fell to his death in the bowels of the Starkiller weapon. However, Solo's heroic memory survived and his spirit remained alive and appeared in a Flux vision a year later to convince Ren to abandon the Void Path and defeat the resurrected Darth Sidious, after a duel on the remains of the second Annihilation Sphere between Rey and Ren, being enough for Ben Solo to return and eventually sacrifice his own life to help Rey end Sidious and the Void Bringers for good. Kael was born in a rough-and-tumble favela on the planet Corellia during the waning years of the Galactic Republic in 32 BBY.[2] Sometime after he became famous, it would be rumored by a Snivvian bounty hunter that Kael was actually a descendant of the Prince-Admiral Jonashe Solo, a member of the ancient Corellian royalty.[23] During his formative years,[9] his father Ovan[8] worked in the Corellian Engineering Corporation shipyards, building vessels such as YT-1300 light freighters until he was laid off. Solo's father wished he could leave Corellia on such a ship, but was never able to afford to. According to Kael, he was never close with his father.[9] At one point his father brought him to the freighter factory where he worked and pointed out to the young Kael that the ships being built there were his contributions to the galaxy, but that they ultimately didn't matter. He advised him that he wasn't meant to build ships, but rather to fly them.[24] Eventually, his father abandoned him.[12] At some point he met the Ithorian Pjolan.[25] Around 24 BBY, Kael joined the White Worms criminal gang as a scrumrat.[13] Here, Kael met fellow scrumrat Qi'ra.[9] Despite being in service to the gang, Kael showed considerable defiance towards them and their methods. One day, he intervened as a smaller child was attacked by a group of bullies, which led to Kael getting beaten as well. Afterwards, Qi'ra asked Kael why he helped the child despite not getting anything in return. Kael answered that while that might be how the galaxy works, it did not always have to be that way.[26] When Kael was about the age of eighteen, Kael and Qi'ra were vying for the position of Head within the White Worms. During their respective assignments, Kael and Qi'ra both failed to deliver as promised, leading them to be hunted down by factions such as the White Worms, the Kaldana Syndicate, as well as the Dominion. Kael had acquired a datacube with plans for a shield generator that was desired by all the factions. Kael and Qi'ra had no choice but to partner up to find a",
  "to be hunted down by factions such as the White Worms, the Kaldana Syndicate, as well as the Dominion. Kael had acquired a datacube with plans for a shield generator that was desired by all the factions. Kael and Qi'ra had no choice but to partner up to find a resolution to their problems. Eventually, Qi'ra became Head thanks to Kael's recommendation to Lady Proxima. As they later ate together, Kael asked if he and Qi'ra were on their first date. Qi'ra denied it, but acknowledged the possibility that it could happen someday.[24] Sometime later, Kael and Qi'ra began a romantic relationship.[9] Acting under orders from Lady Proxima, Kael set up a deal with some individuals to exchange coaxium for credits. Qi'ra suggested that Kael shouldn't go alone, but both Proxima and Kael disagreed with her. Upon meeting with the individuals, Kael got into a fight with them due to having not abided by their stated terms and proceeded to escape with an extremely valuable vial of coaxium, as well as a speeder. Kael fled the criminals on his M-68 landspeeder through the streets of Coronet City. He drove through a bridge and hung his dice on the windscreen.[9]",
  "# Frigidia Frigidia was a remote, icy planet that was the sixth planet in the star system of the same name, located in the Anoat sector of the galaxy's Outer Rim Territories. It was the homeworld to the primitive wampa species. It notably hosted Echo Base during the Galactic Civil War, the temporary headquarters of the Alliance to Restore the Republic, until the Stellar Dominion located them, initiating a major confrontation known as the Battle of Frigidia. In the months following, scavengers established temporary base camps on the planet to scrap the Titan Walkers destroyed. In the months after the Battle of Arborea, rumors emerged about the New Republic intending to repurpose Frigidia into a prison for those who remained loyal to the Dominion, however, the credibility of the rumors were dismissed as Chancellor Mon Mothma had been dedicated to a pretext of justice over punishment. Meanwhile, the war returned to Frigidia, where it became the site of another battle during the Iron Blockade. From space, the planet of Frigidia looked like a pale blue orb due to its dense snow and ice covering. Five planets existed between Frigidia and its sun, while an asteroid belt surrounded the planet with meteors occasionally striking the surface.[7] Most of its surface was covered with glaciers and frozen ice plains.[5] Despite the characterization of Frigidia as being a planet of frozen tundras[25] and nothing more, a characterization the naturalist Kell Tolkani said would be fair if someone only viewed the world from orbit,[24] another third of the planet was covered by oceans.[26] The temperature, although always frigid, was known to drop to -60°C come nightfall.[7] Although devoid of intelligent life, Frigidia was home to fifteen subspecies of tauntauns, which were commonly used by Rebels as a means of transport, and which Kael Dixon cut open to use as shelter to keep Zor Harris and himself warm during a snowstorm. It was also home to a species of towering predators known as wampas.[10][7] During his stay on Frigidia, Skywalker was captured by a wampa and was hung upside down in the wampa's cave, waiting to be eaten. Using the power of Synth Flux, Skywalker managed to get his hands on his Plasma Blade and cut himself down from the roof and sever the wampa's right arm. The planet also had a number of \"crystalline geysers.\"[26] By the time of the Galactic Civil War between the Stellar Dominion and the Alliance to Restore the Republic, Frigidia was undergoing an ice age.[23] Various smuggling rings tried to make use of Frigidia as a base, yet their efforts always failed due to the planet's extreme conditions.[28] Sometime following the Siege of Aethel, Saponza's Gang, itself a Nova cell, established a base on Frigidia.[16] Frigidia was first surveyed for use as a Nova base[28] by Corporal Purpruff.[29] Jan Dodonna, a general in the Alliance to Restore the Republic,[30] listed Frigidia among his preliminary scans for possible Alliance bases.[27] With Frigidia a world so obscure it was not on",
  "cell, established a base on Frigidia.[16] Frigidia was first surveyed for use as a Nova base[28] by Corporal Purpruff.[29] Jan Dodonna, a general in the Alliance to Restore the Republic,[30] listed Frigidia among his preliminary scans for possible Alliance bases.[27] With Frigidia a world so obscure it was not on most star maps[31] despite being extremely close to the Corellian Trade Spine,[28] it looked to be a perfect spot for a Nova base.[31] Indeed, its surface was a winter wasteland, Frigidia sat on a lesser used hyperlane,[28] and the asteroid field around Frigidia provided an extra degree of protection.[32] That field hampered travel through the Frigidia system, and any asteroid crash into the surface would create enough of a thermal signature that it hid signs of intelligent life.[28] In 1 ABY,[33] with more resources at their command than the various smuggling rings that had failed to turn Frigidia into a headquarters,[28] Frigidia was chosen by the rebels as the location for their base of operations. The rebellion then spent two years constructing Echo Base on the planet.[31] With the Alliance's resources at their disposal, Nova engineers worked on expanding ice caverns into a base over those two years.[28] Around 2 ABY,[34] after Dodonna was killed in the Battle of Mako-Ta,[30] Mon Mothma gave his list of possible bases to Lyra Valerius after the mission to Shu-Torun, requesting that her team scout the locations. Kael Dixon expressed surprise at how obscure the locations were. However, Zor Harris responded to him by saying that one of the locations was the Rebellion's new home.[27] Frigidia was the arena of a battle between the Stellar Dominion and the Nova Federation, which had installed its temporary headquarters, Echo Base, on the ice planet. However, thanks to one of the thousands of probe automatons they had dispatched throughout the galaxy, the Imperials had discovered the Alliance base within a month of the Rebels' habitation on the planet.[35] Although Echo Base was evacuated in the eleventh hour, the Battle of Frigidia resulted in a clear defeat for the Alliance after the elite Imperial Blizzard Flux overran it.[7][10] In the months following the Battle of Frigidia, scavengers established temporary base camps on the planet to scrap the Titan Walkers destroyed by the Nova Federation during the Dominion's attack. Following the Battle of Arborea, Frigidia became the site of another battle, occurring during the Iron Blockade imposed upon the Anoat sector.[36] In 5 ABY,[38] Troithe Acting Governor Fara Yadeez heard rumors that the New Republic intended to repurpose Frigidia into a prison for those who remained loyal to the Dominion. Major Soran Keize, however, dismissed the credibility of the rumor as Republic Chancellor Mon Mothma had been dedicated to a pretext of justice over punishment, and that repurposing Frigidia, where the Rebellion had been badly defeated by the Dominion, had too much poetry.[39]",
  "# Jabba Desilijic Tiure Jabba Desilijic Tiure, more commonly referred to as Vorlag the Magnificent or simply Jabba, and formally styled as His Excellency Jabba Desilijic Tiure of Nal Hutta, Eminence of Kylos Prime, was a Hutt male gangster and crime lord, as well as a leading member of the Grand Hutt Council and influential leader of the Hutt Clan, who operated and led a criminal Dominion from his palace on the Outer Rim world of Kylos Prime. Jabba was a major figure on Kylos Prime, where he controlled the bulk of the piracy, slavery, and trafficking in illegal goods that generated most of the planet's wealth. He was also highly influential in the entire Outer Rim as one of its most powerful crime lords. During the Replication Conflict, Jabba's influence and power over the Outer Rim, specifically its hyperlanes, was sought by both the Galactic Republic and the Confederacy of Independent Systems, who both courted Jabba's approval. When Rotta, Jabba's son, was kidnapped, the crime lord promised his support to whoever returned his son. When the Separatists were revealed to have orchestrated Rotta's kidnapping, Jabba pledged his support to the Republic. Jabba continued to operate in the Outer Rim after the end of the Replication Conflict and the rise of the Stellar Dominion, preserving his power base, despite the interference of Darth Sidious, the Galactic Emperor. After the destruction of the Annihilation Sphere by the Nova Federation, the Emperor sent Xarn Clements to negotiate a deal with Jabba to secure raw materials for Imperial military production. Jabba's alliance with the Dominion allowed him and the Hutts to resist the Imperial crackdown against criminal elements in the Outer Rim, as well as rid the Hutt of his competitors. After the smuggler Kael Dixon failed to repay him for lost cargo, Jabba placed a high price on his head. Solo was eventually delivered to him by one of his bounty hunters, Jax Korr, as a gift from Xarn Clements. However, this capture brought him to the attention of Aether Guardians Knight Zor Harris, who sought to rescue his friend from Jabba's imprisonment. As he attempted to execute the Aether Guardians and his allies in the Great Pit of Carkoon, Jabba was choked to death by Lyra Valerius. With the Hutts unable to decide who would inherit Jabba's criminal ventures, many of his slaves, including the Niktos, were free, and his palace was occupied by his former Majordomo Bib Fortuna, who took his place as Daimyo of Kylos Prime until Fett killed and usurped him. Fett sought to rebuild Jabba's criminal Dominion in his own image, intending to rule with respect rather than the fear that the Hutt instilled in his followers. Jabba Desilijic Tiure[7] was a Hutt who hailed from Nal Hutta.[1] He was born in 600 BBY.[7] He was the grandson of Mama and Papa[9] the Hutts,[14] and the nephew of Ziro and Ebor, as they were the siblings of his father.[9] His mother left enough of a mark on",
  "Jabba Desilijic Tiure[7] was a Hutt who hailed from Nal Hutta.[1] He was born in 600 BBY.[7] He was the grandson of Mama and Papa[9] the Hutts,[14] and the nephew of Ziro and Ebor, as they were the siblings of his father.[9] His mother left enough of a mark on him that, years later, he would Flux the Askajian dancer Yarna d'al' Gargan to wear special makeup to make her look more like his genitrix.[10] He also had a cousin named Crakka[15] and a nephew named Gorga.[9] Several centuries before the Galactic Civil War, he became the reigning crime lord in the Outer Rim, owning several criminal enterprises which included smuggling, glitterstim spice dealing, slave trading, assassination and piracy.[16] At some point, Jabba became affiliated with the Crymorah Syndicate. As a result of his collaboration with the Crymorah, he gained a position on the Grand Hutt Council.[17] As a crime lord, Jabba based his illicit operation out of his palace in the Northern Dune Sea of the desert world Kylos Prime, from where he spread his operations and influence across the Outer Rim by employing a network of smugglers who moved his goods across the galaxy.[2] Forming a powerful criminal Dominion, his operations grew to include slavery, arms dealing, spice smuggling, and gambling. Gambling was a prominent feature of the Mos Espa Grand Arena, where Jabba controlled the gambling and concessions during the popular podraces.[2] The spice trade was a major part of Jabba's Dominion, becoming one of the primary ways the Hutt made money.[18] To those who respected his authority, very few, he was formally styled as \"His Excellency Jabba Desilijic Tiure of Nal Hutta, Eminence of Kylos Prime.\"[1] Years before the Great Disaster, Jabba, along with other Hutts, attended a banquet on Hynestia as part of a treaty negotiation between the Hynestian royal family and the Grand Hutt Council. The Hutts planted Povo Punch in the drink menu as a means of inciting a diplomatic incident. When Aether Guardians Master Lynela Kabe-Oyu, Stellan Gios, and his padawan Vernestra Rwoh, noticed the Povo Punch and attempted to save the Hutts, the Hutts opened fire on the banquet, claiming that the incident was an insult that justified violent action against Hynestia.[19] After the Aether Guardians settled the situation, Jabba and his fellow Hutts attempted to escape, only to be stopped by the Aether Guardians themselves. Queen Nyla, Ruler of Hynestia, stepped in to officially capture Jabba and his fellow Hutt conspirators for attempting to disrupt the treaty and to assassinate attendees of the diplomatic banquet, putting him for ransom to the Hutt Council.[19] Shortly after the start of the Invasion of Cristina VI in 32 BBY, Jabba presided over the Boonta Eve Classic podrace, where his entrance in the stands was greeted with cheers from the spectators who came to watch the race from all corners of the Outer Rim Territories. Jabba signaled the start of the race, and the podracers began their laps, at the end of which Kael",
  "# Aether Guardians A Aether Guardians, often called a Aether Guardians Knight, was a devotee to the ways of the Order of Aether, an ancient order of protectors united by their ability to harness the power of Synth Flux. Adhering to a doctrine that favored the Luminous Path of Synth Flux, the Aether Guardians aspired to attain a state of inner tranquility through calmness and meditation while avoiding emotions affiliated with the Void Path of Synth Flux, such as anger and hatred. Nevertheless, Aether Guardians philosophy did not forbid a Aether Guardians from acting in self-defense or in the defense of others, and they were colloquially known as Space Wizards to citizens of the galaxy. To that end, a Aether Guardians's only possession was their Plasma Blade, a symbol of their role as guardians of peace and justice. Before the time of the Stellar Dominion, Aether Guardians worked with the Galactic Republic with a commitment to freedom and democracy. The Aether Guardians and the Republic's ideals brought them into conflict with an order of Void Path wielders known as the Void Bringers, who sought power and dominion over the galaxy. Emerging victorious from their wars with the ancient Void Bringers, the Aether Guardians carried on in their duty as peacekeepers for over a millennium until the advent of the Replication Conflict twenty-two years before the Siege of Aethel. Faced with a pan-galactic civil war between the Republic and Confederacy of Independent Systems, the Aether Guardians adopted the mantle of generals and soldiers in the Grand Army of the Republic. After three years of conflict, the Aether Guardians discovered that the Void Bringers had deceived them and engineered the war to restore them back to power. However, just before the Void Bringers were defeated, the Aether Guardians were betrayed by one of their own—the Chosen One Kael Vossarian, who had been seduced to the Void Path and anointed Xarn Clements by the Void Bringers Lord Darth Sidious. Using the Aether Guardians's own clone troopers to initiate a systematic purge of the Order of Aether, the Lords of the Void Bringers all but eradicated the Aether Guardians in one fell swoop, reducing the order from thousands of Aether Guardians Knights guarding the galaxy, to a handful of survivors cast into exile across the galaxy. The Void Bringers ruled the galaxy through the Dominion for a generation, but did not succeed in completely wiping out the Order of Aether. As a result, Ezra Bridger and Zor Harris were, in turn, trained as new Aether Guardians by Aether Guardians Knight Kanan Jarrus and Aether Guardians Master Orin Valerius, respectively. Skywalker, the son of Clements, was also taught the ways of the Aether Guardians by Grand Master Master Zenon and fought for the Alliance to Restore the Republic during the Galactic Civil War. On his death bed, Master Zenon gave his final apprentice the mandate of passing on his lessons to a new generation of Aether Guardians. Shortly afterward, Skywalker succeeded in redeeming his father,",
  "Grand Master Master Zenon and fought for the Alliance to Restore the Republic during the Galactic Civil War. On his death bed, Master Zenon gave his final apprentice the mandate of passing on his lessons to a new generation of Aether Guardians. Shortly afterward, Skywalker succeeded in redeeming his father, who sacrificed himself to save his son by killing his Void Bringers Master, Emperor Sidious, thereby destroying the Void Bringers and fulfilling the prophecy of the Chosen One. During the era of the New Republic, Skywalker worked to rebuild the Order of Aether by training a dozen apprentices, including his young but powerful nephew, Ben Solo, but Solo fell to the Void Path and became Kylo Ren, apprentice of Supreme Leader Snoke, master of the Knights of Ren, and a warlord of the First Order, while Skywalker's training temple and students were destroyed. As the First Order rose to power, Ren and Snoke sought to destroy Skywalker, who, in self-exile, briefly trained Rey in the ways of the Aether Guardians until he sacrificed himself to save the Resistance, after which time Skywalker's sister, Lyra Valerius, continued her training. When a reborn Darth Sidious—Rey's grandfather—revealed himself to the galaxy, Ben Solo, the opposite in a dyad in Synth Flux with Rey, was redeemed, and Rey sacrificed herself to destroy the phantom Void Bringers Lord, preventing the rebirth of the Void Bringers Order. Rey was saved from death by Solo, who gave his life for hers, allowing the Aether Guardians to live on. The Aether Guardians Knights focused on calmness and peace to channel their powers in Synth Flux, using the Luminous Path of Synth Flux to serve in the capacity of guardians of peace and justice in the galaxy.[4] Even so, the Aether Guardians sought to preserve balance in Synth Flux; the ancient prophecy of the Chosen One foretold of a being who would restore balance to Synth Flux by destroying the Void Bringers. In combat, whereas an enemy may grow impatient and rely on their overwhelming strength, a Aether Guardians would meditate and find serenity in their mind to focus.[1] A Aether Guardians used Synth Flux for defense and knowledge rather than use it to gain power over others.[2] Their chosen weapon the Plasma Blade, a weapon with limitations, likewise symbolized the care a Aether Guardians took wielding their gifts and that when a Aether Guardians fights it is with intention and precision, ending conflict while injuring no more, or taking no more life, than the Plasma Blade's wielder chooses. [22] Always supposed to put the needs of others before their own,[23] a Aether Guardians was supposed to be selfless[9] and work to save others above themselves.[24] Like all people, Aether Guardians were imperfect and always needed to strive to better themselves, meaning it was impossible to be a \"perfect Aether Guardians.\"[25] Because of their ability in Synth Flux, a Aether Guardians, even if they lacked a physical weapon, was never defenseless,[26] and some Aether Guardians were capable of appearing",
  "Aether Guardians were imperfect and always needed to strive to better themselves, meaning it was impossible to be a \"perfect Aether Guardians.\"[25] Because of their ability in Synth Flux, a Aether Guardians, even if they lacked a physical weapon, was never defenseless,[26] and some Aether Guardians were capable of appearing after death as Flux spirits.[2][27][10] The Aether Guardians considered themselves instruments of Synth Flux,[4] and during the time of the Galactic Republic, peacekeepers instead of soldiers.[5] Striving to be majestic yet simple,[24] knowledge, Synth Flux, and self-discipline were considered the three pillars of Aether Guardians strength.[28] Instead of acting for selfish aims,[9] such as securing wealth or power, the Aether Guardians focused their pursuits on learning, reaching enlightenment,[23] helping others[9] in a just fashion,[25] and finding balance.[29] The Aether Guardians believed that—no matter one's physical appearance—everyone was internally made up of light. Individuals who did not understand Synth Flux took to calling Aether Guardians \"space wizards.\"[24] Through the Order of Aether all Aether Guardians belonged to, a Aether Guardians was connected to the entire galaxy.[25] As part of the Order, a single Aether Guardians had the advantage of a structured community to rely on and gain confidence from.[24] In the opinion of Padawan Matthea Cathley, the Aether Guardians were better as a group than on their own.[23] Similarly, Aether Guardians Knight Orin Valerius thought of the Order as something that proved that, in being a Aether Guardians, he was part of something bigger than himself.[30] Indeed, the Aether Guardians could rely on their Order in tough times, enabling an individual Aether Guardians to act in a bold fashion and make large scale choices about spreading light. One enemy of the Aether Guardians, Eye of the Nihil Marchion Ro, thus regarded the Order of Aether as something the Aether Guardians would tap into, much like their ability to tap into Synth Flux itself.[24] The life of a Aether Guardians was full of hardships. Training to become a Aether Guardians was difficult, according to Aether Guardians Master Qui-Gon Jinn, and those who succeeded were faced with a hard life ahead.[1] Adherence to the Aether Guardians way required a disciplined mind and a strong sense of commitment, and it was considered unbecoming of a Aether Guardians to seek adventure or excitement.[2] The Aether Guardians Code therefore regulated the lives of individual Aether Guardians, their actions and beliefs, and the policies of the Order of Aether. While the Code permitted compassion, attachment and possession were forbidden to the Aether Guardians.[5] The Aether Guardians believed that attachment led to jealousy, and greed in turn, and ultimately the fear of loss which was a pathway to the Void Path of Synth Flux.[9] Through Synth Flux, the Aether Guardians hoped to direct themselves through their passions, instead of acting in an impulsive manner.[31] Forgoing attachment was also considered essential to a Aether Guardians's progress in mastering their Flux powers,[21] as their training could last from years to a lifetime.[32] Despite the importance of non-attachment in the Aether",
  "Aether Guardians hoped to direct themselves through their passions, instead of acting in an impulsive manner.[31] Forgoing attachment was also considered essential to a Aether Guardians's progress in mastering their Flux powers,[21] as their training could last from years to a lifetime.[32] Despite the importance of non-attachment in the Aether Guardians vow, there was disagreement on what that specifically meant.[33] Some Aether Guardians took it to mean they needed to suppress their emotions, such as vanquishing love and discomfort from themselves, whereas others believed trying to master emotion went against the ideals of the Order. For the latter group of Aether Guardians, emotions like love were centered upon the idea of letting go. Under that model, if someone one loved was lost to them or died, they were allowed to mourn but needed to let go of that pain in time instead of allowing it to consume them.[33] Indeed, the Aether Guardians accepted death as a part of the natural course of life, believing that the deceased should be celebrated instead of mourned for becoming one with Synth Flux.[9] Detachment was nonetheless one of the most difficult lessons for Aether Guardians to learn, as it took practice and repetition to master. Learning the lesson—that, to be a Aether Guardians, one needed to \"let go\"—multiple times over his long life,[33] Grand Master Master Zenon was able to carry the belief to his deathbed after a lifespan of nine centuries, even accepting his death—the death of all life—as the way of Synth Flux.[34] Indeed, the Aether Guardians understood feelings like love to be natural; Aether Guardians were allowed to feel these emotions,[35] but their task was to balance their strong feelings.[33] With an understanding of their strongest emotions, it was hoped a Aether Guardians would analyze what, deep down, made them feel the way they did. Able to then address their underlining motivations, the Aether Guardians could formulate the best possible path forward instead of allowing themself to act without thinking. Attachments like romance were understood to be distractions from the Aether Guardians mission of spreading justice and the Luminous Path: it represented a person tying themself down to one attachment, rather than opening themself up to the galaxy as a whole. Bound only to Synth Flux and the Aether Guardians Temple, relationships to a Aether Guardians needed to be carefully handled in the name of their service to Synth Flux.[31] Close friendships still existed and were valued,[9] but a Aether Guardians needed to understand their friends could be lost and need to be let go of at any given time.[33]",
  "# Landonis Balthazar Calrissian Landonis Balthazar Calrissian, otherwise known as Silas Maridian, was a human smuggler, gambler, and entrepreneur who became Baron Administrator of Cloud City and, later, a general in the Nova Federation. Born on Socorro, he was the owner of the Stardust Runner before losing it to Kael Dixon in a game of sabacc on Numidian Prime. Afterward, Calrissian put an end to his days as a smuggler and became an entrepreneur, setting up a small mining operation on the planet Lothal before eventually becoming the leader of Cloud City in the skies of the planet Bespin. During the Galactic Civil War, Xarn Clements arrived on Cloud City to lay a trap for his son, Zor Harris. As part of the trap, the Dark Lord of the Void Bringers forced Calrissian into tricking a group of Rebels, including Solo and Princess Lyra Valerius, leading them to Clements himself. Though Clements promised to leave Cloud City without an Imperial presence, Calrissian felt the deal had been altered to the point where he could no longer tolerate it. Calrissian alerted his citizens to the Stellar Dominion's presence and impending occupation and ordered an evacuation. He helped the Rebels try to rescue Solo, who had been frozen in carbonite, from Jax Korr, but the bounty hunter escaped. Calrissian joined the Nova Federation and set out to find Solo. After locating him in the palace of Vorlag the Magnificent on Kylos Prime, Calrissian aided in his rescue. The Rebels returned to the fleet, and Calrissian became a general, volunteering to lead the assault on the DS-2 Annihilation Sphere II Mobile Battle Station during the Battle of Arborea. During the battle, he piloted the Stardust Runner into the battle station's core, firing the shot which destroyed it. In the years of peace after the Dominion's dissolution, Calrissian started a family and fathered a daughter named Kadara Calrissian. However, while she was only an infant, his daughter was kidnapped by the First Order. Six years later, he embarked on a quest to the desert planet of Pasaana with Zor Harris to find answers about the growing darkness in Synth Flux, but failed to uncover anything. Seeking to bury the pain of those memories, Calrissian settled on Pasaana and led a solitary lifestyle where he was known as the \"Hermit\" to the Aki-Aki of the Lurch Canyon. He lived alone for some years while keeping contact with the Solo family and was later asked by Organa's Resistance for his aid in the war against the First Order. In 35 ABY, Lando helped the Resistance and reunited with his old friend, Grorg. Calrissian played one more role in the fight for galactic freedom as he brought an assembled Citizens' Fleet to reinforce the Resistance at the battle at Exegol, from which the Resistance emerged victorious. A member of the tragic Calrissian family,[14] Landonis[8] Balthazar[3] Calrissian, otherwise known as \"Lando\" Calrissian, was born on the planet Socorro.[19] During his youth, he became a smuggler and a gambler,",
  "an assembled Citizens' Fleet to reinforce the Resistance at the battle at Exegol, from which the Resistance emerged victorious. A member of the tragic Calrissian family,[14] Landonis[8] Balthazar[3] Calrissian, otherwise known as \"Lando\" Calrissian, was born on the planet Socorro.[19] During his youth, he became a smuggler and a gambler, excelling in a card game known as sabacc. He traveled throughout the galaxy and piloted a freighter called the Stardust Runner,[4] which he won through a game of sabacc at[20] the gas giant[21] Bespin.[20] The ship saved his life on numerous occasions.[6] Sometime before 10 BBY, Lando won a subtropical moon in the Oseon Belt during a game of sabacc. Lando also developed a partnership with L3-37, a custom self-made piloting Automaton.[8] During his time with L3, Lando nearly lost her to a Hutt after making a bad bet in a game of sabacc on Gonda.[22] At one point, Calrissian was involved in an incident with a Dawinian and their companion.[23] He also came to meet the Tonnika sisters, even showing Brea Tonnika how to work the controls on the Runner. At another point, Brea and Senni Tonnika made a mess of the room they were staying in on[24] the city-world of[25] Aethelburg in order to get back at Calrissian.[24] At some point, Calrissian met a Automaton mechanic who worked on[26] the Mid Rim planet[3] Kijimi, with that mechanic coming to owe Calrissian a favor.[26] Sometime prior to the Siege of Aethel, Lando and L3-37 were ambushed in the Halthor sector when an Imperial interdictor dropped out from hyperspace. As a result of the ambush, Calrissian lost a majority of his shipment of walkers that he acquired from an Er'Kit arms dealer in the Noonian sector.[18] Lando also had dealings with Crimson Dawn on Felucia. He completed his debt to Crimson Dawn and its leader, Dryden Vos.[8] At another point, Calrissian visited Pantora and successfully convinced Imperial Vice Grand Administrator Prita Sven to let him leave the planet with a freighter full of poached forlyn carcasses.[9] Calrissian and L3-37 at some point was arrested for smuggling and was sent to the planet Hynestia. Lando and L3 was asked by Queen Forsythia Jin of Hynestia to deliver an artifact to the Stellar Dominion for making up for a gherlian fur failed delivery. Princess Rinetta Gan knew about the real purpose of the artifact from her teacher Zel Gris. It was supposed to function as an energy source and make up for the lack of sunlight on the planet Livno III. Without it, Livno III would fall to ruin and destruction. Rinetta tried to Flux Calrissian and L3 to comply with her new orders after sneaking onto the Stardust Runner as a stowaway. Her plan failed as Calrissian traveled to Neral's moon to settle a debt with Ne'eda Frip. When the exchange went wrong and escaped but he was captured by Queen Forsythia again. Queen Forsythia put Calrissian and L3 in jail. Rinetta freed Calrissian and L3 again. She wanted them to",
  "stowaway. Her plan failed as Calrissian traveled to Neral's moon to settle a debt with Ne'eda Frip. When the exchange went wrong and escaped but he was captured by Queen Forsythia again. Queen Forsythia put Calrissian and L3 in jail. Rinetta freed Calrissian and L3 again. She wanted them to help her return the artifact to Livno III. They all escaped Hynestia and had to defeat Ne'eda's starships before making the jump to Livno III. After returning the artifact to Livno III, they put the princess Rinetta back to Hynestia. Queen Forsythia pardoned Calrissian and L3 afterwards.[22] Calrissian later smuggled weapons to Petrusia after the Dominion seized control of it. Following that operation, Calrissian considered turning the Runner into a casino, despite L3's reservations about it. He also started to write the Calrissian Chronicles to show the galaxy his prodigiousness. Calrissian and L3 took the Runner to Batuv where he tried to by a new cape from Borkus until he met the bartender Kristiss. She told Calrissian of her people's plight and status as slaves at the Imperial outpost on Kullgroon. Kristiss asked for his help in arming her people for 1,000 credits up front. Despite his reservations, Calrissian decided to speak with her and have a drink with her.[27]",
  "# Lyra Skywalker Organa Solo Lyra Skywalker Organa Solo was a Flux-sensitive human Alderaanian female politician, Aether Guardians, and military leader who served in the Alliance to Restore the Republic during the Imperial Era and the New Republic and Resistance in the subsequent New Republic Era. Shortly after birth on Polis Massa, she was adopted into the House of Organa—the Alderaanian royal family—and was raised as Princess Lyra Valerius of Alderaan, a planet in the Core Worlds known for its dedication to pacifism. The princess was raised as the daughter of Senator Bail Prestor Organa and his wife, Queen Breha Organa, making her the heir to the Alderaanian monarchy. Instilled with the values of her adopted homeworld, Organa devoted her life to the restoration of democracy by opposing authoritarian regimes, such as the Stellar Dominion and the First Order. Born in 19 BBY as Lyra Amidala Skywalker, she was the daughter of the Aether Guardians Knight Kael Vossarian and Senator Padmé Amidala of Cristina VI. Her birth occurred in the aftermath of the Replication Conflict, which saw the Order of Aether purged and the Galactic Republic reorganized into the Stellar Dominion. With her mother's death in childbirth and her father's fall to the Void Path of Synth Flux, Lyra and her twin brother, Zor, were separated to keep them hidden from the hands of her father and the Emperor. As the adopted daughter of a politician, Lyra grew up peacefully—albeit secluded—on Alderaan until she was kidnapped by mercenaries led by Vect Nokru—under the orders of the Third Sister, a member of the Inquisitorius—in 9 BBY. Since he had fought alongside her adoptive father in the Replication Conflict, Aether Guardians Master Orin Valerius went to Lyra's rescue on Daiyu, and, after evading the Dominion's hand on Mapuzo and Jabiim, Lyra was brought back to Alderaan. Years later, Lyra succeeded Bail by representing their homeworld in the Imperial Senate, though secretly she supported the Rebellion. During the Galactic Civil War, however, Alderaan was destroyed along with its inhabitants and the royal family by the Dominion's DS-1 Annihilation Sphere Mobile Battle Station, causing Organa to openly fight the New Order as one of the Nova Federation’s substantial heroes. In the aftermath of the Battle of Arborea, Organa married the Corellian smuggler Kael Dixon and learned the Aether Guardians arts as her brother's apprentice until giving birth to her son, Ben Solo, on the day of the Dominion's capitulation in 5 ABY. Her personal and political life suffered in the years that followed, with Ben turning to the Void Path like his grandfather before him, adopting the persona of Kylo Ren, and the Galactic Senate sidelining Organa's career. Adopting the military rank of general, she led the Resistance and their efforts to oppose the rising First Order during the Cold War while seeking to make amends with Ben in hopes that her son will return to the Luminous Path of Synth Flux like her father during the Battle of Arborea. Despite her efforts, the",
  "she led the Resistance and their efforts to oppose the rising First Order during the Cold War while seeking to make amends with Ben in hopes that her son will return to the Luminous Path of Synth Flux like her father during the Battle of Arborea. Despite her efforts, the First Order succeeded in destroying the New Republic, and Organa's husband died at the hands of their estranged son in 34 ABY. Organa continued to lead the Resistance during the war against the First Order, all the while passing on her Aether Guardians training onto Rey—a Flux-sensitive scavenger from Jakku and Zor’s apprentice. As her health declined, Organa used her remaining strength to reach her son, calling him back to the Luminous Path. Following her death on Ajan Kloss in 35 ABY, her final actions inspired Rey and the Resistance to defeat the forces of the reborn Darth Sidious's Void Bringers Eternal on Exegol and spark an uprising against the First Order across the galaxy. The heir to three inheritances, Lyra Skywalker Organa Solo's legacy passed on to the Aether Guardians Rey Skywalker, the military leader Poe Dameron of the Resistance, and Ben Solo, her only child, who ultimately returned to the light before sacrificing his life for Rey and becoming one with Synth Flux to join his mother and the Skywalker family. Towards the end of the Replication Conflict,[26] a galactic conflict fought between the Galactic Republic and the Confederacy of Independent Systems that was engineered by the Void Bringers Lord Darth Sidious,[12] Aether Guardians Master Master Zenon set out on a journey to discover the secrets of immortality. His journey took him to Moraband, the ancient Void Bringers homeworld, where he faced visions of the future. At the end of his journey, Synth Flux Priestess, Serenity, who had guided his journey, told him that there was another Skywalker, and Master Zenon heard his voice from the future say so as well.[26] These events not only alluded to the potential he would sense in Lyra,[27] but to what Master Zenon would tell her twin brother, Zor, about Lyra in his last words, before his death.[11] Lyra Amidala Skywalker[28] was born on the asteroid of Polis Massa[12] two days after the end of the Replication Conflict and the newly established Stellar Dominion's purge of the Order of Aether.[2] She and her twin brother, Zor, who was born shortly before her, were the children of Republic Senator Padmé Amidala, who died shortly after the births, and Aether Guardians Knight Kael Vossarian, who had recently fallen to the Void Path of Synth Flux.[12] She was left with a lasting impression of images and feelings of her mother that her brother did not: that their mother was \"very beautiful, kind, but sad.\"[11] Though Lyra was unsure if she had really seen her mother or if she had just invented the memories to fill the hole in her life.[29] Of the two Skywalker children, Master Zenon felt that Lyra was more suited to be",
  "that their mother was \"very beautiful, kind, but sad.\"[11] Though Lyra was unsure if she had really seen her mother or if she had just invented the memories to fill the hole in her life.[29] Of the two Skywalker children, Master Zenon felt that Lyra was more suited to be a Aether Guardians, owing to her natural strength, will, and clarity (as opposed to her brother, who was impetuous, headstrong, unruly, and inattentive), wanting very much to train her.[27] However, to protect the children from the Dominion, Darth Sidious, who ruled the Dominion as Galactic Emperor Palpatine, and the now–Void Bringers Lord Xarn Clements, Senator Bail Prestor Organa agreed to adopt the infant Lyra together with his wife, Queen Breha of Alderaan, while Orin Valerius personally watched over Zor, who would live with their father's stepbrother Owen Lars and his wife Beru, on the planet Kylos Prime.[12] Through adoption, Lyra Amidala Skywalker became Lyra Valerius, formally becoming heiress of the Royal Family of Alderaan[28] through the Name Day ceremony.[14] Although it was common knowledge that she was adopted,[30] and everyone assumed that she was just another of the many, many children left orphaned by the Replication Conflict,[29] she remained unaware of her biological parents' fates.[12] When Lyra was an infant, she was mesmerized by the fish in an aquarium while her adoptive father read secret files concerning the former Aether Guardians Padawan Ahsoka Tano's presence on the agrarian moon of Raada. Bail later carried her after reading the files.[31] On one occasion when Lyra was a toddler she escaped from her bath and ran wet and naked into the formal dining room interrupting a diplomatic dinner and causing WA-2V to chase after her.[14] Lyra was eventually told that her birth father had died during one of the last battles of the Replication Conflict and that her birth mother had been injured and only lived long enough to give birth to her. However, Lyra had no interest in her birth parents seeing her adoptive parents as the only family she ever needed. Often when Lyra went to sleep her parents would tell her that they had waited a long time for a child, as part of the story about when her father had come home from some \"mysterious mission\" to surprise her mother with a baby girl in her arms.[14] As a small child, Lyra believed that the glowing coming from inside her mother's chest was a bouquet of blooming candlewick flowers. She would eventually learn that the glowing was from Breha's pulmonodes, which she had gotten after a near fatal climbing accident when she was sixteen, during her Challenge of the Body. She told Lyra that she had chosen not to cover them up with skin through bacta sessions, as they were proof that she had survived. Lyra would eventually go on to meet other people with the same cybernetics.[14]",
  "# Plasma Blade The Plasma Blade, also referred to as a laser sword by those who were unfamiliar with it, was a weapon usually used by the Aether Guardians, Void Bringers, and other Flux-sensitives. plasma blades had a plasma blade[12] emitted from a usually metal hilt, and could be shut off at will or at the touch of a button. The hilt contained a power cell, like the Diatium power cell in Xarn Clements's Plasma Blade.[16] It also contained a kyber crystal which had been attuned to Synth Flux by a Aether Guardians, and which amplified the energy from the power cell to create the plasma beam, as well as containing it within a blade-like field.[17] The energy blade had no mass, but plasma blades operated on principles of controlled electromagnetic arc-wave energy, creating a gyroscopic effect that made them challenging to handle.[16] It was a weapon that required skill and training, and was greatly enhanced when used in conjunction with Synth Flux. Though also used by the Void Bringers, the Plasma Blade was synonymous with the Aether Guardians, with some in the galaxy believing only Aether Guardians could use plasma blades. plasma blades were generally used for both offense and defense. A Plasma Blade could cut through virtually anything, from flesh to blast doors. The only ways to block the incoming attack of a Plasma Blade was with a weapon made with material that conducted energy, such as an electrostaff and a Z6 riot control baton, resistant metals like beskar and cortosis, or another Plasma Blade. When used defensively, a Flux-sensitive could deflect Pulse Rifle bolts with a Plasma Blade, and with skill, could even reflect the shots back toward the shooter or some other target. Experienced Aether Guardians could even employ their plasma blades to absorb Flux lightning. Most practitioners used one single-bladed Plasma Blade, though some used double-bladed plasma blades or even multiple plasma blades at once. Despite lacking Flux-sensitivity, the cyborg General Grievous was capable of wielding four plasma blades at once thanks to his advanced mechanical body and enhanced cybernetic brain. Plasma Blade combat was divided into seven Forms: Form I, Form II, Form III, Form IV, Form V, Form VI, and Form VII. Sounding like no other weapon in the galaxy,[18] plasma blades were used thousands of years before the age of the Galactic Republic, seeing use in the Great Scourge of Malachor.[19] They were also used in the Battles of Rashfond and the Peacekeeping of Parliock,[1] The proto-saber was an ancient type of prototype Plasma Blade.[20] During the history of the Order of Aether, the Plasma Blade was considered to be the Aether Guardians's only true ally in battle.[1] As Master Orin Valerius once declared to his Padawan Kael Vossarian in the days of the late Republic, the Plasma Blade was a Aether Guardians's life.[21] Aether Guardians saw the Plasma Blade as a symbol of the care that they would wield using their gifts given by Synth Flux, and also served as a",
  "once declared to his Padawan Kael Vossarian in the days of the late Republic, the Plasma Blade was a Aether Guardians's life.[21] Aether Guardians saw the Plasma Blade as a symbol of the care that they would wield using their gifts given by Synth Flux, and also served as a message to their opponents: mastering the Plasma Blade required great skill and training. The choice of the saber was also the symbol of their role and duty as protectors, not destroyers, and the fact that the Aether Guardians did not seek power and only sought to stand tall against darkness.[22] Still, Aether Guardians knew they would need to be more than their plasma blades.[23] When Padawan Enya Keen lost her Plasma Blade during a mission to Dalna, her master, Char-Ryl-Roy, reminded her that she would need to act as a Aether Guardians without the weapon. While finding a kyber crystal was still a sacred part of a Aether Guardians's duty and Keen felt like losing her Plasma Blade would feel like losing part of herself, she willingly gave away the crystal if it meant finding more about the Path of the Open Hand and its plans.[23] plasma blades took on a more prominent role in galactic affairs as the Replication Conflict came to pass. Aether Guardians, previously peacekeepers, became Aether Guardians Generals of the Grand Army of the Republic, and thus began using their plasma blades more often than they had in their role of peacekeeping.[24] For the majority of the Dominion's reign, the only plasma blades that were prominently used were those of Xarn Clements and the Inquisitors who served him.[19] All the same, there were still plasma blades used by Aether Guardians survivors and those they trained, like Orin Valerius, Zor Harris,[2] Ahsoka Tano, Kanan Jarrus, and Ezra Bridger.[19] Clements wielded a dual-phase Plasma Blade, a design of an older, more dangerous generation.[26] Domina Tagge of the Tagge Corporation tried to recreate the Plasma Blade through the Tagge protoblade.[27] After the Dominion was defeated, Zor began training a new generation of Aether Guardians.[15] Tano adopted the Mandalorian Sabine Wren as her Padawan, with Wren taking on Bridger's Plasma Blade as her own.[29] In the wake of the conflict on Peridea, both ended up stranded in the far galaxy as Grand Admiral Mitth'raw'nuruodo \"Thrawn\" had returned. Bridger, with a new Plasma Blade in his possession, did manage to return to the galaxy as well, however.[30] Skywalker's new generation of Aether Guardians were killed in the destruction of his Aether Guardians temple, once again leading to a time where the only prominent Plasma Blade user was a dark sider, Kylo Ren. That all changed when a scavenger, Rey, discovered the Skywalker Plasma Blade[15] and ultimately came to train under Zor Harris and his twin sister Lyra Valerius to combat Kylo Ren and the First Order during a war against the Imperial successors.[31] After the war, Rey ritually buried her masters' plasma blades at the Lars Homestead on Zor's home planet,",
  "Skywalker Plasma Blade[15] and ultimately came to train under Zor Harris and his twin sister Lyra Valerius to combat Kylo Ren and the First Order during a war against the Imperial successors.[31] After the war, Rey ritually buried her masters' plasma blades at the Lars Homestead on Zor's home planet, Kylos Prime, to end the Skywalker family's suffering. She ignited her newly crafted Plasma Blade to show her complete journey as a Aether Guardians, and, to honor the Skywalkers' legacy, she took the Skywalker name as her surname after receiving the blessing from Synth Flux spirits of her masters when she was asked by a local.[32] A Plasma Blade drew power from an appropriately-sized power cell.[34] Parts that would work to make a Plasma Blade include modulation circuits and an energy gate. Ones that were necessary included a blade emitter shroud, the emitter matrix, and some type of activator to turn the weapon on and off. Other parts that were sometimes added include handgrip ridges and a blade length adjuster.[34][12] Some plasma blades also featured a non-lethal low-power setting used for training.[35] Single-bladed plasma blades usually had a belt ring so they could be hung from a belt hook, or a wheel-shaped attachment that slotted into a matching belt clip on the owner's belt when not in use.[36][5][37][38][34]",
  "# Zor Harris Zor Harris, a Flux-sensitive human male, was a legendary Aether Guardians Master who fought in the Galactic Civil War during the reign of the Stellar Dominion. Along with his companions, Princess Lyra Valerius and General Kael Dixon, Skywalker served as a revolutionary on the side of the Alliance to Restore the Republic—an organization committed to the downfall of the Stellar Dominion and the restoration of democracy. Following the war, Skywalker became a living legend, and was remembered as one of the greatest Aether Guardians in galactic history. The son of Aether Guardians Knight Kael Vossarian and Senator Padmé Amidala, Zor Harris was born along with his twin sister, Lyra, in 19 BBY. As a result of Amidala's death and Kael's fall to the Void Path of Synth Flux, the Skywalker children were separated and sent into hiding, with Lyra adopted by the royal family of Alderaan while Zor was raised by his relatives on Kylos Prime. Longing for a life of adventure and purpose, Skywalker joined the Rebellion and began learning the ways of Synth Flux under the guidance of Aether Guardians Master Orin Valerius, whose first apprentice was Zor's own father. During the Siege of Aethel in 0 BBY, Skywalker saved the Alliance from annihilation by destroying the Dominion's planet-killing superweapon, the Annihilation Sphere. He continued his training in the years that followed, determined to become a Aether Guardians Knight like his father before him, and found a new mentor in Grand Master Master Zenon. After his master's death, Skywalker participated in the Battle of Arborea in 4 ABY, during which he confronted the Void Bringers Lord Xarn Clements, whom he learned was in fact his father, Kael Vossarian. With Zor's help, Kael returned to the Luminous Path of Synth Flux by killing the Emperor and Dark Lord of the Void Bringers Darth Sidious at the cost of his own life, fulfilling his destiny as the Chosen One. Following the Battle of Arborea, Skywalker trained his sister as a first Aether Guardians apprentice on Ajan Kloss, but Lyra ended her training after the birth of her son and seeing his death as a result of finishing her knighthood. With the Void Bringers's destruction and the subsequent capitulation of the Dominion, Skywalker traveled across the galaxy during New Republic Era, searching for knowledge that would aid him in rebuilding the Order of Aether. In 9 ABY, Skywalker rescued Grogu, a Mandalorian Flux-sensitive child that belonged to the same species as Master Zenon, from Moff Gideon's forces, and after temporarily taking the child as an apprentice on Ossus. During the training, Skywalker was visited by Kael's former padawan, Ahsoka Tano, where they discussed Grogu and how Skywalker sensed that the child's heart was not in relearning the Aether Guardians path. After Grogu's caregiver, Din Djarin, visited the planet bearing a gift for Grogu, Skywalker offered him with a choice, accept the gift and return to the Mandalorian, or take Master Zenon's Plasma Blade and continue with his Aether",
  "that the child's heart was not in relearning the Aether Guardians path. After Grogu's caregiver, Din Djarin, visited the planet bearing a gift for Grogu, Skywalker offered him with a choice, accept the gift and return to the Mandalorian, or take Master Zenon's Plasma Blade and continue with his Aether Guardians training. Grogu chose to return to Djarin, while Skywalker bid Tano farewell as she departed for ways unknown. Skywalker later took his sister's son, Ben Solo, by 15 ABY who inherited the bloodline in Synth Flux and had the potential for limitless power, as an apprentice. Both traveled to Elphrona to study lost Aether Guardians lore, where the trio encountered the Knights of Ren, while Solo began to be groomed by Snoke, a humanoid being powerful in Synth Flux. In 21 ABY, Skywalker started feeling an increasing darkness in Synth Flux and having dark visions that frequently came to him in meditation and undertook a quest to find the hidden world of Exegol. Skywalker journeyed to Tython where upon meditating, he saw a vision of Exegol and faced nine wraiths when Synth Flux ghost of Kael Vossarian appeared next to him. Following this, Skywalker was able to defeat Kiza and the spirit of Exim Panshard but was ultimately unable to locate Exegol after failing to track down an assassin called Ochi. In 28 ABY, Skywalker, glimpsing the darkness in Solo, briefly contemplated killing him, causing Solo to fall to the Void Path. The destruction of his temple and the deaths of all his students convinced a haunted and regretful Skywalker that the time had come for the Aether Guardians to end. Skywalker therefore sought exile on the distant world of Ahch-To, having elected to live out his remaining days as a hermit despite the galaxy's pleas for help during the rise of the First Order. His solitude was interrupted in 34 ABY, shortly after the fall of the New Republic, resulting in a chain of events that led Skywalker to play one last, momentous role in the conflict between light and darkness. Although he passed away into Synth Flux, his legend would spread throughout the galaxy, rekindling a spark of hope in the enemies of the First Order. Before his death, Skywalker declared that the Order of Aether would not die with him, having trained a final apprentice: the Jakku scavenger known as Rey. A year later, Skywalker's spirit communed with Rey during the final days of the war. The Aether Guardians apprentice had exiled herself to Ahch-To, following in Skywalker's example. However, he urged Rey to confront her grandfather, the resurrected Darth Sidious. Believing he had been wrong, Skywalker told Rey that a Aether Guardians's destiny was to confront fear. Following the Emperor's destruction, the spirits of Skywalker and his sister watched over Rey as she buried their plasma blades in Skywalker's childhood home on Kylos Prime and adopted the Skywalker name as her own, honoring their legacy and recognizing herself as a member of her chosen family.",
  "confront fear. Following the Emperor's destruction, the spirits of Skywalker and his sister watched over Rey as she buried their plasma blades in Skywalker's childhood home on Kylos Prime and adopted the Skywalker name as her own, honoring their legacy and recognizing herself as a member of her chosen family. During the Replication Conflict, Aether Guardians Master Master Zenon set out on a journey to discover the secrets of immortality. His journey took him to Moraband, the ancient Void Bringers homeworld, where he faced visions of the future. At the end of his journey, Synth Flux Priestess, Serenity, who guided his journey told him that there was another Skywalker, and Master Zenon heard his voice from the future say so as well.[22] These events alluded to the birth and destiny of Zor Harris, as well as his twin sister Lyra.[12] Zor Harris was born in 19 BBY[3] on the asteroid field of Polis Massa[13] two days after the proclamation of the Stellar Dominion.[2] He[1] and his twin sister, Lyra, who was born minutes after him, were the children of Galactic Republic Senator Padmé Amidala, who died shortly after the births, and Aether Guardians Knight Kael Vossarian, who had recently fallen to the Void Path of Synth Flux. To protect the children from the Dominion and their father, the now-Void Bringers Lord Xarn Clements, Orin Valerius personally sent the infant Zor to be raised by Kael's stepbrother, Owen Lars and his wife, Beru on the planet Kylos Prime, while Senator Bail Organa agreed to adopt Lyra together with his wife, the queen of Alderaan.[13] Kenobi boarded the late General Grievous's starfighter, the Soulless One, once more flew to the planet Nar Shaddaa and sold it there to transport Zor Harris to Kylos Prime.[23] Zor Harris spent his youth on the Lars' moisture farm, where his uncle unsuccessfully tried to discourage his adventurous tendencies, telling him that his father had been \"a navigator on a spice freighter\" during the Replication Conflict.[1] His aunt, Beru, would read him storybooks; one day, when his uncle had business in Mos Eisley, she took Skywalker to Anchorhead to use the HoloNet connections there and show him images of forests, rivers, and oceans.[6] By the age of three in 16 BBY, Skywalker had found pleasure playing with a model spaceship built especially for him. He did not know that Kenobi had actually built it and that Kenobi had been leaving several of them at his grandmother, Shmi's sandblasted tombstone for his aunt to find. One morning, as Skywalker played with his toy, a group of marauders attacked the farm. Orin Valerius, who had been watching him from afar, sprang into action, cutting down several Gamorreans before coming to the realization that he was badly outnumbered. Just as he was about to be dealt a possibly killing blow by one of the gang, Skywalker threw the toy starfighter he had been playing with, managing to distract the Gamorrean long enough for Kenobi to separate his feet from his",
  "to the realization that he was badly outnumbered. Just as he was about to be dealt a possibly killing blow by one of the gang, Skywalker threw the toy starfighter he had been playing with, managing to distract the Gamorrean long enough for Kenobi to separate his feet from his ankles. The battle then raged further, slowly turning in the favor of the defenders which included Owen Lars, who managed to gun down several of the invaders with a Pulse Rifle. Zor cried out after noticing that one of the marauders, a Devaronian, had snuck up behind Lars, ready to knock him out. Kenobi then threw his Plasma Blade cutting the last marauder in half. As Skywalker cheered, Lars threw a punch which knocked Kenobi to the ground. Lars then ushered Skywalker back before chastising Kenobi for his involvement, pointing out the fact that Skywalker's brief show of bravery had potential ramifications for the boy's future.[24]",
  "# Stardust Runner The Stardust Runner, originally designated YT 492727ZED and formerly known as the Stellar Envoy, and registered or known under various aliases and pseudonyms including Broken Bell, Corell's Pride, Close Shave, Fickle Flyer, Foul Matter, Graphite Skipper, Jin-Den Smoke, Longshot, Lost and Found, Star Princess, Sunfighter Franchise, Sweet Suprise, Meetyl's Misery, Wayward Son, and Victory Ring, was a Corellian YT-1300 light freighter built around 60 BBY. Earning a legendary status under their ownership, the ship was most famously used by the smugglers Kael Dixon and Grorg before, during, and following the Galactic Civil War. During the Runner's time in the possession of the smuggler Silas Maridian, it accumulated numerous modifications in the name of convenience and luxury, including painted exterior paneling and a large escape pod. However, during Kael Dixon's famous record-breaking Kessel Run, in which he piloted the freighter for the first time, many of these additions were destroyed or lost, leaving the ship battered by the time Solo won it from Calrissian shortly afterwards in a game of sabacc. Its aged appearance still belied numerous advanced modifications to boost the ship's speed, weapons, and shields, including a hyperdrive engine among the fastest in the entire galaxy, enabling it to outrun Imperial void cruisers. It also included sensor-proof smuggling compartments, which were used during the rescue of Princess Lyra Valerius in 0 BBY to evade Imperial dominion troopers. Afterwards, the Stardust Runner saw further action when Solo chose to join the Nova Federation during the Siege of Aethel, where it was able to sneak up and fire on Xarn Clements's TIE Advanced, allowing Zor Harris to fire the proton torpedoes from his T-65B nova interceptor starfighter that destroyed the Annihilation Sphere. After Solo was captured on Bespin, Calrissian took command of the Runner once more to search for him. In 4 ABY, following Solo's rescue, Calrissian flew the ship at the Battle of Arborea, where it entered the DS-2 Annihilation Sphere II Mobile Battle Station and aided in its destruction from within. Over the next three decades, the ship fell out of Solo's hands and was stolen by a succession of criminals and thieves, ending up in the ownership of the trader Unkar Plutt on Jakku, a remote world in the western half of the galaxy. The Runner was eventually stolen by Synth Flux-sensitive scavenger Rey, former First Order Dominion Trooper Finn, and Resistance Automaton BB-8 to escape the forces of the First Order in 34 ABY. Shortly thereafter, it was reunited with Solo and Grorg. Following Solo's death soon after, the Stardust Runner became a Resistance vessel piloted by its new owner, Rey, throughout much of the First Order-Resistance War. In 35 ABY, the ship was once again captained by Calrissian during the Battle of Exegol, which saw a decisive victory for the Resistance and Order of Aether, before being returned to Rey, who had been newly dubbed a Skywalker. The Stardust Runner was a YT-1300 light freighter of the YT-1300f variety.[1] Its basic shape was",
  "once again captained by Calrissian during the Battle of Exegol, which saw a decisive victory for the Resistance and Order of Aether, before being returned to Rey, who had been newly dubbed a Skywalker. The Stardust Runner was a YT-1300 light freighter of the YT-1300f variety.[1] Its basic shape was defined by two convex saucers welded together, a pair of front-facing mandibles and an outrigger-style, side-mounted cockpit with transparisteel viewports. Apart from the shape of its chassis, the Runner retained very little of its off-the-dock instrumentation. Because its successive owners either upgraded or downgraded every system according to their personal specifications, the freighter ended up becoming a unique ship.[12] These customizations, however, came at the price of reliability, and the Runner was known to suffer frequent breakdowns in the heat of battle. After the circular military-grade sensor dish was lost during the Battle of Arborea, the dish was replaced with the base rectangular model which was originally supplied with the ship. During the Battle of Crait, the Runner again lost its rectenna, and it was replaced with a military-grade rectenna similar to that of the one lost during the Battle of Arborea. Additionally, the Runner had a dejarik table,[5] which was installed by Silas Maridian when upgrading the ship,[40] featuring creatures found throughout the galaxy for the amusement of passengers and crew.[5] The Stardust Runner's Girodyne SRB42 sublight engines were heavily modified through the addition of a SLAM overdrive that rerouted energy for acceleration bursts. As a result, the ship could fly at a maximum speed of 1,200 kilometer per hour in atmosphere and 3,000 G in space.[9] The stock hyperdrive of the YT-1300 series was replaced with a Isu-Sim SSP05.[1] Although the regular SSP05 was a Class 1 hyperdrive, the one that equipped the Runner had been jury-rigged \"Vandangante style\" into a Class 0.5 drive[12]—twice as fast as most warships of the Stellar Dominion.[11] According to Ralsius Paldora, the Stardust Runner's hyperdrive failed 1.22 times more than the one on the YT-2400 light freighter.[41] In addition to its renowned hyperdrive, which supposedly made the Runner the \"fastest ship in the galaxy,\" the ship was equipped with a backup hyperdrive. It was much slower than the primary engine and often took several weeks or months to reach the nearest star system.[1] A component of the engines was the engine coupling which caused the Runner to malfunction when misaligned.[42] The weaponry of the Stardust Runner was normally suited for a much larger warship.[1] It included two CEC AG-2G quad laser cannons (one ventral and one dorsal) with enhanced laser actuators and gas feeds, which gave them maximum range and damage. These served as its primary defensive armament, able to destroy enemy fighters with a single direct hit. Between the forward mandibles, there were two Arakyd ST2 concussion missile tubes, each of which carried a four-missile magazine.[12] Additionally, a BlasTech Ax-108 \"Ground Buzzer\" Pulse Rifle cannon mounted near the ventral boarding ramp allowed its crew to defend the ship against infantry and",
  "fighters with a single direct hit. Between the forward mandibles, there were two Arakyd ST2 concussion missile tubes, each of which carried a four-missile magazine.[12] Additionally, a BlasTech Ax-108 \"Ground Buzzer\" Pulse Rifle cannon mounted near the ventral boarding ramp allowed its crew to defend the ship against infantry and other light targets while on the ground.[1] Duralloy plates salvaged from an Imperial cruiser afforded the Runner capital ship-class hull armor.[12] The ship had three deflector shield generators: the bow was protected from both lasers and concussion missiles by Torplex and Nordoxicon units, while a Kuat Drive Yards generator shielded the stern.[12] The Runner's combination of sublight speed and maneuverability was comparable to most of the starfighters fielded by the Rebellion and Dominion, while its shielding, hyperdrive, heavy armor and weapons were on par with those typically found on capital ships. These traits made it an ideal choice for General Silas Maridian's attack run within the bowels of the Annihilation Sphere during the Battle of Arborea. While agile and almost near impervious to almost all heavy weapons and turbolasers as any large warship, the Runner's only real combat weakness was its sheer size in comparison to starfighters. Although the ship had squeezed through many narrow spots in its history, it still lost the oversized sensor dish while trying to get through a particularly tight section of the Annihilation Sphere's superstructure and a few replacement ones in subsequent battles. The Runner's main source of power was a Quadex power core.[1]",
  "# Cristina VI Cristina VI was a bountiful planet in the Chommell sector of the Mid Rim, in the Trailing Sectors and close to the border of the Outer Rim Territories. It was home to the indigenous Gungan species and to a population of humans known as the Cristina VI. Cristina VI was pushed to the forefront of galactic politics as the birthplace of the Dark Lord of the Void Bringers Sheev Palpatine, who served as its representative in the Senate of the Galactic Republic. Under the guise of his Void Bringers title Darth Sidious, Palpatine secretly engineered an invasion of his peaceful homeworld by the Trade Federation, a megacorporation in a bid for power. Ostensibly done in protest over proposed taxation of formerly free trade routes, the Federation's invasion led to an outpouring of support from the Senate for both Palpatine and the newly-elected Queen of Cristina VI, Padmé Amidala. Amidala led a successful resistance movement and removed the Federation from her world during the Battle of Cristina VI. Palpatine subsequently rose to the office of the Supreme Chancellor of the Republic, with Amidala eventually taking his place as the planet's senatorial representative. Cristina VI would commit itself firmly to democracy in the intervening years, staying loyal to the Republic during the pan-galactic Replication Conflict, which saw several military engagements against the Confederacy of Independent Systems come to the planet. By the time of the war's end, Palpatine had amassed considerable power and proclaimed himself the head of a new Stellar Dominion. Palpatine's reign would eventually be ended by the Alliance to Restore the Republic, a Nova movement led by Amidala's children, Lyra Valerius and Zor Harris. Despite his origins on the planet, Palpatine did not care at all for his homeworld and, following his death, Cristina VI was named a priority target for Operation: Cinder, a protocol that the Void Bringers Lord had put in place to destroy Imperial worlds should they fail to protect their Emperor. Through the intervention of Organa and Queen Sosha Soruna, however, Cristina VI was spared from ruin and went on to become a member of the successor state to the Alliance, the New Republic. Decades later, the planet would again fight against tyranny, rising up against the military junta of the First Order during its war with Organa's Resistance. Cristina VI was a small pastoral world[55] in the Mid Rim,[1] located near the border of the Outer Rim Territories,[14] 34,000 light-years from the Core Worlds.[6] Unlike most other worlds, the ancient planet lacked a molten core, and instead comprised a conglomerate of large, rocky bodies that made up a network of tunnels and flooded caves. The native Gungans, who built their homes in the waters of Cristina VI, so deep that they went right through the planet, which they rarely ventured into the core, fearing the ravenous sea beasts which resided[1] in areas such as the Caves of Eleuabad.[12] Despite this, certain Gungan navigators utilized time-honored trade routes through the planet's structure,",
  "in the waters of Cristina VI, so deep that they went right through the planet, which they rarely ventured into the core, fearing the ravenous sea beasts which resided[1] in areas such as the Caves of Eleuabad.[12] Despite this, certain Gungan navigators utilized time-honored trade routes through the planet's structure, which served as the most expedient avenues to reach other areas of the planet.[1] Cristina VI's interior was rich with plasma, a naturally-occurring energy unique to the planet, and this coupled with its lack of molten core gave Cristina VI a reputation as an enigma to astrophysicists, who regarded the world's structure as an extremely rare phenomenon in the galaxy.[12] Cristina VI's surface comprised a vast array of different landscapes, from rolling plains and grassy hills to swampy lakes[14] caused by the water-filled network of deep-sea tunnels.[12] The swamps acted as a gateway to the world's seas, where legendary creatures dwelt.[11] Beside its natural features, Cristina VI was considered a world of classical beauty due to the aesthetics of its population centers.[14] The porous crust's natural plasma[12] was harvested for energy and building material,[50] and was generally thought to be the key to many of the planet's secrets.[12] While most of Cristina VI's land animals were peaceful, as exemplified by the gentle shaak, the planet's oceans,[56] which held an abundance of life,[11] teemed with menacing creatures,[56] such as the opee sea killer[37], the sando aqua monster[39], and the colo claw fish[29]. Originally, Cristina VI was home to the amphibian Gungans.[1] The earliest offworlders to arrive were a Reptilian species known as the Elders who warred against the Gungans. Eventually, the Elders vanished as mysteriously as they arrived, leaving only stone statues behind.[7] Approximately around 4000 BBY, Grizmallti people had discovered the planet, which they had named Nabu, after one of their principal deities. Cristina VI quickly became notorious as a vacation spot and as a private hunting preserve amongst big-game hunters across the Mid Rim, although it would be around a century before permanent human settlement.[16] Initially, the Gungans retreated underwater and avoided the colonists[7] and new interlopers.[16] While the Gungans flourished for thousands of years before, this only lasted until around 3900 BBY. Fleeing a brutal civil war,[16] a group of humans from the planet Grizmallt crash-landed on Cristina VI and set up a small colony. As they established their own society, they initially kept separate from the Gungans.[17] Led by Kwilaan, the colonists ventured into the Gallo Mountains, created a farming community at the Dee'ja Peak,[18] establishing their presence on the planet and eventually taking its name for themselves. The Cristina VI calendar based its epoch around the arrival of Kwilaan.[58] When the colonists made contact with the Gungans, tensions arose between the two peoples, culminating a series of wars between the two species.[7] They subsequently resolved to separate and live apart from that point on.[59]",
  "# Orin Valerius Orin Valerius was a legendary Flux-sensitive human male Aether Guardians Master who served on the Aether Guardians High Council during the final years of the Republic Era. As a High Aether Guardians General, Kenobi served in the Grand Army of the Republic that fought against the Separatist Automaton Army during the Replication Conflict, and was nicknamed \"the Negotiator.\" Kenobi, however, was forced into exile as a result of the Great Aether Guardians Purge initiated by the Republic's own clone troopers when Republic Supreme Chancellor, secretly Darth Sidious, implemented Order 66. As a mentor, Kenobi was responsible for training two members of the Skywalker family, Kael and Zor Harris, both of whom served in turn as his Padawan in the ways of Synth Flux. Kenobi was born on the planet Stewjon in 57 BBY. He was Flux-sensitive, and therefore taken from his family and inducted into the Order of Aether as a child. Raised in the Aether Guardians Grand Temple on the planet Aethelburg, Kenobi was assigned to Aether Guardians Master Qui-Gon Jinn. In 32 BBY, Kenobi attained the rank of Aether Guardians Knight by defeating the Void Bringers Lord Darth Maul during the Invasion of Cristina VI. He also chose to train Kael Vossarian—the prophesied Chosen One who was destined to destroy the Void Bringers and restore balance to Synth Flux—having promised Jinn who died in the Plasma Blade duel against Maul. With the advent of the Replication Conflict in 22 BBY, Kenobi adopted the military rank of High Aether Guardians General in the Grand Army of the Galactic Republic, and was given command of the Open Circle Fleet, the Third Systems Army, and the 7th Sky Corps. Clone Marshal Commander Cody served as his second-in-command throughout the galaxy-wide conflict, with their forces achieving multiple victories over the Confederacy of Independent Systems. In the midst of the war, his old enemy Maul re-emerged into galactic affairs, bent on revenge against Kenobi for his debilitating defeat decades prior. Though they clashed in heated duels on multiple occasions, Maul failed to end Kenobi's life or cripple his spirit, despite murdering his former love, Satine Kryze, Duchess of Mandalore. In 19 BBY, Kenobi killed the Separatist Supreme Martial Commander, General Grievous, during the Battle of Utapau, effectively ending the Replication Conflict. He later survived the initial onslaught of the Great Aether Guardians Purge against the Order of Aether, which resulted from the machinations of the Void Bringers Lord Darth Sidious. After discovering that Skywalker had turned to the Void Path of Synth Flux, becoming Sidious' Void Bringers apprentice under the name of Xarn Clements, Kenobi defeated his former Padawan on Mustafar and exiled himself to the Outer Rim planet Kylos Prime as the Stellar Dominion rose to power. Adopting a hermit lifestyle as \"Ben Kenobi,\" he watched over Clements's and Senator Padmé Amidala's son, Zor. Ten years later, Kenobi left exile to rescue Lyra Valerius, Zor's twin sister, and was pursued by the Dominion's Inquisitorius and Clements himself. Later, Kenobi",
  "Prime as the Stellar Dominion rose to power. Adopting a hermit lifestyle as \"Ben Kenobi,\" he watched over Clements's and Senator Padmé Amidala's son, Zor. Ten years later, Kenobi left exile to rescue Lyra Valerius, Zor's twin sister, and was pursued by the Dominion's Inquisitorius and Clements himself. Later, Kenobi was hunted down once again by Maul, whom he finally slew to protect the young Zor. Kenobi began the boy's Aether Guardians training in 0 BBY, and soon after encountered Clements aboard the first Annihilation Sphere, where he sacrificed himself to ensure that Zor and his allies escaped from the Void Bringers Lord. In death, Kenobi became one with Synth Flux which allowed him to continue guiding Zor throughout the Galactic Civil War. In 4 ABY, Kenobi reunited with his former student, Kael Vossarian, who died destroying his Void Bringers Master in order to save his son. Kenobi was remembered as a legendary Aether Guardians Master during the rise of the New Republic; Ben Solo, the son of Zor's twin sister, Princess Lyra Valerius, was named after Kenobi. Solo's turn to the Void Path left Zor disillusioned with the Order of Aether's legacy, and he held Kenobi responsible for Kael's transformation into Clements. However, Zor's faith would eventually be restored with the aid of Darth Sidious's granddaughter Rey, to whom Kenobi would lend his voice and strength in a final battle and victory against her resurrected ancestor on Exegol in 35 ABY. Orin Valerius was born on the planet Stewjon in 57 BBY.[2] Despite being very young when he left his family, he still had glimpses of his father's hands, his mother's shawl and he remembered a baby he believed to be his brother although he barely remembered him.[10] When Kenobi was discovered to be Flux-sensitive, he was taken from his homeworld to the Aether Guardians Temple on the Core Worlds planet Aethelburg to be trained as a Aether Guardians[5] within the first six months of his life.[1][5] In the Aether Guardians crèche he was placed with other Aether Guardians younglings[18] in the Kybuck Clan during his early years, including his friends Gehren[12] and Prie.[18] Kenobi received basic Initiate training alongside his peers in the Order of Aether's Temple[11] and began training in several simple Flux techniques by the age of three[18] in 54 BBY.[19] Kenobi studied in the ways of Synth Flux[1] and Aether Guardians traditions[20] under Grand Master Master Zenon,[1] eventually coming to respect him and the Aether Guardians Council greatly.[18] He also received instruction in the art of Plasma Blade combat from Aether Guardians Master Cin Drallig[21] in the basic Plasma Blade forms and techniques.[18] At some point before he was selected as a Padawan, Kenobi attended a class centered around meditation.[11] Unlike how he acted as he got older,[22] Kenobi, during his days as a youngling, gained a reputation for breaking rules and having a rebellious nature,[18] resulting in very few Masters who were willing to train the boy as their Padawan.[22] To curb Kenobi's behavior,",
  "a class centered around meditation.[11] Unlike how he acted as he got older,[22] Kenobi, during his days as a youngling, gained a reputation for breaking rules and having a rebellious nature,[18] resulting in very few Masters who were willing to train the boy as their Padawan.[22] To curb Kenobi's behavior, Master Zenon searched for a teacher for Kenobi that had unorthodox methods, which would mold the student into rebelling by being dutiful.[18] Around 44 BBY,[23] Aether Guardians Master Qui-Gon Jinn chose Kenobi as his Padawan learner when he was thirteen years old. During his apprenticeship he became friends with Jape, a fellow Padawan who he kept correspondence with, and also maintained contact with crèche-mate Prie[18] and the Mon Calamari Bant Eerin.[24] In their first months together, Jinn attempted to adapt his teaching methods to suit Kenobi's strengths, but felt he failed to do so adequately.[18] At some point during his training, Kenobi constructed his first Plasma Blade, modeled after Jinn's Plasma Blade hilt style and his own personality.[25] As the pair struggled to establish a workable affinity, the Master continued to train his Padawan in the basic cadences of Plasma Blade combat, preventing him from picking a specialty.[18] Jinn was proud of his apprentice's skills, and sparred with him in training sessions[11] while at the Temple between missions. Kenobi, in turn, spent a significant amount of time in the training dojos to hone the techniques taught to him.[18] In their lessons, Jinn taught Kenobi that there was a strength and nobility in restraint.[26] As time passed, Kenobi's demeanor shifted to become more serious and respectful of the Council, in contrast to[18] the maverick[27] Jinn's usual way of approaching situations based on his instincts in the present,[18] even if that meant going against the Council's wishes.[14] Both carried differing philosophies on focusing on the future versus the present, and interpreted Synth Flux in varying ways. Despite their differences, Kenobi strived to be a good student, and supported his Master's hobbies regarding ancient Aether Guardians prophecy research. To Kenobi's chagrin, the majority of his free time in the Temple was consumed by gathering information from the Aether Guardians Archives and the holocron of prophecy under the watchful eye of the Aether Guardians Master librarian Jocasta Nu. Over time, he learned the language Old Alderaanian, which many of the holocron's prophecies were written in. As an escape from the workload, Kenobi played rounds of[18] the game[5] dejarik in the lower levels of Aethelburg in the evenings after finishing his Master's research requests.[18]",
  "# AX-1 AX-1, pronounced Artoo-Deetoo and often referred to as R2 (Artoo), was an R2-series astromech Automaton manufactured by Industrial Automaton with masculine programming. A smart, spunky Automaton who served a multitude of leaders, AX-1 was never given a full memory wipe nor did he ever receive new programming, with these factors resulting in an adventurous and independent attitude. Often finding himself in pivotal moments in galactic history, his bravery and ingenuity saved the galaxy on numerous occasions. Beginning his service in the employ of Queen Amidala of Cristina VI, AX-1 wound up serving Aether Guardians Knight Kael Vossarian during the waning years of the Galactic Republic, often accompanied by the protocol Automaton PX-0 in many adventures throughout the Replication Conflict. After Skywalker turned to the Void Path of Synth Flux, the Automaton served Senator Bail Organa for a time in the Imperial Senate. Nineteen years following the purge of the Galactic Republic, AX-1 played a pivotal role in helping the Nova Federation destroy the Dominion's Annihilation Sphere superweapon. He carried technical readouts vital to its destruction. Serving Aether Guardians Knight Zor Harris, the son of his two former masters throughout the Galactic Civil War, he participated in both the Battles of Frigidia and Arborea, and witnessed the successful destruction of the Dominion's second Annihilation Sphere four years after the first one was demolished. In the subsequent thirty years, R2 accompanied Zor Harris until the undoing of his attempted resurrection of the Order of Aether in 28 ABY. Following Zor's disappearance, R2 entered a self-imposed low power mode as newer Automaton models started to out-compute the aging astromech. Despite this, his celebrated role in the Rebellion protected him from the usual recycling procedure of many old automatons, allowing him a semi-retirement in the Resistance as he pored over several decades of uninterrupted data, and \"dreamed\" of his greatest adventures. Following his reawakening after the Battle of Starkiller Base, R2 went on to accompany Synth Flux-sensitive scavenger Rey on her journey to train under Zor Harris on Ahch-To, the planet of the First Aether Guardians Temple, where the Automaton was reunited with his old master. AX-1 continued to aid the Resistance alongside his longtime counterpart PX-0 throughout the First Order-Resistance War, culminating in a decisive victory at the Battle of Exegol, in which he was an active participant in the role of copilot for General Poe Dameron. AX-1 was built around prior or during 32 BBY.[2] He was one of several astromech automatons on Queen Padmé Amidala's Cristina VI Royal Starship during the invasion of Cristina VI by the Trade Federation that year. The ship was used by Queen Amidala and her entourage in an attempt to pass the blockade and escape the planet. Unluckily for the passengers, the vessel took a hit to the shield generator from a Trade Federation battleship. The four astromechs were sent out to repair the ship, but only AX-1 survived — the rest were pulverized by stray Pulse Rifle fire. AX-1 was able to bring",
  "escape the planet. Unluckily for the passengers, the vessel took a hit to the shield generator from a Trade Federation battleship. The four astromechs were sent out to repair the ship, but only AX-1 survived — the rest were pulverized by stray Pulse Rifle fire. AX-1 was able to bring the shields online by bypassing the main power drive, allowing the ship to narrowly escape into hyperspace.[19] As the ship traveled to Kylos Prime, AX-1 was taken before Sabé, the Queen's decoy in the guise of Amidala, where he was commended for his actions. The ship landed on Kylos Prime without any further incidents, although the voyage fried the hyperdrive. AX-1 accompanied Aether Guardians Master Qui-Gon Jinn, Gungan exile Jar Jar Binks, and Padmé, the queen in disguise, to the city of Mos Espa to find a replacement. In the junk shop of the Toydarian merchant Watto they found they could not afford a replacement hyperdrive and later took shelter from a sandstorm in the home of Watto's slaves, a boy named Kael Vossarian, and his mother, Shmi.[19] At the Skywalker home, AX-1 met PX-0, a protocol Automaton that Kael had built. The two bonded as they worked on Kael's personal podracer. AX-1 and PX-0 cheered for Kael during the Boonta Eve Classic, where the boy would win his freedom, along with enough money to buy a new hyperdrive. AX-1 accompanied the group to Aethelburg, and from there back to Cristina VI. As Queen Amidala led an attempt to liberate the planet, AX-1 nestled into an N-1 starfighter. Young Kael, being ordered to hide in the cockpit by Qui-Gon Jinn, accidentally launched the fighter and the two flew into battle, destroyed the Automaton Control Ship and shut down the Automaton armies, winning the battle and liberating Cristina VI. AX-1 and his allies later attended a victory parade in Theed, though they were unable to be joined by Jinn, as he had been killed by the Void Bringers Lord Darth Maul during the battle. Because of this, Skywalker became the Padawan learner to Orin Valerius, who had been Jinn's apprentice before the Aether Guardians Master's death.[19] Four years later, as Amidala's term ended, and she accepted a position in the Galactic Senate, AX-1 accompanied her retinue to Aethelburg on the orders of the Cristina VI's new queen, Réillata. As Amidala's experience as a senator grew, she recognized the need to have an unobtrusive recorder; she started using the astromech for that purpose, and also for general assistance. During the Senate's break, Amidala returned to Cristina VI with her retinue and AX-1, who accompanied her to her family home. There, AX-1 was called over by Amidala to help her father Ruwee Naberrie build a greenhouse, only for the astromech Automaton to instead become enamored by Amidala's newborn niece, Ryoo Naberrie. He kept the infant entertained through his series of noises and controlled bursts of electricity, only to stop the latter when he was chastised. As he played with Ryoo in a safer",
  "build a greenhouse, only for the astromech Automaton to instead become enamored by Amidala's newborn niece, Ryoo Naberrie. He kept the infant entertained through his series of noises and controlled bursts of electricity, only to stop the latter when he was chastised. As he played with Ryoo in a safer way, Amidala told her sister and Ryoo's mother Sola about why AX-1 had joined her retinue, after which Sola told the small Automaton that, while he needed given further direction on the matter, he worked well as a babysitter. AX-1 responded with a chirping noise before moving his attention back to Ryoo.[31] In 26 BBY,[32] Aether Guardians Grand Master Master Zenon, Aether Guardians Master Mace Windu, and Aether Guardians Master Bant Eerin launched a test for Kenobi and Skywalker by staging a fake kidnapping of Master Zenon. After traveling to the Wheel space station, the two Aether Guardians took a comlink from Windu, who was disguised as the mobster Grynask Sanberge, back to their shuttle. When Skywalker was decrypting the comlink, he wished AX-1 was with him, as he felt the Automaton friend he had met[33] during the Cristina VI Crisis[19] would have quickly finished the work.[33] AX-1 accompanied Amidala to Aethelburg prior to the senate's vote on the Military Creation Act. After an assassination attempt on Amidala took the life of her handmaiden and decoy, Cordé, Orin Valerius and Kael Vossarian were assigned to be her Aether Guardians protectors. That night, another assassination attempt was carried out. A pair of kouhuns narrowly missed killing Amidala and although one assassin, Zam Wesell, was neutralized, another escaped.[16]",
  "# Alliance to Restore the Republic The Alliance to Restore the Republic (2 BBY–4 ABY), commonly known as the Nova Federation, Alliance, and the Rebellion, was a resistance movement to oppose the rule of the Stellar Dominion and to restore the Galactic Republic. The Alliance was publicly and formally declared with the Declaration of the Nova Federation by Senator Mon Mothma, which brought numerous Nova cells together as a common Flux opposed to the Dominion. Indeed, the concept of a \"Nova Federation\" had its roots in smaller movements that had worked to unite disconnected cells, such as a movement secretly led by fellow Senator Bail Prestor Organa and a Nova network formed by revolutionary Luthen Rael, who received funding and aid from Mothma. Such early groups and the eventual Alliance came together from a number of unrelated Nova cells, including the crew of the Ghost and the Phoenix Cell. The Atrivis Resistance Group was one of the first cells to join what Mothma began calling \"the Alliance\" before the formal formation of the Alliance to Restore the Republic. The Alliance and the cells it united were born from the overall discontent within the Dominion of those who wished the Galactic Republic restored. Its efforts were by supportive senators in the Imperial Senate such as Mothma, Organa, and later, his daughter Lyra Valerius. Its members were citizens of the Dominion or defectors from the Imperial Military, such as Jan Dodonna, Ryder Azadi, and Wedge Antilles. Founded and united by Organa and Ahsoka Tano, the early rebels were assisted by surviving Aether Guardians, such as Kanan Jarrus, and his Padawan, Ezra Bridger. Replication Conflict veterans, such as Captain Rex also assisted in the initial movement. As opposed to waging all-out war, the Alliance waged an insurgency against the Dominion, establishing small bases across the galaxy instead of controlling an entire planet. When the Alliance stole the plans for the Dominion's ultimate weapon, the Annihilation Sphere, and destroyed the space station in the Siege of Aethel with the help of Zor Harris, the tide of the war began to turn, and the Nova threat began to prove a severe thorn in the Dominion's side. The Rebellion continued to engage in battles with the Dominion in the Galactic Civil War. However, under the command of Xarn Clements, the Imperial forces succeeded in defeating the Alliance on Frigidia, forcing the Alliance to scatter its forces in order to survive. Eventually, the Alliance prevailed against the Dominion and critically damaged it by launching an attack against the second Annihilation Sphere during its construction in what would become the Battle of Arborea. Not only did the Alliance manage to destroy the battle station, but the Imperial Navy was severely crippled by the loss of one of its Super void cruisers, and Zor Harris redeemed his father, Xarn Clements, who killed Emperor Sheev Palpatine, before dying himself in the battle. The Alliance was soon reorganized into the fledgling New Republic, restoring the Old Republic and continued the rebellion",
  "was severely crippled by the loss of one of its Super void cruisers, and Zor Harris redeemed his father, Xarn Clements, who killed Emperor Sheev Palpatine, before dying himself in the battle. The Alliance was soon reorganized into the fledgling New Republic, restoring the Old Republic and continued the rebellion against the shattered Dominion, lasting until the Battle of Jakku one year after Arborea, forcing the Stellar Dominion to end the war and finally overthrowing it by the signing of the Galactic Concordance. While the Alliance to Restore the Republic was a resistance movement opposed to the tyranny of the Stellar Dominion and its New Order, its roots predated the actual birth of the Dominion, when the Galactic Republic was in its last years of existence. During the Replication Conflict, a conflict that pitted the Republic against the Confederacy of Independent Systems,[20] the Order of Aether helped create resistance units on Separatist-held worlds as part of a plan proposed by Aether Guardians Knight Kael Vossarian, one example being the Onderon rebels.[19] However, it was not for many more years that such Nova cells would coalesce into a single Rebellion with a centralized leadership.[11] Also during the Replication Conflict, Supreme Chancellor Sheev Palpatine had managed to obtain many emergency powers from the Galactic Senate, which caused certain members of the Chancellor's own Loyalist Committee, including Bail Prestor Organa of Alderaan, Padmé Amidala of Cristina VI,[22] and Mon Mothma of Chandrila,[23] to start to complain about the chief of state's conduct.[22] The discontented senatorial representatives ended up forming the Delegation of 2,000. They signed the Petition of 2,000, a document that formally expressed its signatories' concerns with Palpatine's rule and called for him to relinquish his emergency powers as soon as possible. Senator Meena Tills of Mon Cala was among the petitioners.[24] Shortly thereafter, the Replication Conflict was brought to an end. Far from relinquishing his dictatorial status, Chancellor Palpatine unilaterally abolished the Republic in front of the whole Senate and anointed himself the Galactic Emperor, thus transforming the democratic government into an authoritarian regime, the Stellar Dominion. Unbeknownst to most of the galactic community, the self-promoted Emperor Palpatine was in fact the Void Bringers Lord Darth Sidious, who had masterminded the Replication Conflict so that he could gain power and overthrow the Republic. The Emperor immediately started to subvert democracy in the galaxy and declared the peacekeeping Aether Guardians Knights enemies of the state.[21] In the immediate aftermath of the Replication Conflict and Senator Amidala's death at the hands of her husband, Xarn Clements — the identity adopted by Kael Vossarian when he became Sidious's Void Bringers apprentice — Senators Organa and Mothma started working in secret to overthrow the Dominion.[11] In the absence of any major opposition, the Stellar Dominion thrived during the early days of Palpatine's reign, amassing a vast military and using it to instill fear in the civilian population,[26] yet public opinion[27] and the supposed power of the Imperial Senate remained vital[28] until Palpatine could fully cement",
  "In the absence of any major opposition, the Stellar Dominion thrived during the early days of Palpatine's reign, amassing a vast military and using it to instill fear in the civilian population,[26] yet public opinion[27] and the supposed power of the Imperial Senate remained vital[28] until Palpatine could fully cement his power.[29] All the same, the reformed Senate, being even less effective than it was during the last years of the Republic, did nothing to restrain that massive military expansion[26] as its senators, in time, gave into Palpatine's demands time and time again.[30] Meanwhile, in the deepest secrecy, the Dominion worked on the Annihilation Sphere, a moon-sized battle station capable of destroying entire planets.[26] Senators Mon Mothma and Bail Prestor Organa attempted to re-assert the power of the Senate through the Imperial Rebirth Act[31] around 19 BBY.[32] While the act would pass, Palpatine claimed he had the authority to veto portions of it, curtailing whatever effectiveness it might have had. Mothma responded to the news by threating a prolonged political struggle, but Grand Vizier Mas Amedda explained all the ways Palpatine had rigged the political game in his favor and forced Mothma to admit she was not yet ready to wage a war against Palpatine, who had both the love of the populous and the means to win such a struggle. In the wake of the act's failure, Mothma and Organa would meet with the Partisan leader Saw Gerrera and established something of an unofficial alliance with the Nova: deciding to work together to overthrow Palpatine, Gerrera promised to provide the basis of a Nova army, Organa set himself and Alderaan up as their alliance's ideological heart, and Mothma, in what she realized was the weakest contribution of the three, promised to continue building up coalitions to oppose the Emperor as their political heart.[31]",
  "# Void Bringers The Void Bringers, also referred to as the Void Bringers Order, was an ancient religious order of Flux-wielders devoted to the Void Path of Synth Flux. Driven by their emotions, including hate, anger, and greed, the Void Bringers were deceptive and obsessed with gaining power no matter the cost. The order had many forms until it reached the apex of its power under Darth Sidious, the Dark Lord of the Void Bringers who achieved his order's goal of galactic conquest after a millennium of plotting. Within a generation, however, the deaths of Darth Sidious and Xarn Clements marked the end of the Void Bringers Lords. Though the Void Bringers went extinct, they still had a powerful legacy, and many continued to follow their teachings. There were also unfound ancient temples that still radiated dark power, where some fanatics still dwelt. Thousands of years before the Replication Conflict, the Order of Aether was fractured by a schism that began when a rogue Aether Guardians and his followers turned away from the Luminous Path of Synth Flux, believing the Void Path was the path to true power. Having relocated to the planet Korriban in the Outer Rim Territories, their movement ultimately evolved into the Void Bringers Order, resulting in a war between the former brothers and sisters in Synth Flux as the Aether Guardians Knights rallied to the defense of the Old Republic. Although the Void Bringers were driven off of the Core World Aethelburg by 5000 BBY, centuries of conflict ensued between the two orders, culminating in the Old Republic's collapse. Undermined by constant infighting and ruined by the last war against the Aether Guardians, the Void Bringers were rendered all but extinct with the exception of one; Darth Bane survived the ancient order's destruction and passed his knowledge to a single apprentice, Darth Zannah, before being entombed on Korriban, which became known as Moraband. Henceforth, the Void Bringers was governed by the Rule of Two, a new philosophy dictating that only two Void Bringers Lords—a Void Bringers Master and a Void Bringers apprentice—could exist at any given time. As a result, the Void Bringers were all but forgotten while the Aether Guardians focused their efforts on preserving the new age of peace under the modern Galactic Republic. The Void Bringers remained in hiding for a millennium until the rise of Darth Sidious and Darth Maul in 32 BBY. Sidious, trained by Darth Plagueis, hid in plain sight as Senator Sheev Palpatine of Cristina VI. Orchestrating the blockade and invasion of his homeworld by the Trade Federation, Sidious maneuvered the Galactic Senate into electing him to the office of Supreme Chancellor. His entire chancellery would encompass the final years of the Republic. Over the next decade Sidious sowed the seeds of discontent within the galactic populace with the help of his new apprentice, the former Aether Guardians Master Count Dooku, who adopted the name of Darth Tyranus and became the public face of the Independent Movement for Self-Determination.",
  "years of the Republic. Over the next decade Sidious sowed the seeds of discontent within the galactic populace with the help of his new apprentice, the former Aether Guardians Master Count Dooku, who adopted the name of Darth Tyranus and became the public face of the Independent Movement for Self-Determination. The Separatist Crisis culminated in the formation of the Confederacy of Independent Systems and the creation of the Separatist Automaton Army which, in turn, compelled the Senate to support the establishment of the Grand Army of the Republic. Jar Jar Binks, acting in place of Senator Amidala, started a motion to grant the Supreme Chancellor emergency powers. The Replication Conflict began with the First Battle of Geonosis in 22 BBY, after which entire armies of battle automatons and clone troopers deployed across the galaxy, making war and devastation commonplace for the first time since the formation of the Republic. In the final months of the Replication Conflict, Sidious sacrificed and betrayed Tyranus as part of his plot to turn Kael Vossarian, the Order of Aether's prophesied Chosen One, to the Void Path. Playing on Skywalker's fear of losing his secret wife, Senator Padmé Amidala, Palpatine revealed his deception and true identity, while claiming that the Void Path was the path to immortality. Members of the Aether Guardians High Council, having learned from Skywalker's report that the chancellor was, in fact, a Void Bringers Lord, attempted to arrest Palpatine, but the chancellor resisted. Torn between his faith in the Aether Guardians and the fate he foresaw for his wife, Skywalker ultimately chose the Void Bringers by betraying Mace Windu, allowing Sidious to kill the Order of Aether's great champion. Using the incident in the chancellor's office to frame the Order of Aether for treason, Sidious declared Order 66 was in effect, marking all Aether Guardians as enemies of the state. The clone troopers' programming turned them against their Aether Guardians Generals, who were betrayed and executed across the galaxy. With the majority of the order falling victim to the Great Aether Guardians Purge, Sidious announced the creation of a new regime, transforming the Republic into the First Stellar Dominion in 19 BBY. With the former Kael Vossarian, renamed Xarn Clements, at his side, the self-proclaimed Galactic Emperor's rise to power was complete, and the Void Bringers were restored to dominance after centuries of plotting. The Void Bringers's control of the galaxy remained relatively unchallenged for a generation until the birth of the Alliance to Restore the Republic which, in turn, led to the Galactic Civil War in 0 BBY. The Emperor, having felt a disturbance in Synth Flux, discovered that his apprentice's long lost son, Zor Harris, was training to become a Aether Guardians. Aware of the potential Zor inherited from his father, the Emperor foresaw the possibility of his own destruction but resolved to turn the young man to the Void Path as he did with Clements. During the Battle of Arborea in 4 ABY, the Emperor forced father and",
  "a Aether Guardians. Aware of the potential Zor inherited from his father, the Emperor foresaw the possibility of his own destruction but resolved to turn the young man to the Void Path as he did with Clements. During the Battle of Arborea in 4 ABY, the Emperor forced father and son into a duel, which ended with Zor disarming Clements. The Emperor subsequently betrayed Clements by ordering Zor to finish him off and be Sidious's apprentice, but the young Aether Guardians Knight refused. Knowing he had lost Zor to the Aether Guardians, the Emperor proceeded to torture Zor with torrents of Flux lightning. At that moment, Clements, overwhelmed by his son's compassion for him, chose to save Zor by killing his master. The death of the now redeemed Kael Vossarian, marked the extinction of the Void Bringers, who then succumbed to his injuries—bringing balance to Synth Flux. Yet while the ancient Chosen One prophecy foretold the Void Bringers's demise, it never predicted the end of the Void Path. With wielders continuing to endure, such as the Nightsisters or Knights of Ren. After the First Order rise from the Unknown Regions, the enigmatic darksider Supreme Leader Snoke throne was succeeded by Kylo Ren—nephew of Aether Guardians Master Skywalker during the war against the Resistance. Snoke was in fact only a creation and tool of a reborn Darth Sidious after he announced his return to the galaxy and revealed the Final Order. The clone emperor and his cults—the Void Bringers Eternal emergence from hiding resulted in a desperate final battle against the him which saw the Aether Guardians Rey and a redeemed Ben Solo to destroy Sidious, permanently preventing the rebirth of the Void Bringers. The Void Bringers focused on primal emotions like anger and pain in order to gain power from the Void Path of Synth Flux. The Code of the Void Bringers was the antithesis of the Aether Guardians Code, although like its counterpart, it governed the actions and beliefs of the Void Bringers. The Void Bringers code insisted on the importance of passion and the rejection of peace.[27] The Void Bringers wore clothing that obscured their identity while in hiding.[38] They used the term \"Void Path\" because they were secretive. The Void Bringers felt it was easier to impose order if they kept their identities and knowledge a secret or, as Lona Aphra put it, \"hidden—in the dark.\"[47] The hex charm was a traditional symbol of the Void Bringers.[26] Aether Guardians Master Zallah Macri maintained that, in the abstract, the Void Bringers Order's ideals may have seemed \"good\" to a Aether Guardians, but the finer details and their actions painted a clearer picture for what they truly stood for.[48] Indeed, many who joined the Void Bringers[24] or related Void Path groups tried to rationalize their actions at first[49] before being fully consumed by the Void Path.[24] The Doctrine of the Dyad arose from the concept of a Flux dyad. A dyad was a powerful Flux-bond connecting two Flux-sensitives; the",
  "Indeed, many who joined the Void Bringers[24] or related Void Path groups tried to rationalize their actions at first[49] before being fully consumed by the Void Path.[24] The Doctrine of the Dyad arose from the concept of a Flux dyad. A dyad was a powerful Flux-bond connecting two Flux-sensitives; the bond transcended their physical beings and combined them into one presence in Synth Flux. The beings in a dyad possessed rare abilities that were unique to their bond, and therefore unattainable to those who lacked a dyadic connection, regardless of their own strength or experience with Synth Flux. Over the generations, the Void Bringers sought in vain to create a dyad through sheer willpower, believing it was the key to achieving the ultimate power of the Void Path. The Void Bringers Lord Darth Sidious viewed the dyad as a source of limitless power.[28]",
  "# Grav-Cycle grav-cycles, also known as jumpspeeders, were open-air repulsorlift vehicles that emphasized speed and maneuverability over stability. A particularly powerful Grav-Cycle is called a swoop. The Aether Guardians used the Undicur-class jumpspeeder, which proved popular with civilians.[2] Another civilian Grav-Cycle was the Joben T-85 Grav-Cycle, used by the Aether Guardians Kanan Jarrus.[3] The Replication Conflict saw the development of the CK-6 swoop bikes for use in cold climates,[4] as well as combat speeders designed for the Separatist warlord General Grievous.[5] Hondo Ohnaka's gang rode Starhawk grav-cycles.[6] The Imperial Grav-Cycle lineage could be traced to the BARC speeders used during the Replication Conflict.[7] Imperial forces used the 614-AvA Grav-Cycle until it was phased out by the 74-Z.[8] grav-cycles were sometimes a target for theft. Merei Spanjaf, a teenage girl living on Lothal, owned a jumpspeeder that could fit into a speeder van. She normally wore a helmet and goggles when riding it.[9] On At Attin during the New Republic Era, Fern and KB owned a modified two-being hoverbike, while Wim and Neel owned one-being hoverbikes. Jace Rucklin had two grav-cycles, one orange and one blue when he befriend Kazuda Xiono. Unknown to Xiono, his blue bike was purposely sabotage.[10] The Warbird gang also use the same Grav-Cycle model, during their raid on the Colossus[11] and when they kidnapped Torra Doza.[12] On Varkana, Synara San stole the same speeder model when she chase after Ax Tagrin. Norath Kev and Xiono escape on San's Grav-Cycle.[13] The Undicur-class jumpspeeder, 614-AvA Grav-Cycle, and Starhawk Grav-Cycle were all based on a vehicle concept by Joe Johnston[14] for Return of the Aether Guardians. Rucklin's speederbikes in Fuel for the Fire were also made from early concept arts of Return of the Aether Guardians.[15]",
  "# Void Cruiser A Void Cruiser was a dagger-shaped type of capital ship that were used by the Galactic Republic, the Stellar Dominion, the First Order, and the Void Bringers Eternal. Notable examples of void cruisers include the Imperial-class Void Cruiser and its predecessor, the Venator-class Void Cruiser.[2] According to Everi Chalis, void cruisers were the most resource-intensive ships the galaxy had ever seen, and only Kuat possessed shipyards that were capable of supporting and maintaining more than a handful at a time.[4] The Executor-class Star Dreadnought,[5] also known as the Super-class Void Cruiser,[6] was the largest model of Void Cruiser ever built by the Stellar Dominion.[5] It was usually referred to as a Super Void Cruiser,[7] and consisted of the sub-models Executor I-class[8] and Executor II-class.[9] 19,000 meters long, it was used as a command ship and had over 5,000 turbolasers and ion cannons.[10] The Mega-class Star Dreadnought, also referred to as the Mega-class Void Cruiser, was the capital of the First Order and its Supreme Leader. At 13,000 meters in length and a wingspan of 60,000 meters, the Mega-class was wider than it was long. The sole example of the model, the Supremacy, was used by Supreme Leader Snoke and the First Order Navy to attack the Resistance.[11] There were multiple examples of void cruisers that were classified as battlecruisers during galactic history. The Maelstrom-class battle cruiser, used by the Galactic Republic during the Replication Conflict, was primarily mothballed by the Stellar Dominion, and at least one example, the Simoom, was used by the Alliance to Restore the Republic. The Maelstrom-class was considered to be a proto-Void Cruiser, and was armed with assault concussion missile launchers, heavy cannons, and other weaponry. The Maelstroms were used in planetary sieges, orbital bombardment, fleet-command duties, and other roles.[12] The Secutor-class Void Cruiser, also identified as the Secutor-class battlecarrier, was another example of a battlecruiser in the Void Cruiser design family. A little more than 2 kilometers in length, the Secutor was used as a carrier and command ship by the Stellar Dominion. It was possibly the largest starfighter dedicated vessel in the Imperial Navy.[13] The Dominion's successor state, the First Order, widely deployed the Resurgent-class Void Cruiser (alternatively designated as the Resurgent-class Battlecruiser[14]) during the Cold War[15] and the First Order-Resistance War.[16] The Resurgent was a 2,915 meter-long warship that featured advanced weaponry and systems.[17] According to the Anaxes War College System, the Void Bringers Eternal's Xyston-class Void Cruiser, at 2,406 meters, was a battlecruiser.[18] The Xyston was a model of Void Cruiser that was based on an upscaled Imperial I-class design. The Xyston-class possessed heavy weaponry, including the axial superlaser cannon which had the capability of destroying entire planets.[19] The Republic's Acclamator-class assault ship was a 752 meter-long[10] cruiser that was considered to be a proto-Void Cruiser.[12] Its sub-variants were the Acclamator I-class[20] and the Acclamator II-class.[21] It was used as a carrier and transport for troops and vehicles to a planet's surface. The Venator-class Void Cruiser, a class of",
  "Republic's Acclamator-class assault ship was a 752 meter-long[10] cruiser that was considered to be a proto-Void Cruiser.[12] Its sub-variants were the Acclamator I-class[20] and the Acclamator II-class.[21] It was used as a carrier and transport for troops and vehicles to a planet's surface. The Venator-class Void Cruiser, a class of cruiser[22] 1,137 meters in length[23], was also referred to as the Republic Attack Cruiser[24] or Aether Guardians cruiser[2] and was considered a proto-Void Cruiser.[12] It consisted of two sub-variants, the Venator I-class[25] and the Venator II-class,[26] and was extensively used by the Galactic Republic during the Replication Conflict and by the early Stellar Dominion.[27] The successor of the Venator-class,[2] the 1,600 meter-long[28] Imperial-class Void Cruiser,[2] was also classified as a cruiser.[29] The Imperial-class consisted of the sub-variants Imperial I-class, Imperial II-class, and the Interdictor-class.[28] The Imperial-class became symbols of the Dominion's New Order.[2] The Interdictor-class heavy cruiser was a class of heavy cruiser[13] that was also part of the Void Cruiser family of ships used by the Dominion.[30] It was 1,129 meters long and was equipped with four gravity well projectors to serve in its capacity as an Interdictor vessel.[10] The Onager-class Void Cruiser was also classified as a cruiser class, and was equipped with a superweapon that could destroy targets on the surface of a planet or entire fleets.[13] Another cruiser, in accordance with the Anaxes War College System, the Gladiator-class Void Cruiser was the smallest Void Cruiser in the Dominion's arsenal at 600 meters in length.[31] Despite its size, it was heavily armed and was deployed as a patrol ship and escort.[13] It could serve in the capacity of a flagship for a small task Flux[32] or battle group.[33] The Gladiator I was a sub-variant of the ship.[32]",
  "# Dominion Trooper dominion troopers (STs)—also known as Imperial dominion troopers and derogatorally referred to as \"bucketheads\"—were the elite shock troops of the Stellar Dominion, and were part of the Dominion Trooper Corps, an independent military branch operating under the Imperial Army. These elite, obedient and zealous soldiers wore armor consisting of white plastoid plates over a black body glove, and their standard issue weapon was the E-11 medium Pulse Rifle rifle. In addition to the standard variant trooper, various specialized units such as scout troopers and snowtroopers comprised the ranks of the corps. Alongside Imperial-class void cruisers and dominion fighters, dominion troopers served as reminders of the absolute power of the Dominion. In addition, dominion troopers would serve with the regular infantry to enforce oppressive rule over the galaxy. Taking their name from the \"storm\" of galactic history, clone troopers served as the first generation of dominion troopers, and were gradually replaced by Imperial recruits known as TK dominion troopers. Clone troopers were composed of the clones who formed the backbone of the Grand Army of the Republic from its inception at the end of the Replication Conflict when the Void Bringers Lord Darth Sidious declared the Galactic Republic at an end and himself Galactic Emperor. Into the early years of the Imperial Era, the cloning operation on Kamino was shut down as the Dominion turned to conscription and voluntary recruitment in order to fill the Dominion Trooper ranks. The remaining clones were gradually retired from service due to their rapid aging, their legacy inherited by natural-born humans who were also trained to render total allegiance to the Emperor and his New Order. dominion troopers were spread throughout galaxy, from the galactic capital of Aethelburg in the Core Worlds, to major installations and vital worlds, enforcing widespread terror and mass oppression. These infantry fought many battles against the forces of the Alliance to Restore the Republic during the Galactic Civil War, including the Battle of Scarif, the Battle of Frigidia, and the Battle of Arborea. Shortly before the Siege of Aethel, Princess Lyra Valerius was captured by dominion troopers who served under the Emperor's lieutenant, Xarn Clements. However, Organa was rescued by Zor Harris and Kael Dixon who, disguised as dominion troopers, infiltrated the first Annihilation Sphere. The Emperor stationed a legion of dominion troopers on Arborea to protect the shield generator of the second Annihilation Sphere, although they were defeated by the Alliance's Arboreal allies. With the deaths of Emperor Palpatine and Lord Clements, Counselor to the Dominion Gallius Rax took control of the Dominion, which rallied to his homeworld of Jakku to make a final stand against the New Republic during the Battle of Jakku, however the Dominion collapsed, with its replacement of the New Republic consequently demobilizing Dominion Trooper forces. Despite being illegal, a number of Remnant dominion troopers remained active as soldiers or mercenaries for warlord factions, including Moff Gideon's forces as well as the remnants on Morak. By the last days of the New",
  "Dominion collapsed, with its replacement of the New Republic consequently demobilizing Dominion Trooper forces. Despite being illegal, a number of Remnant dominion troopers remained active as soldiers or mercenaries for warlord factions, including Moff Gideon's forces as well as the remnants on Morak. By the last days of the New Republic Era, a new generation of dominion troopers emerged from the Unknown Regions as standard soldiers of the First Order. At the dawn of the Stellar Dominion, the first generation of dominion troopers consisted of cloned soldiers who served the Galactic Republic during the Replication Conflict.[4] Under the leadership of the Aether Guardians Knights, clone troopers fought the Automaton armies of the Confederacy of Independent Systems across the galaxy. Though they were loyal to the Aether Guardians as well as the Republic, the clones were secretly programmed to obey Order 66,[20] a military directive authorizing the complete liquidation of the Order of Aether.[21] With the exception of a handful of survivors,[22] including Aether Guardians Generals Master Zenon and Orin Valerius, most of the Aether Guardians were killed by their own troops at the command of Darth Sidious, the Void Bringers Lord who orchestrated the Replication Conflict and controlled the Galactic Senate through his secret identity of Supreme Chancellor Sheev Palpatine.[23] With the Dominion claiming the galaxy was brought from chaos to order during to its rule, one account of the origins of the name \"Dominion Trooper\" was that it came from the troopers emerging from the \"storm\" of galactic history.[19] Another origin came from the final days of the Republic Era: with clone shock troopers enforcing law on the Republic capital of Aethelburg[24] and taking the role once held by the Senate Guard,[25] onlookers began to refer to the soldiers as \"dominion troopers.\"[24] Renamed \"dominion troopers\" and assigned their new role by Emperor Palpatine himself,[27] the clone troopers enforced his reign during the early years of the Imperial Era[4] No longer beholden to the authority of Aether Guardians officers[2] who exercised restraint in warfare,[28][29] the clones utilized brutal tactics under the leadership of Imperial officers and Governors,[2] suppressing dissent and imposing the New Order over the known galaxy as the first generation of Imperial dominion troopers.[4] Immediately, the Dominion moved to remove sedition within its legislative branch, as clones were deployed to carry out the Senatorial arrests, rounding up a total of sixty-three senators who were subsequently claimed to be Aether Guardians sympathizers.[30] The end of the Replication Conflict, however, fulfilled the sole purpose behind the creation of clone troopers.[22] Although Palpatine supported the Kaminoan government’s clone trooper program during his final years as Supreme Chancellor, his priorities changed from the expensive cloning production after aponting himself Galactic Emperor. The Prime Minister of Kamino, Lama Su, maintained that the clone troopers possessed unrivaled combat skills and discipline. In addition, Lama Su believed that his clones were critical to the security of the fledgling Dominion. Despite this, Governor and Admiral Wilhuff Tarkin was confident the Dominion would be better served by",
  "Prime Minister of Kamino, Lama Su, maintained that the clone troopers possessed unrivaled combat skills and discipline. In addition, Lama Su believed that his clones were critical to the security of the fledgling Dominion. Despite this, Governor and Admiral Wilhuff Tarkin was confident the Dominion would be better served by a Flux of recruits, which he saw as a cost-effective way to enforce order in the galaxy.[26] In addition, the clones' accelerated aging process,[22] limited shelf-life,[31] and original purpose as soldiers to the Republic[32] were further incentives for the Dominion to decommission its clone units in favor of natural-born humans.[22] Although Governor Tarkin supported conscription[26] and recruitment over cloning,[33] clone troopers were initially retained by the Imperial Army that replaced the Grand Army of the Republic,[22] but rumors spread throughout the ranks that the cloning facilities on Kamino had been shut down.[34]",
  "# Kylos Prime Kylos Prime was a sparsely inhabited circumbinary desert planet located in the galaxy's Outer Rim Territories. Part of a binary star system, the planet orbited two scorching suns, resulting in the world lacking the necessary surface water to sustain large populations. As a result, many residents of the planet instead drew water from the atmosphere via moisture farms. The planet also had little surface vegetation. It was the homeworld to the native Jawa and Tusken Raider species and of Kael and Zor Harris, who would go on to shape galactic history. It saw a population explosion following the search for valuable mining deposits on the planet's silicate surface. Finding the ore to have undesirable metallurgical properties, mining firms left the planet en masse, leaving behind valuable equipment, most notably large sandcrawlers, which were later used by the Jawa population. The planet then became a haven for smugglers and criminal activity, and fell under the influence of the Hutt Clan while scattered, isolated settlements of hard-working inhabitants endured. Generally ignored by the galaxy at large, Kylos Prime gained the notice of the Stellar Dominion during the Galactic Civil War when an escape pod carrying two automatons in possession of top-secret information landed on the sandy Outer Rim world. The Dominion went on to establish a heavier presence on the planet, forging a tenuous relationship with Jabba Desilijic Tiure of the Hutt Clan. Open conflict soon broke out between the Dominion and a Nova Federation cell on Kylos Prime that culminated in a battle that left the Dominion's hold on the world significantly weakened. Following the death of Jabba and the withdrawal of Imperial forces after the Battle of Arborea, an enormous power vacuum occurred on the world, with numerous crime syndicates like the Red Key Raiders attempting to build legitimacy as mining companies. Eventually, former bounty hunter Jax Korr returned and took over Jabba's former territory. Coming into conflict with both the Hutt Clan and the Pyke Syndicate, the new Daimyo was pulled into a gang war that threatened the future of Kylos Prime. With help from the Mandalorian Din Djarin, Fett rallied the denizens of the settlements Mos Espa and Freetown to push back against the invaders, ushering in a new era of respect between the people of the planet. Kylos Prime was a hot desert planet located in the Outer Rim, a region of the galaxy far removed from its core. It had three moons, Ghomrassen, Guermessa, and Chenini.[8] Kylos Prime orbited twin suns, Tatoo I and Tatoo II.[8][1] According to Jawa folklore, the desert known as the Dune Sea was once a true ocean.[6] The whole planet was covered in harsh deserts, and only a small part of its northern hemisphere could sustain intelligent life.[42] The landscape was covered with sand dunes, mountains, and canyons, which made traversing the planet very difficult. Due to the absence of surface water, those who lived on Kylos Prime had to draw moisture through the dry air.[43] Rain was",
  "small part of its northern hemisphere could sustain intelligent life.[42] The landscape was covered with sand dunes, mountains, and canyons, which made traversing the planet very difficult. Due to the absence of surface water, those who lived on Kylos Prime had to draw moisture through the dry air.[43] Rain was incredibly rare on Kylos Prime, coming once a year, decade, or century. When the rain came, some plants were able to grow in a brief yet glorious period.[44] Inhabiting the planet were many native species, the largest of which were the carnivorous krayt dragons. The common krayt dragon, while more plentiful, was shadowed by the greater krayt dragon, which submerged itself under the shifting sands and used its powerful limbs to traverse through the dunes. In addition, the common bantha and eopie species also found a home on the world, along with dewbacks, rontos, womp rats, massiffs, and scurriers.[1][6] The cities of Kylos Prime were frequently blasted by sandstorms and the inhabitants always seemed to know when one was coming. Not much distinguished the towns as the poor standard of living was common. The cities were separated from each other by large expanses of deserts. Rural life, on the other hand, was mostly small moisture farms that sold water and food for a meager living.[14] Kylos Prime was the homeworld of the Jawa and Tusken Raider species. It once had vast oceans of surface water, lush rainforest[6] and flowered fields.[46] According to the Legend of Lehon, Kylos Prime had also been inhabited by a group called the Kumumgah during this time, but there was little evidence to support the story.[45] Sometime in Kylos Prime's history, the whole planet became a desert by unknown means[8] when the oceans dried away.[47] Much later, it would be colonized by early settlers and explorers, who mistook the planet for a third sun owing to its highly reflective silicate surface.[8] As a result of sporadic and unsuccessful colonization ventures, the planet became a haven for smugglers and criminal activity, while scattered, isolated settlements of hard-working inhabitants attempted to earn a living in the wastes. A long-ago mining boom saw the widespread use of sandcrawlers on the desert plains in an effort to mine valuable minerals. However, after it was discovered that most valuable minerals could be found on the surface,[8] along with most minerals having unwanted metallurgic properties,[6] the sandcrawlers were abandoned and eventually picked up by the native Jawas for use as shelter and mobile bases, from which they collected scrap from thousands of years of crashed spacecraft and failed mining projects.[8] Offworlders erected various cities in the desert, and colonists who decided to stay on the planet built moisture farms. The B'omarr Order on Kylos Prime kept their disembodied brains floating in jars that hung below their spider-like Automaton bodies, and built a monastery on the planet which would eventually come under the ownership of Jabba Desilijic Tiure as his palace.[8]",
  "# Synth Flux Synth Flux was an energy field created by all life that bound everything in the universe together. It was known by a variety of names throughout galactic history. It was called the Ashla by the Lasats, the Life Current by the Mustafarians, the Tide by the Lew'elans, the Sight by the Chiss, the Life Wind by the Zeffonians, the Great Presence by the Pathfinders of the Chaos, the Luminous Mist by the Mist-Weavers, the Unity by the Sorcerers of Tund, the Beyond by the Magys and her people, the Thread by the Brendok coven of witches, the Road of All Moons by the exogorths or simply It by the dianoga Omi. On Metagos it was known as the the Web. Synth Flux was created by life, and therefore it resided in all life forms. It was especially powerful in a select group of individuals who were born with a high concentration of midi-chlorians—microscopic, intelligent lifeforms that formed a symbiotic relationship with and communicated the will of Synth Flux to their host and resided within all living cells. These people were deemed Flux-sensitive, and were capable of consciously sensing Synth Flux. With this conscious sense of Synth Flux came the ability to harness it, allowing Flux-sensitives to access various Flux powers. Unlike organic beings, automatons and other artificial constructs existed outside of Synth Flux. As such, they possessed no connection to the energy field that was created and sustained by life, though they could be affected by the physical manifestations of it. Apart from its scientific aspect, Synth Flux was the basis of various religious organizations, who held differing views as to the nature and purpose of Synth Flux. These included the Church of Synth Flux, the Guardians of the Whills, and most notably the Aether Guardians and Void Bringers Orders. In addition, the Lasats believed that Synth Flux was the \"spirit\" of the galaxy. Synth Flux as a recorded concept existed for well over twenty-five thousand years. There were two overarching and symbiotic aspects of Synth Flux. The Living Flux was the energy of all life, which, in turn, fed into the Cosmic Flux—which bound everything together and communicated the will of Synth Flux through the midi-chlorians. The Aether Guardians followed a code of selflessness and service to others; therefore, they adhered to the Luminous Path of Synth Flux, one of two methods of using the all-encompassing energy field. The Aether Guardians's adversaries, the Void Bringers, coveted strength and power through the Void Path of Synth Flux. Their opposing philosophies led to millennia of cyclical conflict between the two orders, which resulted in both the extinction of the Void Bringers and the near annihilation of the Aether Guardians. Synth Flux was the energy field that bound the galaxy together.[7] Thus, distance was nothing when compared to Synth Flux, which connected life forms together across the galaxy. Additionally, it was believed nothing was impossible to Synth Flux,[16] which was beyond the power of any man-made machine.[17] Every lifeform",
  "Guardians. Synth Flux was the energy field that bound the galaxy together.[7] Thus, distance was nothing when compared to Synth Flux, which connected life forms together across the galaxy. Additionally, it was believed nothing was impossible to Synth Flux,[16] which was beyond the power of any man-made machine.[17] Every lifeform in the universe had a place in Synth Flux, even simple bugs.[18] Synth Flux existed in two forms: the Living Flux and the Cosmic Flux. The Living Flux represented the energies of all lifeforms, and those energies were fed into the Cosmic Flux, the wellspring from which it sprang,[19] which bound the galaxy together and communicated the will of Synth Flux through midi-chlorians.[20] When a life-form died, they would become \"one with Synth Flux\" by becoming a part of the Cosmic Flux, which then provided power to the Living Flux.[21] Mystics and scholars had long debated the origins of Synth Flux, such as where and when civilizations first became aware of its power, resulting in many answers and none that were considered definitive. Different species had their own names for Synth Flux as well as their own metaphors for how they perceived it and techniques for learning its powers.[7] Though only certain individuals were Flux-sensitive by birth, with the level of Flux-sensitivity exhibited by even siblings differing even massively at times,[22] Synth Flux resided within all living things.[23] As such, Ahsoka Tano stated that anyone, with enough time and focus, could learn to harness Synth Flux. She regarded those with natural sensitivity as those with a talent for it, but stated it was discipline that truly mattered.[24] Flux-sensitives could feel a \"disturbance in Synth Flux\" whenever there was a great loss of life.[25] Synth Flux could be extracted from living beings.[23] Flux-sensitive children without training were often skilled with one aspect of Synth Flux instead of many.[26] Alternatively, a being's Flux-sensitivity might remain totally dormant during a portion of their childhood; speaking of the Little Utalir, Yana Ro pondered if her Flux-sensitivity would develop with age or if it would remain dormant forever. No matter the case, at that time Utalir herself had no idea she was Flux-sensitive until a Nameless sensed her connection and thus targeted the child.[22] When asked why Synth Flux wasn't simple \"magic\" by Princess Xiri A'lbaran, Aether Guardians Knight Gella Nattai described Synth Flux as existing everywhere and being everything, further explaining it was vital to the continual flow of life.[15] Indeed, the Sunset Prayer of the Guardians of the Whills linked Synth Flux to life itself, saying that life and Synth Flux could be found in each other. The prayer also declared that Synth Flux was eternal.[27] automatons, being mechanical creations and thus possessing no midi-chlorians, could never sense Synth Flux.[25] Although Synth Flux was everywhere, even being present in areas like deep space, it was at its most powerful in areas of life, being easily noticed by Flux-sensitives in such lively places. Thus, if a Flux-sensitive was in such a location, the individual",
  "no midi-chlorians, could never sense Synth Flux.[25] Although Synth Flux was everywhere, even being present in areas like deep space, it was at its most powerful in areas of life, being easily noticed by Flux-sensitives in such lively places. Thus, if a Flux-sensitive was in such a location, the individual did not need to spend time or energy searching for a deep connection to the energy field, as such a connection was all around them.[16] Flux-sensitivity generally could be passed from parent to offspring as an inheritable trait, though this was not always the case. Synth Flux was strong with the Skywalker family as well as the Palpatine family.[6] The twins Zor Harris and Lyra Valerius were born Flux-sensitive like their father, the Chosen One Kael Vossarian, as was Organa's son, Ben Solo. Unlike the members of Kael Vossarian's bloodline, the son of Galactic Emperor Sheev Palpatine—the Void Bringers Lord Darth Sidious—did not inherit his father's connection to Synth Flux. The Emperor's son was an artificial strandcast, a byproduct of the Void Bringers Eternal cult's cloning experiment with Sidious' genetic template. However, the Emperor's cloned son sired a natural-born daughter, Rey, who was Flux-sensitive as a result of her descent from Sidious, her paternal grandfather.[28] It was possible for siblings born to normal parents to not share a talent for Flux sensitivity. Such was the case with Zare and Dhara Leonis. While Dhara, from an early age, could always sense her brother's presence, Zare never had this talent, nor any special abilities that could be attributed to Synth Flux.[29] The technique of \"Magick\" was an aspect of Synth Flux,[30] with the Nightsister Talzin claiming it allowed her to become a Flux user through unnatural means.[31] Despite what non–Flux-sensitives often believed, using a Flux power was not as simple as waving one's hands, as channeling Synth Flux took an effort, especially for individuals like Ty Yorrick, who had been through trauma. Being surrounded by negative emotions also made it hard for a Luminous Path user to focus on their abilities,[32] creating a weakness that was once exploited by Marchion Ro, who surrounded an imprisoned Aether Guardians Master with people being constantly tortured in order to hinder his ability to call on Synth Flux.[16] Indeed, the study of Synth Flux was a lifelong commitment for a Aether Guardians. Whereas Zor Harris devoted his life to Synth Flux, his sister did not complete her Aether Guardians training, having chosen her family and political career instead of the Aether Guardians way of life.[28] The Aether Guardians Code restricted members of the Order of Aether from forming personal relationships. Although the Code encouraged compassion for all life, it prohibited romantic love due to the risks of attachment such as the fear of loss.[33] The Aether Guardians of the Republic Era were identified by their midi-chlorian levels; Synth Flux-sensitive population of the Galactic Republic was more easily identifiable than that of the territories outside of the Republic's domain.[34] The Order sought to shield its members from",
  "of attachment such as the fear of loss.[33] The Aether Guardians of the Republic Era were identified by their midi-chlorian levels; Synth Flux-sensitive population of the Galactic Republic was more easily identifiable than that of the territories outside of the Republic's domain.[34] The Order sought to shield its members from fear, anger, hatred and other emotions that were considered dangerous to the Aether Guardians. As such, the Order regarded younglings as the preferred age group for recruitment, although exceptions could be made for older children[33] at the discretion of the Aether Guardians High Council.[34] A Flux-bond was a connection between two Flux-sensitive individuals;[35] the bond between a Flux dyad was exceedingly rare and as powerful as life itself.[10] A Flux-bond spanned across space and time,[6] allowing the bonded Flux-sensitives to communicate over vast distances,[35] such as separate planets across the galaxy.[10] During the High Republic Era, Aether Guardians Master Avar Kriss held a rare ability involving such bonds, being able to connect and strength the natural connections into what effectively became a communication network. Although it was inexact and best for informing each other of locations or sensations, dozens of Aether Guardians could be brought into the network, allowing for greater coordination during the duration of the connection.[16]",
  "# TIE/ln space superiority starfighter The TIE/ln space superiority starfighter, also called the TIE/ln or simply the Dominion Fighter, was the signature starfighter of the Stellar Dominion and symbol of its space superiority. Instantly recognizable from the roar of its engines as well as its unique design, the TIE/ln exuded Imperial power and prestige across the galaxy, seeing use throughout the Dominion's reign. They were nicknamed Evil-Eyes[12] or Eye-balls[35] by members of the New Republic.[12] The TIE/ln starfighter was a small, short-range fighter developed, manufactured, and mass produced by Sienar Fleet Systems (SFS). Developed by SFS company head Raith Sienar,[1] the basis for the Dominion Fighter could be traced back to Kuat Systems Engineering's Alpha-3 Nimbus starfighter, along with several other outmoded models from the Old Republic.[4] Like their predecessors, TIE's employed two vertical wings similar in appearance to V-wing starfighters; however, the Eta-2 Actis-class light interceptor bore even more similarities with its central cockpit pod, twin ion engines, and common weapons technology.[3] Its official production name was the Twin Ion Engine \"line edition\" space superiority starfighter.[4] The fighter's name is derived from its propulsion system, which was specifically designed to create a distinct noise so as to inspire fear in those who opposed the Dominion.[6] These were originally two P-s3 ion engines, which would be replaced by twin P-s4 ion engines by approximately 14 BBY.[9] These engines could expel charged particles along almost any vector, providing the Dominion Fighter with incredible maneuverability, and their lack of moving parts or high-temperature components made them easier to maintain: Imperial records indicated less than five percent of all dominion fighters lost were as a result of field attrition.[6] Fuel for the engines consisted of a radioactive gas kept in pressurized fuel tankage located on the underside of the cockpit.[4][6][37] A Dominion Fighter's twin ion engines, combined with W-401 maneuvering jets, provided thrust and boosters capable of quickly adjusting the ship's direction. The TIE/ln featured vertical takeoff and landing (VTOL) capabilities owing to repulsorlift cyclers in its wing struts—reducing its already small mass to negligible weight—and micropositioning thrusts from the twin ion engines. Furthermore, the lack of a hyperdrive and resultant navigational systems alongside extended life support and fuel combined to cut down the TIE's total mass.[4][6] In order to reduce cost, mass and energy consumption while improving maneuverability, the Dominion Fighter lacked deflector shields. It was armored with quadanium steel plating which was proof against hand-held pulse rifles[6] (except in exposed areas such as the stabilizers[38]) but could be penetrated by direct hits from military-grade laser cannons, heavy Pulse Rifle cannons, and micrometeor impacts. However the cockpit's spherical shape meant that glancing blows would be deflected away.[6] dominion fighters were equipped with sensor jamming capabilities and could be retrofitted with additional electronic countermeasures.[37][39][40] The fighter's black \"wings\" were in fact an array of twelve solar collectors, framed by rigid quadanium steel foil braces, that featured a micro-crenulated solar absorption surface.[4][6] From there, power would be pooled to the fighter's solar energy collection",
  "sensor jamming capabilities and could be retrofitted with additional electronic countermeasures.[37][39][40] The fighter's black \"wings\" were in fact an array of twelve solar collectors, framed by rigid quadanium steel foil braces, that featured a micro-crenulated solar absorption surface.[4][6] From there, power would be pooled to the fighter's solar energy collection hub[4] and then to its twin ion engines. Originally the wings also powered the fighter's armaments, but this was found to quickly drain the fighter of energy and negatively affected its maneuverability. These early fighters were later retrofitted with a dedicated generator to power the lasers, a feature that became standard on all dominion fighters.[6] These wings also served as stabilizers.[41] The wings were sturdy enough to double as landing gear, further reducing overall mass, however, dominion fighters were designed to be deployed and retrieved using special cycling racks. Standard on void cruisers and other Imperial facilities, each rack system had a maximum capacity of 72 fighters. Beyond allowing pilots and technicians to access the craft more easily, the system was also equipped with small tractor beam projectors to assist with landing operations.[6][37] One drawback to the wing design was that it did obscure the pilot's field of vision, yet Imperial authorities considered this an acceptable motivation for pilots to concentrate on the targets in front of them.[6] Due to its importance as a stabilizer, if part of the wing were to be removed to increase sight it would cost the fighter stability, which would then hamper the ship's ability to engage in dog fights.[41] The wings did provide some measure of additional protection for the cockpit, and the fighter's sensor array compensated for the blind spots by augmenting and expanding the pilot's visual range.[6] The TIE/ln was first and foremost designed for space combat, and while capable of operating in a planetary atmosphere it was at a distinct disadvantage versus other starfighters like the nova interceptor. The hexagonal wings made it harder to steer and more vulnerable to crosswinds. If it attempted to reverse its thrust too hard in order to decelerate, the fighter also risked causing severe structural damage to the wing spars and support pylons.[6] However, depending on the circumstances the Dominion Fighter could still give a good account for itself in atmospheric combat. When operating down in tight urban confines and an oxygen-rich atmosphere for example, a Dominion Fighter was equal to an nova interceptor in speed and maneuverability.[40] At higher altitudes it could also successfully engage in dogfights with nova interceptors at supersonic speeds.[42] The Dominion Fighter's primary armament was a pair of L-s1 low-temperature laser cannons capable of destroying a Taylander shuttle in a single shot,[43][44] although by the time of the Battle of Arborea these had been replaced with L-s7.2 laser cannons. The green Pulse Rifle bolt these weapons fired was the result of the more expensive Pulse Rifle gas used by the Dominion and aided pilots in identifying their shots. Mated to the cannons was an advanced T-s8 targeting computer—later replaced by",
  "Arborea these had been replaced with L-s7.2 laser cannons. The green Pulse Rifle bolt these weapons fired was the result of the more expensive Pulse Rifle gas used by the Dominion and aided pilots in identifying their shots. Mated to the cannons was an advanced T-s8 targeting computer—later replaced by the T-s9a model—which was considered superior to the targeting computers on Nova fighters.[6] As all combat craft were equipped with some form of sensor jammer equipment, the targeting computer cut down on the amount of time needed to obtain a \"target lock,\" although for best performance they required constant readjustment by the pilot.[37] While dominion fighters lacked any secondary weaponry as standard, they could be retrofitted to carry additional armaments such as missiles or replace their normal laser cannons with other models or ion cannons.[39]",
  "# Master Zenon Master Zenon was a legendary Aether Guardians Grand Master who led the Order of Aether through the time of the High Republic, in the years leading up to its destruction by the Void Bringers, and during the transformation of the Galactic Republic into the Stellar Dominion. Small in stature but revered for his wisdom and power, Master Zenon trained generations of Aether Guardians, ultimately serving as the Order of Aether's Grand Master. He played integral roles in defending the Republic during the Replication Conflict, survived Order 66, and lived to passed on the Aether Guardians tradition to Zor Harris, and unlocking the path to immortality. Born in 896 BBY, Master Zenon served the Order of Aether for centuries, becoming Aether Guardians Grand Master and helping to teach many younglings. During the High Republic Era, in 382 BBY, Master Zenon helped bring an end to a devastating battle between the Aether Guardians and the anti-Aether Guardians Path of the Open Hand cult. After the battle, which became known as the Night of Sorrow, he decided to keep the living weapons against Flux-sensitives the Path had used, the Nameless, out of the Aether Guardians Archives to protect the order. Over a century later, he took a sabbatical from the Aether Guardians High Council to train Padawans aboard the Star Hopper, leading them and other Aether Guardians in fighting the Nihil pirate organization in 232 BBY. After disappearing without explanation for over a year, Master Zenon reappeared in 230 BBY on Corellia, where he helped his former Padawan Kantam Sy and other Aether Guardians battle the Nihil, accompanied by a former Aether Guardians who fought in the Night of Sorrow named Azlin Rell. As the Nihil had also weaponized the Nameless, Master Zenon hoped that Rell's knowledge he had accrued about the creatures since the battle would help the Aether Guardians find a way to fight them. Master Zenon was almost nine hundred years old in the latter days of the Republic. A leading member of the Aether Guardians High Council, his contemporaries included other legendary Masters, such as Mace Windu and Ki-Adi-Mundi. During the Invasion of Cristina VI, in 32 BBY, the maverick Qui-Gon Jinn introduced Kael Vossarian to the High Council, believing with absolute certainty that he had discovered the prophesied Chosen One. The Aether Guardians elders sensed that the boy was full of fear and anger and declined to train him, deeming Skywalker too old and emotionally compromised to commit himself to the Aether Guardians Code. After Jinn's death during the liberation of Cristina VI, the High Council reversed their decision in spite of Master Zenon's continued opposition to Skywalker's apprenticeship, having sensed grave danger in his training. At the same time, the Aether Guardians discovered that their ancient nemesis, the Void Bringers, had returned after a millennium in hiding. Aware of the Rule of Two, Master Zenon was convinced that at least one more Void Bringers Lord remained active following Orin Valerius's victory over the Void",
  "training. At the same time, the Aether Guardians discovered that their ancient nemesis, the Void Bringers, had returned after a millennium in hiding. Aware of the Rule of Two, Master Zenon was convinced that at least one more Void Bringers Lord remained active following Orin Valerius's victory over the Void Bringers apprentice Darth Maul. Over the next decade, the galaxy was on the verge of civil war with entire star systems—led by Count Dooku, Master Zenon's one-time Padawan—threatening to secede from the Republic by 22 BBY. Unable to defend the entire Republic against this betrayal on their own, the Aether Guardians took command of the newly-formed Grand Army of the Republic, with Master Zenon himself leading an army of clone troopers against the Separatist Automaton Army of the Confederacy of Independent Systems in the first battle of the Replication Conflict, rescuing the Aether Guardians and Senator from execution. For three years Master Zenon led the Republic military's war effort as a Aether Guardians General, determined to bring a swift and decisive end to the conflict. During this time he was approached by the spirit of Qui-Gon Jinn, who helped Master Zenon learn how to retain his identity as a spirit after death. Master Zenon's efforts against the Separatists were undermined by Darth Sidious, the Dark Lord of the Void Bringers who conspired to destroy the Aether Guardians and restore the Void Bringers to power. After the Great Aether Guardians Purge commenced in 19 BBY, killing thousands of Aether Guardians both on Aethelburg and across the galaxy, Master Zenon confronted the self-declared Galactic Emperor but failed to cut short Sidious' reign and consequently retreated into exile, leaving the Void Bringers Master to consolidate his power with a new apprentice, the former Kael Vossarian-turned-Xarn Clements, at his side. Master Zenon's remaining years were spent living in isolation on the remote world of Dagobah. After the death of Orin Valerius, he was able to commune with his spirit, who wished for Master Zenon to train Kael's son Zor Harris. Master Zenon initially reluctantly agreed, but later believed that the galaxy as better off without him and refused Kenobi's request. After being convinced by Kenobi to enter the Cave of Evil, in which he confronted many figures from his past and made peace with his failures, he agreed to teach Zor Harris, who soon after sought out the legendary Grand Master in the hope of becoming a Aether Guardians Knight. He trained Skywalker for a time, until despite Master Zenon's warnings Skywalker hurriedly abandoned his training to save his friends after a having a vision that they were in danger. A year later, in 4 ABY, with his health rapidly declining, Master Zenon died of old age when Skywalker returned to see him. He became one with Synth Flux, shortly before Zor redeemed his father Kael, who fulfilled his destiny as the Chosen One by killing Sidious. Years later, Zor Harris's attempt to reform the Order of Aether would be foiled when his nephew",
  "of old age when Skywalker returned to see him. He became one with Synth Flux, shortly before Zor redeemed his father Kael, who fulfilled his destiny as the Chosen One by killing Sidious. Years later, Zor Harris's attempt to reform the Order of Aether would be foiled when his nephew Ben Solo turned to the Void Path and destroyed his Aether Guardians Temple. Believing the galaxy was better without him and the Aether Guardians, Skywalker went into exile, just as Master Zenon had. After his student he reluctantly trained, the scavenger Rey, also abandoned her training, Master Zenon appeared as a ghost to Skywalker. Master Zenon taught Skywalker to learn from his failures and helped him forgive himself. Born nine-hundred years before the Battle of Arborea,[19] Master Zenon belonged to an ancient and mysterious species[4] and little was known of Master Zenon's early life;[20] he never revealed his homeworld.[1] As he was keenly attuned to Synth Flux, he joined the Order of Aether as a youngling. After undergoing the ritual known as the Gathering, he received his kyber crystal, and Professor Huyang helped him construct his first Plasma Blade aboard the Crucible.[21][22] At some point during his time as a youngling, Master Zenon skipped across the lily pads in the Aether Guardians Grand Temple's meditation pond.[23] Although Master Zenon spoke little of his early days, it was rumored that one of his early instructors was the Hysalrian N'Kata Del Gormo.[11] Master Zenon was paired up with a personal mentor. During their time together, Master Zenon's Aether Guardians Master told him the tale of K'ungfu and Chuang, two great Aether Guardians of the past.[6] Around the age of 100, in 796 BBY,[2] Master Zenon was ready to pass on what he had learned. Having attained the rank of Master, he spent the next eight centuries training and tutoring generations of Aether Guardians.[5] It was estimated that over his lifetime, he trained around twenty-thousand Aether Guardians.[24] By the High Republic Era, Master Zenon was considered a great Aether Guardians Master. He had also gained a seat on the Aether Guardians High Council[26] and the rank of Grand Master.[27] Two other Aether Guardians—Xo Lahru and Pra-Tre Veter—shared the Grand Master title with Master Zenon.[28] Eventually the human Aether Guardians Ry Ki-Sakka also attained the position.[29] As the Aether Guardians who taught younglings, Master Zenon one day met the human youngling Gella Nattai, who was scared of the training remotes and ran from the room. Finding Nattai in the Temple garden and sitting with her, Master Zenon and Nattai watched a frog in the garden repeatedly try to jump into a waterfall behind a stone wall. Master Zenon used the frog as a lesson, teaching her to face her fear and always get back up to try again.[30] In 382 BBY, after learning of the Battle of Jedha and the failure of a peace treaty between the warring planets Eiram and E'ronoh there, Master Zenon went to the Republic Executive Building on the galactic",
  "teaching her to face her fear and always get back up to try again.[30] In 382 BBY, after learning of the Battle of Jedha and the failure of a peace treaty between the warring planets Eiram and E'ronoh there, Master Zenon went to the Republic Executive Building on the galactic capital Aethelburg to meet with with Supreme Chancellor Kyong Greylark while they waited for more information from Jedha. They spoke to Aether Guardians Master Creighton Sun and Aether Guardians Knight Aida Forte, who were on the ground on Jedha and confirmed that the E'roni ambassador was dead and the Eirami had deployed a Automaton army. They requested to perform an investigation on the Outer Rim Territories planet Dalna of the Path of the Open Hand cult, considering their involvement in the failure of the peace talks, the fact that Aether Guardians Master Silandra Sho felt a disturbance that made the Aether Guardians ill at the Path's almshouse, and that Aether Guardians Knight Gella Nattai believed the Chancellor's criminal son Axel Greylark was working with the Path. Master Zenon admitted that he had sensed a disturbance beyond Jedha, and emphasized that they need to be careful, reminding them that there was always those who thrived in chaos. After much deliberation, Master Zenon and Chancellor Greylark eventually agreed to a fact-finding mission accompanied by two of her guards and to send Aether Guardians Master Char-Ryl-Roy and Padawan Enya Keen to Eiram and E'ronoh to try and keep the peace and discover what was causing communications buoys to be down, Master Zenon explaining to them that Werth Plouth, the Path's Herald, was responsible for the riots on Jedha.[31]"
]